Repository: tim-janik/beast
Catalog: po/*.po
Languages: fr, it, ja, ne

source: Wave "%s": failed to load wave chunk for frequency %f: %s
fr: Son « %s » : échec de chargement d'une partie d'onde de fréquence %f : %s
it: Wave "%s": fallito il caricamento del pezzo wave alla frequenza %f: %s
ne: तरङ्ग "%s": आवृति %f का लागि तरङ्ग टुक्रा लोड गर्न असफल: %s

source: Wave Form
fr: Forme d'onde
it: Forma d'onda
ja: 波形
ne: तरङ्ग फारम

source: Wave Output
fr: Sortie onde
it: Uscita Wave
ja: 波形出力
ne: तरङ निर्गत

source: Wave Repository
fr: Magasin d'ondes
it: Deposito Wave
ja: Wav リポジトリ
ne: तरङ्ग भण्डारण

source: Wave to be used as instrument
fr: Son à utiliser en tant qu'instrument
it: Wave che possono essere usati come strumento
ja: インストゥルメントとして使う波形
ne: बाजाको रूपमा प्रयोग गरिने तरङ्ग

source: Wave used as oscillator source
fr: Son utilisée en tant que source d'oscillateur
it: Forma d'onda usata come oscillatore sorgente
ja: 発振器ソースとして使う波形
ne: ओस्सिलेटर स्रोतको रूपमा प्रयोग गरिने तरङ्ग

source: Wave_s
fr: Son_s
ne: तरङ्ग

source: Waves
fr: Ondes
ja: Wave ファイル
ne: तरङ्ग

source: Wet out [%]
fr: Sortie son traité [%]
ja: Wet 出力 [%]
ne: वेट निर्गत [%]

source: Whole note
fr: Ronde
it: Nota Intera (semibreve)
ja: 全ノート
ne: पूरै द्रष्टव्य

source: Window Size
fr: Taille de la fenêtre
it: Dimensione Finestra
ja: ウィンドウサイズ
ne: सञ्झ्याल साइज

source: Write failed
fr: Échec à l'écriture
it: Scrittura fallita
ne: लेख्न असफल

source: Write project to a specific file
fr: Enregistre le projet dans un fichier donné
it: Scrivi progetto in uno specifico file
ja: 指定するファイルにプロジェクトを書き込み
ne: निर्दिष्ट फाइलमा परियोजना लेख्नुहोस्

source: Write project to disk
fr: Enregistre le projet sur disque
it: Scrivi progetto su disco
ja: プロジェクトをディスクに書き込み
ne: परियोजना डिस्कमा लेख्नुहोस्

source: Wrong number of channels
fr: Nombre de canaux erroné
it: Numero di canali non corretti
ne: च्यानलको गलत नम्बर

source: XtalStrings Output
fr: Sortie XtalStrings
ja: XtalStrings 出力
ne: एक्सटाल स्ट्रिङ निर्गत

source: Young Temperament
fr: Tempérament de Young

source: Zero Value Color
fr: Couleur d'une valeur nulle
it: Valore Colore Zero
ja: 0 値の色
ne: शून्य मान रङ

source: _About...
fr: À _propos...
it: _Altro...
ja: 情報(_A)...
ne: बारेमा...

source: _Add
fr: _Ajouter
it: _Aggiungi
ja: 追加(_A)
ne: थप्नुहोस्

source: _Apply
fr: _Appliquer
it: _Applica
ja: 適用(_A)
ne: लागू गर्नुहोस्

source: _Audio Sources
fr: Sources _audio
it: Sorgenti _Audio
ja: オーティオソース(_A)
ne: अडियो स्रोत

source: _Back
fr: En _arrière
it: Indietro
ja: 戻る(_B)
ne: पछाडि

source: _Beast Website...
fr: Site Web de _Beast...
it: Sito Web _BEAST...

source: _Cancel
fr: A_nnuler
it: _Cancella
ja: 取り消し(_C)
ne: रद्द गर्नुहोस्

source: _Clear Undo
fr: _Effacer les annulations
it: Pulis_ci Annulla
ja: アンドゥをクリア(_C)
ne: पूर्वस्थितिमा फर्काएको खाली गर्नुहोस्

source: _Close
fr: _Fermer
it: _Chiudi
ja: 閉じる(_C)
ne: बन्द गर्नुहोस्

source: _Demo
fr: _Démo
ja: デモ(_D)
ne: डेमो

source: _Distortion
fr: _Distorsion
it: _Distorsione
ja: 歪み(_D)
ne: बग्याई

source: _Edit
fr: É_dition
it: Modifica
ja: 編集(_E)
ne: सम्पादन

source: _Enhance
fr: Amélior_er
it: Aumenta
ja: 強調(_E)
ne: बढाउनुहोस्

source: _File
fr: _Fichier
ja: ファイル(_F)
ne: फाइल

source: _Filters
fr: _Filtres
it: _Filtri
ja: フィルタ(_F)
ne: फिल्टर

source: _Find
fr: _Rechercher
it: _Trova
ja: 検索(_F)
ne: खोजी गर्नुहोस्

source: _Forward
fr: En a_vant
it: Avanti
ja: 進む(_F)
ne: अगाडि

source: _Help
fr: Aid_e
it: _Aiuto
ja: ヘルプ(_H)
ne: मद्दत

source: _Import MIDI...
fr: _Importer un fichier MIDI...
it: _Importa MIDI...
ja: MIDI をインポート(_I)...
ne: MIDI आयात गर्नुहोस्...

source: _Input & Output
fr: _Entrée & Sortie
it: _Ingresso & Uscita
ja: 入出力(_I)
ne: आगत र निर्गत

source: _Merge...
fr: _Fusionner...
it: Inserisci...
ja: 統合(_M)...
ne: गाभ्नुहोस्...

source: _Misc
fr: _Divers
ja: その他(_M)
ne: विविध

source: _New
fr: _Nouveau
it: _Nuovo
ja: 新規(_N)
ne: नयाँ

source: _Open...
fr: _Ouvrir...
it: Apri...
ja: 開く(_O)...
ne: खोल्नुहोस्.....

source: _Other Sources
fr: _Autres sources
it: Altre Sorgenti
ja: 他のソース(_O)
ne: अन्य स्रोत

source: _Play
fr: _Jouer
it: Ri_produci
ja: 演奏(_P)
ne: प्ले गर्नुहोस्

source: _Preferences...
fr: _Préférences...
it: _Preferenze...
ja: 設定(_P)...
ne: प्राथमिकता...

source: _Project
fr: _Projet
it: _Progetto
ja: プロジェクト(_P)
ne: परियोजना

source: _Quantization
fr: _Calage temporel
it: _Quantizzazione
ja: 量子化(_Q)
ne: क्वान्टिजेसन

source: _Quick Start...
fr: _Démarrage rapide...
it: Tutorial...
ne: शिघ्र सुरु...

source: _Quit
fr: _Quitter
it: Esci
ja: 終了(_Q)
ne: अन्त्य गर्नुहोस्

source: _Redo
fr: _Rétablir
it: _Ripristina
ja: リドゥ(_R)
ne: रिडु गर्नुहोस्

source: _Release Notes...
fr: Info_rmations de version...
it: Note di _Rilascio...
ja: リリースノート(_R)...
ne: टिप्पणी निष्काशन गर्नुहोस्...

source: _Reload
fr: _Recharger
it: _Ricarica
ja: 再読み込み(_R)
ne: पुन: लोड गर्नुहोस्

source: _Remove
fr: Supprime_r
it: _Rimuovi
ja: 削除(_R)
ne: हटाउनुहोस्

source: _Routing
fr: _Routage
it: Instradamento
ja: ルーティング(_R)
ne: राउटिङ

source: _Save
fr: _Enregistrer
it: _Salva
ja: 保存(_S)
ne: बचत गर्नुहोस्

source: _Select
fr: _Sélectionner
it: _Seleziona
ne: चयन गर्नुहोस्

source: _Skins
fr: Apparence_s
it: Interfacce
ja: スキン(_S)
ne: स्किन

source: _Song
fr: _Mélodie
it: Canzone
ja: 曲(_S)
ne: गीत

source: _Stop
fr: _Arrêter
it: Ferma
ja: 停止(_S)
ne: रोक्नुहोस्

source: _Synth
fr: _Synthèse
ja: シンセ(_S)
ne: सिन्थ

source: _Synthesizers
fr: _Synthétiseurs
it: _Sintetizzatori
ja: シンセサイザー(_S)
ne: सिन्थेसाइजर

source: _Tools
fr: _Outils
it: Strumenti
ja: ツール(_T)
ne: उपकरण

source: _Undo
fr: A_nnuler
it: Ann_ulla
ja: アンドゥ(_U)
ne: पूर्वस्थितिमा फर्काउनुहोस्

source: _Utilities
fr: _Utilitaires
it: Utilità
ja: ユーティリティ(_U)
ne: उपयोगि

source: _View
fr: Afficha_ge
it: _Vista
ja: ビュー(_V)
ne: दृश्य

source: _Virtualization
fr: _Virtualisation
it: _Virtualizzazione
ja: 仮想化(_V)
ne: अवास्तविकता

source: connection terminated
fr: connexion terminée
it: connessione terminata
ne: जडान समाप्त

source: control-102
fr: contrôle-102
it: controllo-102
ja: コントロール 102
ne: नियन्त्रण-१०२

source: control-103
fr: contrôle-103
it: controllo-103
ja: コントロール 103
ne: नियन्त्रण-१०३

source: control-104
fr: contrôle-104
it: controllo-104
ja: コントロール 104
ne: नियन्त्रण-१०४

source: control-105
fr: contrôle-105
it: controllo-105
ja: コントロール 105
ne: नियन्त्रण-१०५

source: control-106
fr: contrôle-106
it: controllo-106
ja: コントロール 106
ne: नियन्त्रण-१०६

source: control-107
fr: contrôle-107
it: controllo-107
ja: コントロール 107
ne: नियन्त्रण-१०७

source: control-108
fr: contrôle-108
it: controllo-108
ja: コントロール 108
ne: नियन्त्रण-१०८

source: control-109
fr: contrôle-109
it: controllo-109
ja: コントロール 109
ne: नियन्त्रण-१०९

source: control-110
fr: contrôle-110
it: controllo-110
ja: コントロール 110
ne: नियन्त्रण-११०

source: control-111
fr: contrôle-111
it: controllo-111
ja: コントロール 111
ne: नियन्त्रण-१११

source: control-112
fr: contrôle-112
it: controllo-112
ja: コントロール 112
ne: नियन्त्रण-११२

source: control-113
fr: contrôle-113
it: controllo-113
ja: コントロール 113
ne: नियन्त्रण-११३

source: control-114
fr: contrôle-114
it: controllo-114
ja: コントロール 114
ne: नियन्त्रण-११४

source: control-115
fr: contrôle-115
it: controllo-115
ja: コントロール 115
ne: नियन्त्रण-११५

source: control-116
fr: contrôle-116
it: controllo-116
ja: コントロール 116
ne: नियन्त्रण-११६

source: control-117
fr: contrôle-117
it: controllo-117
ja: コントロール 117
ne: नियन्त्रण-११७

source: control-118
fr: contrôle-118
it: controllo-118
ja: コントロール 118
ne: नियन्त्रण-११८

source: control-119
fr: contrôle-119
it: controllo-119
ja: コントロール 119
ne: नियन्त्रण-११९

source: control-14
fr: contrôle-14
it: controllo-14
ja: コントロール 14
ne: नियन्त्रण-१४

source: control-15
fr: contrôle-15
it: controllo-15
ja: コントロール 14
ne: नियन्त्रण-१५

source: control-20
fr: contrôle-20
it: controllo-20
ja: コントロール 20
ne: नियन्त्रण-२०

source: control-21
fr: contrôle-21
it: controllo-21
ja: コントロール 21
ne: नियन्त्रण-२१

source: control-22
fr: contrôle-22
it: controllo-22
ja: コントロール 22
ne: नियन्त्रण-२२

source: control-23
fr: contrôle-23
it: controllo-23
ja: コントロール 23
ne: नियन्त्रण-२३

source: control-24
fr: contrôle-24
it: controllo-24
ja: コントロール 24
ne: नियन्त्रण-२४

source: control-25
fr: contrôle-25
it: controllo-25
ja: コントロール 25
ne: नियन्त्रण-२५

source: control-26
fr: contrôle-26
it: controllo-26
ja: コントロール 26
ne: नियन्त्रण-२६

source: control-27
fr: contrôle-27
it: controllo-27
ja: コントロール 27
ne: नियन्त्रण-२७

source: control-28
fr: contrôle-28
it: controllo-28
ja: コントロール 28
ne: नियन्त्रण-२८

source: control-29
fr: contrôle-29
it: controllo-29
ja: コントロール 29
ne: नियन्त्रण-२९

source: control-3
fr: contrôle-3
it: controllo-3
ja: コントローラ 3
ne: नियन्त्रण-३

source: control-30
fr: contrôle-30
it: controllo-30
ja: コントロール 30
ne: नियन्त्रण-३०

source: control-31
fr: contrôle-31
it: controllo-31
ja: コントロール 31
ne: नियन्त्रण-३१

source: control-35
fr: contrôle-35
it: controllo-35
ja: コントロール 35
ne: नियन्त्रण-३५

source: control-41
fr: contrôle-41
it: controllo-41
ja: コントロール 41
ne: नियन्त्रण-४१

source: control-46
fr: contrôle-46
it: controllo-46
ja: コントロール 46
ne: नियन्त्रण-४६

source: control-47
fr: contrôle-47
it: controllo-47
ja: コントロール 47
ne: नियन्त्रण-४७

source: control-52
fr: contrôle-52
it: controllo-52
ja: コントロール 52
ne: नियन्त्रण-५२

source: control-53
fr: contrôle-53
it: controllo-53
ja: コントロール 53
ne: नियन्त्रण-५३

source: control-54
fr: contrôle-54
it: controllo-54
ja: コントロール 54
ne: नियन्त्रण-५४

source: control-55
fr: contrôle-55
it: controllo-55
ja: コントロール 55
ne: नियन्त्रण-५५

source: control-56
fr: contrôle-56
it: controllo-56
ja: コントロール 56
ne: नियन्त्रण-५६

source: control-57
fr: contrôle-57
it: controllo-57
ja: コントロール 57
ne: नियन्त्रण-५७

source: control-58
fr: contrôle-58
it: controllo-58
ja: コントロール 58
ne: नियन्त्रण-५८

source: control-59
fr: contrôle-59
it: controllo-59
ja: コントロール 59
ne: नियन्त्रण-५९

source: control-60
fr: contrôle-60
it: controllo-60
ja: コントロール 60
ne: नियन्त्रण-६०

source: control-61
fr: contrôle-61
it: controllo-61
ja: コントロール 61
ne: नियन्त्रण-६१

source: control-62
fr: contrôle-62
it: controllo 62
ja: コントロール 62
ne: नियन्त्रण-६२

source: control-63
fr: contrôle-63
it: controllo-63
ja: コントロール 63
ne: नियन्त्रण-६३

source: control-85
fr: contrôle-85
it: controllo-85
ja: コントロール 85
ne: नियन्त्रण-८५

source: control-86
fr: contrôle-86
it: controllo-86
ja: コントロール 86
ne: नियन्त्रण-८६

source: control-87
fr: contrôle-87
it: controllo-87
ja: コントロール 87
ne: नियन्त्रण-८७

source: control-88
fr: contrôle-88
it: controllo-88
ja: コントロール 88
ne: नियन्त्रण-८८

source: control-89
fr: contrôle-89
it: controllo-89
ja: コントロール 89
ne: नियन्त्रण-८९

source: control-9
fr: contrôle-9
it: controllo-9
ja: コントロール 9
ne: नियन्त्रण-९

source: control-90
fr: contrôle-90
it: controllo-90
ja: コントロール 90
ne: नियन्त्रण-९०

source: failed to add wave chunk from file "%s": %s
fr: échec de l'ajout d'une partie du son à partir du fichier « %s » : %s
it: aggiunta non riuscita di un pezzo wave dal file "%s": %s
ne: फाइल "%s"बाट वेब भाग थप गर्न असफल: %s

source: killed by janitor
fr: tué par le gardien
ne: ज्यानिटरद्वारा मारियो

source: processing
fr: traitement
it: processamento
ja: 処理中
ne: प्रक्रिया हुँदैछ

source: %s (core dumped)
ne: %s (डम्ट गरिएको कोर)

source: /Spatial/Balance
it: /Spaziale/Bilanciamento
ja: /空間作用/バランス
ne: /स्पासियल/सन्तुलन

source: 1/128T
ne: १/१२८ टी

source: 1/16T
ne: १/१६ टी

source: 1/1T
ne: १/१ टी

source: 1/2T
ne: १/२ टी

source: 1/32T
ne: १/३२ टी

source: 1/4T
ne: १/४ टी

source: 1/64T
ne: १/६४ टी

source: 1/8T
ne: १/८ टी

source: Aftertouch
ja: アフタータッチ
ne: छोए पछि

source: Audio
ja: オーディオ
ne: अडियो

source: Audio In
it: Ingr.Audio
ja: オーティオ入力
ne: अडियो आगत

source: Audio In%u
it: Ingr.Audio%u
ja: オーディオ入力%u
ne: अडियो आगत %u

source: Audio In1
it: Ingr.Audio1
ja: オーティオ ln1
ne: अडियो आगत १

source: Audio In2
it: Ingr.Audio2
ja: オーティオ ln2
ne: अडियो आगत २

source: Audio In3
it: Ingr.Audio3
ja: オーディオ入力 3
ne: अडियो आगत ३

source: Audio In4
it: Ingr.Audio4
ja: オーディオ入力 4
ne: अडियो आगत ४

source: Audio Out
it: Uscita Audio
ja: オーティオ出力
ne: अडियो निर्गत

source: Audio Out1
it: Uscita Audio1
ne: अडियो निर्गत १

source: Audio Out2
it: Uscita Audio2
ne: अडियो निर्गत २

source: BEAST Version %s
it: Versione di BEAST %s
ja: BEAST バージョン %s
ne: BEAST संस्करण %s

source: Balance
it: Bilanciamento
ja: バランス
ne: सन्तुलन

source: Boost
ja: ブースト
ne: बुस्ट

source: Const Out%u
it: Costante d'Uscita%u
ja: 一定出力%u
ne: अचल निर्गत %u

source: Ctrl In1
ne: नियन्त्रण आगत १

source: Ctrl In2
ne: नियन्त्रण आगत २

source: Ctrl Out
it: Ctrl Usc
ja: コントロール出力
ne: नियन्त्रण निर्गत

source: Ctrl Out1
it: Ctrl Usc1
ja: コントロール出力 1
ne: नियन्त्रण बाहिर १

source: Ctrl Out2
it: Ctrl Usc2
ja: コントロール出力 2
ne: नियन्त्रण बाहिर २

source: Ctrl Out3
it: Ctrl Usc3
ja: コントロール出力 3
ne: नियन्त्रण बाहिर ३

source: Ctrl Out4
it: Ctrl Usc4
ja: コントロール出力 4
ne: नियन्त्रण बाहिर ४

source: Description
it: Descrizione
ja: 説明
ne: वर्णन

source: Direction
it: Direzione
ja: 方向
ne: दिशा

source: Epsilon
ja: イプシロン
ne: एप्सिलन

source: Expression
it: Espressione
ja: 表現
ne: अभिव्यक्ति

source: Format
it: Formato
ne: ढाँचा

source: Freq In
it: Ingr.Freq
ja: 周波数入力
ne: आवृति आगत

source: Freq Mod In
it: Ingr.Modul.Freq.
ja: 周波数変調入力
ne: आवृति मोड आगत

source: Gain Mod In
it: Guad.Modul.Ingr.
ja: ゲイン変調入力
ne: नाफा मोड आगत

source: Gain [dB]
it: Guadagno [dB]
ja: ゲイン [dB]
ne: गेइन [डिबि]

source: HWrap
ja: 水平折り返し
ne: एच र्याप

source: Justification
it: Giustificazione
ja: 調整
ne: समरेखन

source: MIDI
ne: मिडि

source: Messages
it: Messaggi
ja: メッセージ
ne: सन्देश

source: Mix Out
it: Usc.Miscelata
ja: ミックス出力
ne: मिश्रण निर्गत

source: Mod In
it: Modul.Ingr.
ja: 変調入力
ne: मोड्युलेसन आगत

source: Modulation
it: Modulazione
ja: 変調
ne: मोडुलेसन

source: Nice
ne: असल

source: Note
it: Nota
ja: ノート
ne: द्रष्टव्य

source: Octaves
it: Ottave
ja: オクターブ
ne: ओक्टेभ

source: Orientation
it: Direzione
ja: 方向
ne: अभिमुखीकरण

source: PID: %u
ne: पिड: %u

source: PWM In
it: Ingr.PWM
ja: PWM 入力
ne: PWM भित्र

source: Palette
ja: パレット
ne: रङदानी

source: Panorama
ja: パノラマ
ne: प्यानोरामा

source: Parasite
it: Elemento parassita
ja: パラサイト
ne: पारासाइट

source: Phase
it: Fase
ja: 位相
ne: फेज

source: Position
it: Posizione
ja: 位置
ne: स्थान

source: Q: 1\/1
ne: क्यू: १\/१

source: Q: 1\/128
ne: क्यू: १\/१२८

source: Q: 1\/16
ne: क्यू:१\/१६

source: Q: 1\/2
ne: क्यू: १\/२

source: Q: 1\/32
ne: क्यू: १\/३२

source: Q: 1\/4
ne: क्यू: १\/४

source: Q: 1\/64
ne: क्यू: १\/६४

source: Q: 1\/8
ne: क्यू: १\/८

source: Rack
ja: ラック
ne: र्याक

source: Ratio In
it: Rapporto d'Ingresso
ja: 比率入力
ne: आगत अनुपात

source: Ratio [x:1]
it: Rapporto [x:1]
ne: अनुपात [x:१]

source: Retrigger In
ja: 再トリガー入力
ne: रेट्रिग्गर आगत

source: STime
it: Tempo % utilizzazione sistema
ne: एस समय

source: Scripts
it: Script
ja: スクリプト
ne: स्क्रिप्ट

source: Solo
ja: ソロ
ne: एकल

source: Sync
ja: 同期
ne: सिन्क्रोनाइज

source: Sync In
it: Ingr.Sincr
ja: 同期入力
ne: सिन्क आगत

source: Sync Out
it: Uscita Sincr
ja: 同期出力
ne: सिन्क निर्गत

source: Type
it: Tipo
ja: タイプ
ne: प्रकार

source: UTime
it: Tempo Utente
ne: यू समय

source: VZoom
ja: 垂直方向ズーム
ne: भी जुम

source: Version
it: Versione
ja: バージョン
ne: संस्करण

source: Volume
ja: 音量
ne: भोल्युम

source: Zoom
it: Ingrandisci
ja: ズーム
ne: जुम गर्नुहोस्

source: Zoom:
it: Ingrandisci:
ja: ズーム:
ne: जुम:

source: _Index
it: _Indice
ja: インデクス(_I)
ne: अनुक्रमणिका

source: _Spatial
it: _Spaziale
ja: 空間的(_S)
ne: अवकाशिय

source: /Part/Harmonic Transposer
it: /Parte/Traspositore armonico

source: /Part/Record Midi...
it: /Parte/Record Midi...

source: /SNet/Grid Align
it: /SNet/Allineamento Griglia

source: /Song/Assign Tracks to individual Mixer Busses
it: /Canzone/Tracce assegnate ai singoli bus del mixer

source: /Song/Crop parts (loop range)
it: /Canzone/Taglia le parti (selezione in loop)

source: /Song/Duplicate parts (loop range)
it: /Canzone/Parti duplicate (loop range)

source: Always
it: Sempre

source: Crops all parts within the loop range and moves parts after the loop range backwards accordingly.
it: Taglia tutte le parti all'interno della selezione di loop spostando, di conseguenza, le parti successive alla selezione tagliata indietro.

source: Diagnostic
it: Diagnostica

source: Display dialogs with dignostic messages
it: Visualizza messaggi diagnostici

source: Duplicate all parts within the loop range and moves parts after the loop range forward accordingly.
it: Duplica tutte le parti all'interno della selezione di loop posizionandole, di conseguenza, davanti la selezione medesima.

source: Error
it: Errore

source: Failed to crop part range.
it: Taglio della parte selezionata fallito.

source: Failed to duplicate part range.
it: Fallita la duplicazione della parte selezionata.

source: Failed to launch a web browser executable
it: Non è stato possibile avviare un browser WEB

source: Failed to open file "%s" for output: %s
it: Fallita apertura del file "%s" per l'uscita: %s

source: Failed to parse harmony list
it: Non riuscita l'analisi della lista armonica

source: Failed to start recording to disk.
it: Avvio hard disk recording fallito.

source: Harmony Sequence
it: Sequenza Armonica

source: Harmony list is too short
it: La lista armonica è troppo corta

source: Information
it: Informazione

source: Launch Web Browser
it: Avvia un browser WEB

source: N Iterations
it: N. di Iterazioni

source: No notes selected
it: Non è stata selezionata nesuna nota

source: No suitable web browser executable could be found to be executed and to display the URL: %s
it: Nessun browser WEB può essere eseguito per visualizzare l'URL: %s

source: No valid part object supplied
it: Non è stato fornito alcun oggetto valido per la parte

source: No valid part supplied
it: Non è stata fornita nessuna parte valida

source: No valid song supplied
it: Non è stata fornita nessuna canzone valida

source: No valid synthesis network supplied
it: Non è stata fornita nessuna rete di sintesi valida

source: Part
it: Parte

source: Recording Audio Input
it: Registrazione Audio Ingresso

source: Show messages about MIDI device selections problems
it: Mostra messaggi sui problemi dei dispositivi MIDI

source: Show messages about PCM device selections problems
it: Mostra messaggi sui problemi del dispositivo PCM

source: Show messages about audio input problems
it: Mostra messaggi riguardo ai problemi audio in ingresso

source: Show messages about empty part range
it: Mostra messaggi nello spettro delle parti vuote

source: Show messages about web browser launch problems
it: Mostra messaggi sui problemi al lancio del browser WEB

source: Show recording file errors
it: Mostra il file di log degli errori

source: Song
it: Canzone

source: Start Disk Recording
it: Avvia Hard Disk Recording

source: Start Now
it: Riproduci subito

source: Synth Net
it: Rete Synth

source: The loop range of the specified song contains no parts or is unset, so no parts can be identified to operate on.
it: La selezione di loop della canzone specificata non contiene parti oppure non è impostata; in tali condizioni nessuna parte può essere identificata per poter funzionare.

source: This script creates a new Mixer Bus for each track in the song that is currently using the Master Bus as output.
it: Questo script crea un nuovo Bus del Mixer per ogni traccia nella canzone che sta correntemente usando il Bus Master come uscita.

source: Update Percentage
it: Percentuale aggiornamento

source: Warning
it: Attenzione

source: You probably want to start this script from a part editor.
it: Probabilmente vuoi lanciare questo script da un editor di parti.

source: Level
ja: レベル

source: _FAQ...
ja: FAQ(_F)...

source: _LADSPA
ja: LADSPA(_L)
