Repository: tim-janik/beast
Catalog: po/*.po
Languages: fr, it, ja, ne

source: Advanced Linux Sound Architecture MIDI driver, using ALSA %s. The device specification follows the ALSA device naming conventions, a detailed description of which is available at the project's website: http://alsa-project.org/alsa-doc/alsa-lib/midi.html Various ALSA plugins can be used here, 'hw' allows direct adressing of hardware channels by card, device and subdevice. PLUGIN - the ALSA plugin, 'default' is usually good enough CARD - the card number for plugins like 'hw' DEV - the device number for plugins like 'hw' SUBDEV - the subdevice number for plugins like 'hw'
fr: Pilotes MIDI Advanced Linux Sound Architecture, utilisant ALSA %s. La définition du périphérique suit les conventions de dénomination des périphériques dont une description détaillée est disponible sur le site Web du projet : http://alsa-project.org/alsa-doc/alsa-lib/midi.html Divers greffons ALSA s'utilisent ici, 'hw' autorise un adressage direct des canaux matériels des cartes, périphériques et sous-périphériques. GREFFON - greffon ALSA, 'default' suffit généralement CARTE - n° de la carte pour les greffons comme 'hw' PÉRIPH - n° du périphérique pour les greffons comme 'hw' SOUS-PÉRIPH - n° du sous-périphérique pour les greffons comme 'hw'
it: Advanced Linux Sound Architecture PCM driver; in uso ALSA %s. Le specifiche del dispositivo seguono sono legate alle convenzioni adottate dal progetto ALSA. Una dettagliata descrizione è disponibile al sito del progetto all'indirizzo: http://alsa-project.org/alsa-doc/alsa-lib/pcm.html Diversi plugins ALSA possono essere utilizzati, ad esempio 'hw' permette il diretto indirizzamento dei canali hardware della scheda audio. PLUGIN - ALSA plugin, 'default' è tipicamente sufficiente CARD - il numero della scheda per plugin come 'hw' DEV - il numero del dispositivo per plugin come 'hw' SUBDEV - il numero del 'sotto-dispositivo' pre plugin come 'hw'
ne: उन्नत लिनक्स आवाज बनावट मिडि ड्राइभर, प्रयोग एल्सा %s. यन्त्र निर्दिष्टले एल्सा यन्त्र नाम गरेको विधि अनुसरण गर्दछ, विस्तृत विवरण जुन परियोजनाको वेबसाइटमा उपलब्ध छ: http://alsa-project.org/alsa-doc/alsa-lib/midi.html अरु एल्सा प्लगइन यहाँ प्रयोग गर्न सकिन्छ, 'एच डब्लु'ले कार्ड, यन्त्र र उपयन्त्रद्वारा प्रतक्ष्य ठेगान गर्ने अनुमति दिन्छ। प्लगइन - एल्सा प्लगइन, 'पूर्वनिर्धारित' साधारणतया राम्रो छ CARD - 'hw' जस्तो प्लगइनका लागि कार्ड नम्बर DEV - 'hw'जस्तो प्लगइनका लागि यन्त्र नम्बर SUBDEV - 'hw'जस्तो प्लगइनहरूका लागि उपयन्त्र नम्बर

source: Advanced Linux Sound Architecture PCM driver, using ALSA %s. The device specification follows the ALSA device naming conventions, a detailed description of which is available at the project's website: http://alsa-project.org/alsa-doc/alsa-lib/pcm.html Various ALSA plugins can be used here, 'hw' allows direct adressing of hardware channels by card, device and subdevice. PLUGIN - the ALSA plugin, 'default' is usually good enough CARD - the card number for plugins like 'hw' DEV - the device number for plugins like 'hw' SUBDEV - the subdevice number for plugins like 'hw'
fr: Pilotes PCM Advanced Linux Sound Architecture, utilisant ALSA %s. La définition du périphérique suit les conventions de dénomination des périphériques dont une description détaillée est disponible sur le site web du projet : http://alsa-project.org/alsa-doc/alsa-lib/pcm.html Divers greffons ALSA s'utilisent ici, 'hw' autorise un adressage direct des canaux matériels des cartes, périphériques et sous-périphériques. GREFFON - greffon ALSA, 'default' suffit généralement CARTE - n° de la carte pour les greffons comme 'hw' PÉRIPH - n° du périphérique pour les greffons comme 'hw' SOUS-PÉRIPH - n° du sous-périphérique pour les greffons comme 'hw'
it: Advanced Linux Sound Architecture PCM driver; in uso ALSA %s. Le specifiche del dispositivo seguono sono legate alle convenzioni adottate dal progetto ALSA. Una dettagliata descrizione è disponibile al sito del progetto all'indirizzo: http://alsa-project.org/alsa-doc/alsa-lib/pcm.html Diversi plugins ALSA possono essere utilizzati, ad esempio 'hw' permette il diretto indirizzamento dei canali hardware della scheda audio. PLUGIN - ALSA plugin, 'default' è tipicamente sufficiente CARD - il numero della scheda per plugin come 'hw' DEV - il numero del dispositivo per plugin come 'hw' SUBDEV - il numero del 'sotto-dispositivo' pre plugin come 'hw'
ne: उन्नत लिनक्स स्वर बनावट PCM ड्राइभर, प्रयोग एल्सा %s यन्त्र निर्दिष्टले एल्सा यन्त्र नाम गरेको विधि अनुसरण गर्दछ, विस्तृत विवरण जुन परियोजना वेबसाइट उपलब्ध छ: http://alsa-project.org/alsa-doc/alsa-lib/pcm.html बिभिन्न एल्सा जडानहरू यहाँ प्रयोग गर्न सकिन्छ, 'एच डब्लु' ले प्रतक्ष्य कार्ड, यन्त्र र उपयन्त्रद्वारा हार्डवयेर च्यानलको ठेगाना दिन्छ। कार्ड - 'एच डब्लु' जस्तो प्लगइनका लागि कार्ड नम्बर डेभ - 'एच डब्लु' जस्तो प्लगइनका लागि यन्त्र नम्बर SUBDEV - एच डब्लु'जस्तो प्लगइनका लागि उपयन्त्र नम्बर

source: Aftertouch Out
fr: Sortie aftertouch
ja: アフタータッチ出力
ne: पछिछुने बाहिर

source: Aggresively slows down the periodic update frequency of scopes. Doing this may be desirable on particularly slow machines.
fr: Force le ralentissement de la fréquence de mise à jour périodique des affichages. Ce paramètre peut se révéler souhaitable dans le cas de machines particulièrement lentes.
it: Riduce la frequenza di aggiornamento dei valori. Attivare questa opzione potrebbe essere desiderabile sulle macchine particolarmente lente.
ne: कार्यक्षेत्रको आवधिक आवृती जोडले ढिला गर्दछ । यो कार्य विशेषरूपले ढिला मेशिनमा आवश्यक हुनसक्दछ ।

source: Align Control Events
fr: Aligner les événements de contrôle
it: Allinea Controllo Eventi
ja: コントロールイベントを調整
ne: नियन्त्रण घटना पङ्क्तिबद्व गर्नुहोस्

source: Align Events
fr: Aligner les événements
it: Allinea Eventi
ja: イベントを調整
ne: घटना पङ्क्तिबद्ध गर्नुहोस्

source: All
fr: Tous
it: Tutto
ne: सबै

source: Amount of detuning in cent (hundredth part of a semitone)
fr: Nombre de cents (centième partie d'un demi-ton) de modification de l'accord
it: Ammontare, in centesimi, del detuning (centesima parte di un semitono)
ne: डिट्युनिङ्गको रकम सेन्टमा (सेमिटोनको सयौ भाग)

source: Amplified audio output
fr: Sortie audio amplifiée
it: Uscita Audio Amplificata
ja: アンプオーディオ出力
ne: एम्प्लिफाइड अडियो निर्गत

source: An audio project is in use which processes an audio input signal, but the audio device has not been opened in recording mode. An audio signal of silence will be used instead of a recorded signal, so playback operation may produce results not actually intended (such as a silent output signal).
fr: Un projet audio est en cours ; il traite un signal audio en entrée, mais le périphérique audio n'a pas été ouvert en mode enregistrement. Un signal de silence est utilisé à la place du signal d'enregistrement ; la lecture peut ne pas produire le résultat attendu en réalité (par ex. un signal de sortie silencieux).
it: Un progetto audio d'ingresso è in uso, ma il dispositivo audio non è stato aperto in modalità registrazione. In luogo di un segnale registrato verrà utilizzato un segnale fittizio di 'silenzio' pertanto, durante la modalità di playback, potrebbe essere riprodotto un qualcosa di inatteso (quale, ad esempio, solo silenzio inluogo della traccia d'ingresso).
ne: अडियो आगत मोड्युल प्रयोगमा छ जसले अडियो आगत सङ्केत प्रक्रिया गर्दछ, तर अडियो यन्त्र रेकर्डिङ मोडमा खोलिएको छैन । सङ्केत रेकर्डेड सङ्केतको सट्टा आगतमा प्रयोग हुन्छ, त्यसैले प्लेब्याक सञ्चालनले वास्तवमा इन्डेन्टपरिणाम लेराउन सक्दछ (जस्तै एउटा मौन निर्गत सङ्केत)

source: An error occoured during execution of script procedure '%s': %s
fr: Une erreur est survenue pendant l'exécution de la procédure de script « %s » : %s
it: Un errore è avvenuto durante l'esecuzione della procedura di script '%s': %s
ne: स्क्रिप्ट कार्यविधिको कार्यान्वयन गरेको बेलामा एउटा त्रटि भयो '%s': %s

source: An error occoured while opening the recording file, selecting a different file might fix this situation.
fr: Une erreur est survenue lors de l'ouverture du fichier d'enregistrement ; il se peut que le choix d'un autre fichier résolve le problème.
it: Si è verificato un errore nell'apertura del file recording. Selezionando un file differente la situazione dovrebbe risolversi.
ne: रेकर्डिङ फाइल खोल्दा त्रुटि भयो, अर्को फाइल चयन गर्दा यो समस्या नहुन सक्छ ।

source: Answers to frequently asked questions
fr: Réponses aux questions les plus fréquemment posées
it: Risposte a domande frequenti
ne: लगातार सोधिने प्रश्नहरूको उत्तर दिन्छ

source: Anti-Alias
fr: Anti-crènelage
ja: アンチエイリアス
ne: एन्टी-एलाइज

source: Apply configuration changes to the pattern editor layout
fr: Applique les changements de configuration à la disposition de l'éditeur de motifs
it: Applica i cambi di configurazione all'aspetto dell'editor di pattern
ne: बाँन्की सम्पादक सजावटमा कन्फिगरेसन परिवर्तन लागू गर्नुहोस्

source: Array of column types
fr: Tableau des types de colonnes
it: Tipi di colonne della matrice
ja: カラムタイプ配列
ne: स्तम्भ प्रकारको एरे

source: ArtsCompressor compresses the sound. Compression is a dynamic operation that consists of two parts: (1) the current input volume of the signal is detected (2) if it exceeds a given theshold, the volume of the output signal will be reduced The input volume detection has an attack and a release half-life time which can be specified - in milliseconds - with the corresponding properties. This envelope causes the compressor to adapt slowly to the actual input signal level. The ratio specifies how the volume of a signal should be reduced, if it exceeds the threshold. A compression ratio of 2:1 means for instance that if the input volume is 2 dB over the threshold, the output volume will be 1 dB over the threshold. Example (threshold = -10, ratio 2:1): input = -20 dB => output = -20 dB input = -10 dB => output = -10 dB input = 0 dB => output = -5 dB input = 10 dB => output = 0 dB input = 20 dB => output = 5 dB Compression is often thought off as an operation to make music "sound louder". To achieve this, the first step is to reduce the dynamic range like in the example above. As the loud parts of the music have been reduced in volume, we can now amplify everything, without risking distortion or clipping. This has the overall effect of the music sounding louder. In our example, an output amplification of 5 dB would be okay, if the input signal never exceeded 0 dB.
fr: ArtsCompressor comprime le son. La compression est une opération dynamique en deux étapes : (1) le volume du signal d'entrée courant est observé (2) s'il dépasse un certain seuil, le volume du signal de sortie est diminué La détection du volume en entrée se fait selon la demie-vie de l'attaque et de la décroissance (en millisecondes) précisée avec les propriétés correspondantes. Cette enveloppe fait que le compresseur n'adapte que lentement le niveau du signal d'entrée réel. Le ratio définit la façon dont le volume d'un signal doit être réduit s'il dépasse le seuil. Un ratio de compression de 2:1 signifie par exemple que, si le volume en entrée est de 2 dB au-dessus du seuil, le volume de sortie ne sera que de 1 dB au-dessus de ce même seuil. Exemple (seuil = ‑10, ratio 2:1) : entrée = -20 dB => sortie = -20 dB entrée = -10 dB => sortie = -10 dB entrée = 0 dB => sortie = -5 dB entrée = 10 dB => sortie = 0 dB entrée = 20 dB => sortie = 5 dB La compression est souvent pensée comme un moyen pour faire sonner la musique « plus fort ». Pour réaliser cela, la première étape consiste à réduire la dynamique comme dans l'exemple ci-dessus. Comme le volume des parties sonores de la musique a été réduit, on peut tout amplifier sans risque de distorsion ou d'écrêtement. Ce qui a comme effet résultant de faire sonner plus fort. Dans notre exemple, une amplification en sortie de 5 dB sera une bonne valeur, si le signal d'entrée ne dépasse jamais 0 dB.
ne: आर्ट्सकम्प्रेसरले ध्वनिलाई कम्प्रेस गर्दछ । कम्प्रेसन गतिशिल सञ्चालन हो जसले दुई अंश समेटेको हुन्छ: (१) हालको आगत ध्वनि सङ्केतको पत्ता लगाउछ (२) यदि दिइएको थेसहोल्ड नागेमा, निर्गत सङ्केतको ध्वनि घटाइन्छ आगत ध्वनि पत्ता लगाउनेमा आक्रमण र आधा-जीवन समय - मिलिसेकेन्डमा - विविध गुण सँगनिर्दिष्ट गर्न सकिन्छ । यो खामले विस्तारै निश्चित आगत सङ्केत तहमा कम्प्रेस गर्दछ । अनुपाले कसरी ध्वनिको सङ्केत घटाउनु पर्दछ, यदि यसले थ्रेसहोल्ड नागेमा। कम्प्रेसन भाग २:१ को इन्सटेन्स यदि आगत ध्वनि २ dB हुन्छ, थ्रेसहोल्ड भन्दा बढी, निर्गत मान ध्वनिको १ dB हुन्छ। उदाहरण (थ्रेसहोल्ड = -१०, भाग २:१): आगत = -२० dB =>निर्गत = -२० dB आगत = -१० dB =>निर्गत = -१० dB आगत = ० dB =>निर्गत = -५ dB आगत = १० dB =>निर्गत = ० dB आगत = २० dB =>निर्गत = ५ dB कम्प्रेसन प्राय सोचिन्छ सञ्चालन जस्तै सङ्गीतलाई "ध्वनि ठूलो" बनाउन. यसलाई प्राप्त गर्न, पहिलो चरण भनेको माथिको उदाहरण जस्तै डाइनामिक दायरालाई घटाउनु हो। ठूलो स्वरको अंश सङ्गीतको ध्वनिमा घटाउनु पर्दछ, अब हामीले सबै ठलो पार्न गर्न सक्छौं, कुनै डर डिस्टोर्सन वा क्लिप्पिङ बिना। यसको पूर्णरूपमा प्रभाव सङ्गीतको ठूलो ध्वनिमा छ। हाम्रो उदाहरणमा, निर्गत एम्प्लिफिकेसन ५dB पारित हुन्छ, यदि आगत सङ्केतले ० dB कहिले पनि नाग्दैन ।

source: Assignments
fr: Assignations
it: Assegnazioni
ja: 割り当て
ne: पङ्क्तिबद्वता

source: Attack [ms]
fr: Attaque [ms]
it: Attacco [ms]
ja: アタック [ms]
ne: आक्रमण [ms]

source: Attack-Decay-Sustain-Release envelope output
fr: Sortie de l'enveloppe Attaque-Extinction-Maintien-Décroissance
it: Uscita inviluppo Attacco-Decadimento-Sostegno-Rilascio (ADSR)
ja: アタック-減衰-サスティン-リリースエンベロープ出力
ne: आक्रमण-डिके-सस्टेन-खाम आगत छाडिएको

source: Attenuate the level of audio input 1
fr: Diminue le niveau de l'entrée audio 1
it: Attenua il livello dell'ingresso audio 1
ja: オーティオ入力 1 のレベルを下げる
ne: अडियो आगत १ को तह एटेनुयट गर्नुहोस्

source: Attenuate the level of audio input 2
fr: Diminue le niveau de l'entrée audio 2
it: Attenua il livello dell'ingresso audio 2
ja: オーティオ入力 2 のレベルを下げる
ne: अडियो आगत २ को तह तह एटेनुयट गर्नुहोस्

source: Attenuate the level of control input 1
fr: Diminue le niveau de l'entrée du contrôle 1
it: Attenua il livello del controllo d'ingresso 1
ja: コントロール入力 1 のレベルを下げる
ne: नियन्त्रण आगत १ को तह एटेनुयट गर्नुहोस्

source: Attenuate the level of control input 2
fr: Diminue le niveau de l'entrée du contrôle 2
it: Attenua il livello del controllo d'ingresso 2
ja: コントロール入力 2 のレベルを下げる
ne: नियन्त्रण आगत २ को तह एटेनुयट गर्नुहोस्

source: Audio Input
fr: Entrée audio
it: Ingresso Audio
ja: オーティオ入力
ne: अडियो आगत

source: Audio Input 1
fr: Entrée audio 1
it: Ingresso Audio 1
ja: オーディオ入力 1
ne: अडियो आगत १

source: Audio Input 2
fr: Entrée audio 2
it: Ingresso Audio 2
ja: オーディオ入力 2
ne: अडियो आगत २

source: Audio Input 3
fr: Entrée audio 3
it: Ingresso Audio 3
ja: オーディオ入力 3
ne: अडियो आगत ३

source: Audio Input 4
fr: Entrée audio 4
it: Ingresso Audio 4
ja: オーディオ入力 4
ne: अडियो आगत ४

source: Audio Input Signal
fr: Signal d'entrée audio
it: Segnale Audio d'Ingresso
ja: オーディオ入力信号
ne: अडियो आगत सङ्केत

source: Audio Output
fr: Sortie audio
it: Uscita Audio
ja: オーディオ出力
ne: अडियो निर्गत

source: Audio device "%s" is not open for input, audio driver: %s=%s
fr: Le périphérique audio « %s » n'est pas ouvert en entrée, pilote audio : %s = %s
it: Dispositivo audio "%s" non disponibile per l'ingresso - Driver audio: %s=%s
ne: आगतका लागि अडियो यन्त्र "%s" खुल्ला छैन, अडियो ड्राइभर: %s=%s

source: Audio input
fr: Entrée audio
it: Ingresso audio
ja: オーディオ入力
ne: अडियो आगत

source: Audio input 1
fr: Entrée audio 1
it: Ingresso Audio 1
ne: अडियो आगत १

source: Audio input 2
fr: Entrée audio 2
it: Ingresso Audio 2
ne: अडियो आगत २

source: Author
fr: Auteur
it: Autore
ja: 作者
ne: लेखक

source: Authors:
fr: Auteurs :
it: Autori:
ja: 作者:
ne: लेखक:

source: Auto Output
fr: Sortie automatique
ne: स्वत: आगत

source: Auto cut
fr: Coupure automatique
ja: 自動カット
ne: स्वत: काट्नुहोस्

source: Auto is a special driver, it acts as a placeholder for automatic driver selection.
fr: Auto est un pilote particulier ; il correspond à une sélection automatique du pilote.
ne: स्वत: विशेष ड्राइभर हो, स्वत: ड्राइभर छनोटका लागि यसले स्थानहोल्डर सरह कार्य गर्दछ

source: Available Inputs
fr: Entrées disponibles
it: Ingressi Disponibili
ja: 利用可能な入力
ne: उपलब्ध आगत

source: Available Items:
fr: Éléments disponibles :
it: Voci Disponibli:
ja: 利用可能なアイテム:
ne: उपलब्ध वस्तुहरू:

source: Available Outputs
fr: Sorties disponibles
it: Uscite Disponibili
ne: उपलब्ध आगत

source: Available Postprocessors
fr: Post-processeurs disponibles
it: Postprocessori Disponibili
ja: 利用可能なポストプロセッサ
ne: उपलब्ध पोष्टप्रोसेसर

source: Available Synthesizers
fr: Synthétiseurs disponibles
it: Sintetizzatori Disponibili
ja: 利用可能なシンセサイザ
ne: उपलब्ध सिन्थेसाइजर

source: Available Waves
fr: Sons disponibles
it: Wave Disponibili
ja: 利用可能な波形
ne: उपलब्ध तरङ्ग

source: Average number of milliseconds per second of system CPU time used by thread
fr: Nombre moyen de millisecondes par secondes de temps d'occupation système de la CPU employés par la tâche
it: Valor medio, in millisecondi, per ogni secondo d'uso sistema della CPU utilizzato dal thread
ja: スレッドが使用するシステム CPU 時間の平均(msec/sec)
ne: थ्रेडद्वारा प्रयोग गरिएको प्रणाली CPU समयको प्रति सकेण्डमा मिलिसेकेण्डको औसत सङ्ख्या

source: Average number of milliseconds per second of user CPU time used by thread
fr: Nombre moyen de millisecondes par secondes de temps d'occupation utilisateur de la CPU employés par la tâche
it: Valor medio, in millisecondi, per ogni secondo d'uso utente della CPU utilizzato dal thread
ja: スレッドが使用するユーザー CPU 時間の平均(msec/sec)
ne: थ्रेडद्वारा प्रयोग गरिएको प्रयोगकर्ता CPU समयको प्रति सकेण्डमा मिलिसेकेण्डको औसत सङ्ख्या

source: BEAST About
fr: À propos de BEAST
it: Altro su BEAST
ja: BEAST の情報
ne: BEAST बारेमा

source: BEAST Startup
fr: Démarrage de BEAST
it: Avvio BEAST
ja: BEAST 起動
ne: BEAST सुरुवात

source: BSE Core
fr: Cœur BSE
it: Nucleo BSE
ja: BSE コア
ne: BSE कोर

source: BSE Multi-Part Wave File
fr: Fichier son BSE à plusieurs mesures
it: File BSE Multi-Part Wave
ja: BSE マルチパート WAVE ファイル
ne: BSE बहु-अंश वेभ फाइल

source: BSE Synthesis File
fr: Fichier de synthèse BSE
it: File BSE Synthesis
ja: BSE シンセサイザファイル
ne: BSE सिन्थेसिस फाइल

source: Background Color
fr: Couleur d'arrière-plan
it: Colore di Sfondo
ja: 背景色
ne: पृष्ठभुमि रङ

source: Background Image
fr: Image d'arrière-plan
it: Immagine di Sfondo
ja: 背景画像
ne: पृष्ठभूमि छवि

source: Background Shade 1
fr: Ombrage d'arrière-plan 1
it: Colore di Sfondo 1
ja: 背景影 1
ne: पृष्ठभूमि सेड १

source: Background Shade 2
fr: Ombrage d'arrière-plan 2
it: Colore di Sfondo 2
ja: 背景影 2
ne: पृष्ठभूमि सेड २

source: Background image used by the control events editor.
fr: Image d'arrière-plan utilisée dans l'éditeur des événements de contrôle.
it: Immagine di Sfondo usata dall'editor Controllo Eventi
ja: コントロールイベントエディタの背景画像
ne: नियन्त्रण घटना सम्पादकद्वारा प्रयोग गर्ने पृष्ठभूमि छवि

source: Background image used by the pattern editor.
fr: Image d'arrière plan-utilisée par l'éditeur de motifs.
it: Immagine di sfondo usata dall'editor di pattern.
ja: パターンエディタの背景画像
ne: बाँन्की सम्पादनकद्वारा प्रयोग गरिएको पृष्ठभूमि छवि

source: Background image used by the piano-roll editor.
fr: Image d'arrière-plan utilisée dans l'éditeur du rouleau de piano.
it: Immagine di Sfondo usata per il Piano Roll Editor
ja: ピアノロールエディタの背景画像
ne: पियानो-रोल सम्पादनकद्वारा प्रयोग गरिएको पृष्ठभूमि छवि

source: Bad loopback
fr: Mauvais bouclage
ja: 不正なループバック
ne: खराब लूपब्याक

source: Balance audio input levels
fr: Balance des niveaux d'entrée audio
it: Bilancia il livello audio d'ingresso
ja: オーティオ入力レベルをバランス
ne: अडियो आगत तहको सन्तुलन

source: Balance control input levels
fr: Niveaux d'entrée du contrôle de balance
it: Bilancia il livello del controllo degli ingressi
ja: コントロール入力レベルをバランス
ne: नियन्त्रण आगत तहको सन्तुलन गर्दछ

source: Bank Select
fr: Sélection de banque
it: Selezione Banco
ja: バンク選択
ne: बैंक चयन

source: Base Frequency
fr: Fréquence de base
it: Frequenza Base
ja: ベース周波数
ne: आधार आवृति

source: Base Octave
fr: Octave de base
it: Ottava Base
ja: 基音
ne: आधार ओक्टेभ

source: Base Volume
fr: Volume de base
it: Volume Base
ja: ベース音量
ne: आधार भोल्युम

source: Base amplification (the control signal adds up to this)
fr: Amplification de base (le signal de contrôle s'ajoute à celle-ci)
it: Amplificazione base (il segnale di controllo si somma a questo)
ja: ベースアンプ (加えられるコントロール信号)
ne: आधार एम्प्लिकेसन (नियन्त्रण सङ्केतले यसमा थप्दछ)

source: Beats per minute
fr: Battements par minute
it: Battiti per minuto
ja: BPM
ne: प्रति मिनेटमा बिट्स

source: Bind a new key combination to a program function
fr: Assigne une nouvelle combinaison de touches à une fonction du programme
it: Realizza una nuova combinazione di tasti per una funzione del programma
ja: 新しいショートカットをプログラムの機能に関連付け
ne: कार्यक्रम प्रकार्यमा नयाँ कूञ्जी संयोजन बेर्नुहोस्

source: Breath Control
fr: Contrôle de la respiration
ja: ブレスコントロール
ne: श्वास नियन्त्रण

source: BseAmplifier provides input signal controlled amplification or attenuation. It supports two control inputs and two audio inputs which are mixed together after balance and level adjustments. The gain setting controls preamplification of the mixed audio signal. The mixed control signal, weighted by a strength setting, determines additional amplification, allowing for external sources to modulate the overall volume (tremolo). The mixed control signal can influence the amplification linearly (to amplify other control signals) or exponentially (to amplify audio signals). Finally, the master volume controls amplification of the resulting output signal.
fr: BseAmplifier permet un contrôle d'amplification ou d'atténuation du signal d'entrée. Il prend en charge deux contrôles d'entrée et deux entrées audio qui sont mixés après ajustement de la balance et du niveau. Le niveau de gain contrôle la préamplification du signal audio mixé. Le signal de contrôle mixé, pondéré en intensité, détermine l'amplification additionnelle, permettant à des sources extérieures de moduler le volume global (trémolo). Le signal de contrôle mixé peut influencer l'amplification de manière linéaire (pour amplifier les autres signaux de contrôle) ou de manière exponentielle (pour amplifier les signaux audio). Finalement, le volume maître contrôle l'amplification du signal de sortie résultant.
ja: BseAmplifier は入力信号コントロール増幅/減衰器の機能を提供します。二つのコントロール入力/オーディオ入力をサポートし、それらはバランス、レベル調整の後でミックスされます。ゲイン設定はミックスオーディオ信号のプリアンプリフィケーションをコントロールします。強度設定で重み付けされるミックスコントロール信号は追加の増幅を決定し、外部ソースがすべての音量を変調(トレモロ)できるようにします。ミックスコントロール信号は(他のコントロール信号に)線形に増幅する、または(オーディオ信号を)指数関数的に増幅することができます。そして主音量は結果的に出力される信号の増幅をコントロールします。
ne: बिस एम्पलिफायरले आगत सङ्केत एम्प्लिफिकेसन वा एटेनुयेसन नियन्त्रण प्रदान गर्दछ । यसले दुई नियन्त्रण आगतहरू र दुई अडियो आगत जुन मिश्रण सन्तुलन र तह समायोजन पछि समर्थन गर्दछ । गेइन सेटिङले मिश्रण अडियो सङ्केतको पूर्व एम्प्लिफिकेसन नियन्त्रण गर्दछ । मिश्रण नियन्त्रण सङ्केत, स्ट्रेन्थ सटिङ्गको तौल गरिन्छ, जोड एम्प्लिफिकेसनको निर्धारित गर्दछ, पूर्ण भएको ध्वनि (ट्रेमोलो) को आगत स्रोतलाई मोडुलेट गर्न मद्दत गर्दछ । मिश्रण नियन्त्रण सङ्केतले एम्प्लिफिकेसन पङ्क्ति (अरु नियन्त्रण सङ्केतहरूको एम्प्लिफाइ गर्न) वा एक्सपोनेन्सियली (अडियो सङ्केतलाई एम्प्लिफाइ गर्न) प्रभाव पार्न सक्दछ। अन्तिममा, मास्टर ध्वनि नियन्त्रण परिणाम आगत सङ्केतको एम्प्लिफिकेसन गर्दछ ।
