Repository: tim-janik/beast
Catalog: po/*.po
Languages: fr, it, ja, ne

source: File modification time
fr: Horodatage de la modification du fichier
it: Ultima modifica del file
ne: फाइल संशोधन समय

source: File size in bytes
fr: Taille du fichier en octets
it: Dimensione in byte del file
ne: बाइट्मा फाइलको साइज

source: Filename
fr: Nom du fichier
it: Nome del file
ne: फाइलनाम

source: Filename Text Entry
fr: Saisie texte du nom du fichier
it: Inserisci il Testo del Nome del File
ja: ファイル名 テキストエントリ
ne: फाइलनाम पाठ प्रविष्टि

source: Filter
fr: Filtre
it: Filtro
ja: フィルター
ne: फिल्टर गर्नुहोस्

source: Filter Algorithm
fr: Algorithme de filtrage
it: Algoritmo del Filtro
ja: フィルターアルゴリズム
ne: फिल्टर अल्गोरिदम

source: Filter Choice
fr: Choix de filtre
it: Scelta Filtro
ja: フィルター選択
ne: फिल्टर छनौट

source: Filter Specification
fr: Caractéristiques du filtre
it: Specifiche del Filtro
ja: フィルター仕様
ne: फिल्टर विशेष वर्णन

source: Filter Type
fr: Type de filtre
it: Tipo di Filtro
ja: フィルタータイプ
ne: फिल्टर प्रकार

source: Filter cutoff frequency
fr: Fréquence de coupure du filtre
it: Frequenza di taglio (cutoff) del filtro

source: Filter cutoff frequency as note, converted to Hertz according to the current musical tuning
fr: Fréquence de coupure du filtre correspondant à une note, convertie en Hertz selon la tonalité musicale retenue

source: Filter cutoff frequency in Hertz
fr: Fréquence de coupure du filtre en Hertz
it: Imposta la Frequenza di taglio (Cutoff) in Hz

source: Filtered Audio Signal
fr: Signal audio filtré
it: Segnale Audio Filtrato
ja: フィルター済みのオーディオ信号
ne: फिल्टर भएको अडियो सङ्केत

source: Filtered Output
fr: Sortie filtrée
it: Uscita Filtrata
ja: フィルター済みの出力
ne: फिल्टर गरिएको निर्गत

source: Filtered audio output
fr: Sortie audio filtrée
it: Uscita audio filtrata
ja: フィルター済みオーディオ出力
ne: फिल्टर गरिएको अडियो आगत

source: Find a track suitable for playing notes of a given part.
fr: Trouve une piste adaptée à l'interprétation des notes de mesures données.
it: Trova una traccia adatta a suonare le note di una data parte.
ja: 与えられたパートのノートを演奏するための適切なトラックを検索
ne: दिइएको अंशमा उपयुक्त ट्र्याक सुरु गर्नका लागि खोजी गर्नुहोस्

source: Find in current document
fr: Recherche dans le document courant
it: Trova nel documento corrente
ja: 現在のドキュメント内で検索
ne: हालको कागजातमा फेला पर्यो

source: Find the first track that contains part, suitable to check for orphan parts.
fr: Trouve la première piste contenant des mesures, adaptée pour tester des mesures orphelines.
it: Trova la prima traccia che contiene una sezione adatta al controllo per le parti "orfane".
ne: पहिलो ट्र्याक खोजी गर्नुहोस् जुनले अंश समेटेको हुन्छ, अर्फन अंशका लागि मिल्दो जाँच्नहोस् ।

source: Fine Tune
fr: Accord fin
it: Regolazione Puntuale
ja: 微細調整
ne: राम्रो ट्युन

source: First audio input
fr: Première entrée audio
it: Primo Input Audio
ja: 第一オーティオ入力
ne: पहिलो अडियो आगत

source: First control input
fr: Entrée du premier contrôle
it: Primo Controllo d'Ingresso
ja: 第一コントロール入力
ne: पहिलो नियन्त्रण आगत

source: Flavour
fr: Ambiance

source: Flip Spectrum
fr: Retourner le spectre
ja: スペクトラムを反転
ne: फ्लिप स्पेकट्रम

source: Flip Spectrum display, interchaging low and high frequencies
fr: Retourner l'affichage du spectre en échangeant les fréquences hautes et basses
ja: 高低周波数を交換してスペクトラム表示を反転
ne: फ्लिप स्पेक्ट्रम प्रदर्शन, तल्लो र माथिल्लो आवृत्तिको आपसी परिवर्तन

source: Font Size
fr: Taille de la police
it: Dimensione Font
ja: フォントサイズ
ne: वर्णको साइज

source: Font size in pixels for labels displayed in synthesis networks
fr: Taille de la police en pixels pour les étiquettes affichées dans les réseaux de synthèse
it: Ampiezza Font in pixel per le etichette visualizzate nella rete di sintetizzazzione
ja: シンセネットワーク内に表示されるラベルのフォントサイズ(ピクセル)
ne: सिन्थेसिस सञ्जालमा प्रर्दशित लेबुलका लागि पिक्सेलमा फन्ट साइज

source: Foot Controller
fr: Contrôleur de pied
it: Controller Pedale
ja: フットコントローラ
ne: पाद नियन्त्रक

source: Free form comment or description
fr: Commentaire ou description de forme libre
it: Commento e/o descrizione libera

source: Freq Out
fr: Sortie fréquence
it: Freq.Usc.
ja: 周波数出力
ne: आवृति बाहिर

source: Frequency
fr: Fréquence
it: Frequenza
ja: 周波数
ne: आवृत्ति

source: Frequency Input
fr: Entrée fréquence
it: Frequenza d'Ingresso
ja: 周波数入力
ne: आवृति आगत

source: Frequency Modulation Input
fr: Entrée de la modulation de fréquence
it: Ingresso Modulazione di Frequenza
ja: 周波数変調の入力
ne: आवृति मोडुलेसन आगत

source: Frequency Ratio
fr: Rapport de fréquence

source: Frequency Signal
fr: Signal de fréquence
it: Frequenza Segnale
ja: 周波数信号
ne: आवृति सङ्केत

source: Frequency at which control values are evaluated, should be much smaller than Synth Mixing Frequency to reduce CPU load
fr: Fréquence à laquelle les valeurs de contrôle sont évaluées ; elle doit être beaucoup plus petite que la fréquence de mixage de la synthèse pour réduire la charge CPU
it: La frequenza alla quale i valori sono campionati dovrebbe essere minore della frequenza di sintesi al fine di ridurre il carico sulla CPU
ja: コントロール値を評価するときの周波数。CPU 負荷を減らすためにはシンセミキサ周波数よりずっと小さくするべきです。
ne: आवृति जहाँ नियन्त्रण मानहरूको मूल्याङ्कन हुन्छ, CPU लोडको भार घटाउन सिन्थ मिश्रण आवृति भन्दा सानो हुनुपर्दछ

source: Frequency shift ratio (assumed 1.0 if not connected)
fr: Rapport de décalage de fréquence (1.0 supposé si non connecté)
it: Rapporto spostamento di frequenza (si assume 1.0 se non connesso)
ja: 周波数シフト比率 (接続していないなら 1.0)
ne: आवृति सिफ्ट रेटिव (जडान नभए १.० मानेको)

source: Fully include wave files
fr: Inclure complètement les fichiers son
it: Includi tutti i file wave
ja: WAVE ファイルをすべて含める
ne: सबै समेटिएको वेभ फाइल

source: Function
fr: Fonction
it: Funzione
ja: 機能
ne: प्रकार्य

source: Function used to create new key bindings
fr: Fonction utilisée pour créer une nouvelle combinaison de touches
it: Funzione da associare alla combinazione di tasti
ja: 新しいショートカットをつくるのに使う機能
ne: नयाँ कुञ्जी बाइन्डिङ सिर्जना गर्न प्रयोग गरिने प्रकार्य

source: Functionality not implemented
fr: Fonctionnalité non implémentée
it: Funzionalitï¿½ non implementata
ja: 機能はまだ実装されていません
ne: प्रकार्यत्मकता कार्यान्वयन भएन

source: Functions to be activated for a key binding
fr: Fonctions à activer par une combinaison de touches
it: Funzione da attivare tramite combinazione di tasti
ja: ショートカットに対して有効にされる機能
ne: कुञ्जी बाइन्डिङ सक्रिय पार्न प्रकार्य

source: GNU Lesser General Public License
fr: Licence Publique Générale limitée GNU
it: GNU Lesser General Public License (LGPL)
ja: GNU 劣等一般公共使用許諾
ne: जी एन यु लेस्सर साधारण सार्वजनिक अनुमतिपत्र

source: Gain Modulation Input
fr: Entrée de la modulation du gain
it: Guadagno Mudulazione d'Ingresso
ja: ゲイン変調の入力
ne: नाफा मोडुलेसन आगत

source: Gain Modulation [%]
fr: Modulation du gain [%]
it: Guadagno Modulazione [%]
ja: ゲイン変調 [%]
ne: गेइन मोडुलेसन [%]

source: Gate
fr: Gate (déclencheur)
ja: ゲート
ne: गेट

source: Gate In
fr: Entrée gate
ja: ゲート入力
ne: भित्र आउनुहोस्

source: Gate Out
fr: Sortie gate
ja: ゲート出力
ne: बाहिर जानुहोस्

source: Gate Output
fr: Sortie gate
ja: ゲート出力
ne: गेट निर्गत

source: Gate input (activates/deactivates envelope)
fr: Entrée gate (active/désactive l'enveloppe)
ja: ゲート入力 (活性/不活性エンベロープ)
ne: आगत गेट (खाम सक्रिय/असक्रिय पार्छ)

source: General Purpose Controller 1
fr: Contrôleur d'usage général 1
it: Controllo d'uso Generale 1
ja: 汎用コントローラ 1
ne: साधारण उद्देश्य नियन्त्रक १

source: General Purpose Controller 2
fr: Contrôleur d'usage général 2
it: Controllo d'uso Generale 2
ja: 汎用コントローラ 2
ne: साधारण उद्देश्य नियन्त्रक २

source: General Purpose Controller 3
fr: Contrôleur d'usage général 3
it: Controllo d'uso Generale 3
ja: 汎用コントローラ 3
ne: साधारण उद्देश्य नियन्त्रक ३

source: General Purpose Controller 4
fr: Contrôleur d'usage général 4
it: Controllo d'uso Generale 4
ja: 汎用コントローラ 4
ne: साधारण उद्देश्य नियन्त्रक ४

source: Generic Keys
fr: Touches génériques
it: Chiavi Generiche
ja: 一般キー
ne: जेनेरिक कुञ्जी

source: Go back one page
fr: Recule d'une page
it: Ritorna indietro di una pagine
ja: 一ページ戻る
ne: एक पृष्ठ पछाडि जानुहोस्

source: Go forward one page
fr: Avance d'une page
it: Vai avanti di una pagina
ja: 一ページ進む
ne: एक पृष्ठ अगाडि जानुहोस्

source: Go to browser index
fr: Va à l'index du navigateur
it: Vai all'indice del browser
ja: ブラウザインデクスへ移動
ne: ब्राउजर अनुक्रमणिकामा जानुहोस्

source: Grow Horizontally
fr: Développer horizontalement
it: Aumenta Orizzontalmente
ja: 水平方向に拡張
ne: तेर्सो रूपमा बढाउनुहोस्

source: Grow Vertically
fr: Développer verticalement
it: Aumenta Verticalmente
ja: 垂直方向に拡張
ne: ठाडो रूपमा बढाउनुहोस्

source: Grow the scrollable area
fr: Agrandir la zone de défilement
it: Aumenta l'area da scorrere
ja: スクロール可能なエリアを広げる
ne: स्क्रोल योग्य क्षेत्र बढाउनुहोस्

source: HZoom
fr: ZoomH
it: Ingrand.Orizz.
ja: 水平方向ズーム
ne: एच जुम

source: Half note
fr: Blanche
it: Nota Metï¿½ (minima)
ja: 半ノート
ne: आधा द्रष्टव्य

source: High if the note is currently being pressed
fr: Actif si la note est en train d'être enfoncée
it: Valore alto se la nota è correntemente utilizzata
ja: ノートがプレスされていれば高
ne: यदि द्रष्टव्य हाललाई दाबिएको छ भने उच्च

source: High indicates the instrument is done synthesizing
fr: Haut indique que l'instrument est synthétisé
it: Un valore alto indica che lo strumento è in fase di sintetizzazione.
ja: 高ならインストゥルメントのシンセ完了を示す
ne: उपकरणले सिन्थेसाइजिङ गर्यो भन्ने कुरा उच्चले इङ्गित गर्दछ

source: Hit the drum on raising edges
fr: Frapper la batterie sur la montée de l'impulsion
it: Colpisce la batteria sul fronte di salita
ja: レイズ端でドラムをヒット
ne: बढेको कुनामा ड्रम हिर्काउनुहोस्

source: Homogeneous Input Fields
fr: Homogénéisation des champs d'entrées
it: Inserimento elementi
ja: 均一な入力フィールド
ne: उस्तै प्रकारको आगत फाँट

source: Horizontal Bar Color
fr: Couleur des barres horizontales
it: Colore Barra Orizzontale
ja: 水平バーの色
ne: तेर्सो पट्टी रङ

source: Horizontal Grid Color
fr: Couleur de la grille horizontale
it: Colore Griglia Orizzontale
ja: 水平グリッドの色
ne: तेर्सो ग्रिड रङ

source: Horizontal Scale
fr: Échelle horizontale
it: Scala Orizzontale
ja: 水平方向スケール
ne: तेर्सो मापन

source: Horizontal Scale (Logarithmic)
fr: Échelle horizontale (logarithmique)
it: Scala Orizzontale (Logaritmica)
ja: 水平方向スケール(対数)
ne: तेर्सो मापन (लोगारिथ्मिक)

source: Horizontal piano zoom
fr: Zoom horizontal du clavier
it: Ingrandimento piano orizzontale
ja: 水平方向ピアノズーム
ne: तेर्सो पियानो जुम

source: Horizontal track zoom
fr: Zoom horizontal des pistes
it: Ingrandimento orizzontale traccia
ja: 水平方向トラックズーム
ne: तेर्सो ट्र्याक जुम

source: Hundred twenty-eighth note
fr: Quintuple croche
it: Nota da un centoventottesimo
ja: 128 分ノート
ne: एक सय अठ्ठाइसौं द्रष्टव्य

source: IIR Low-Pass Filter
fr: Filtre RII passe-bas
it: IIR Filtro Passa-Basso

source: If set, an underline in the text indicates the next character should be used for the mnemonic accelerator key
fr: Si défini, un soulignement dans le texte indique que le caractère qui suit est un mnémonique d'accélérateur clavier
it: Se impostata,una sottolineatura nel testo indica il successivo carattere che dovrebbe essere usato per una scorciatoia mnemonica per l'ottenimento della funzione indicata
ja: 設定されていれば、テキストの下線が次の文字がショートカットキーのニーモニックとして使われることを示す。
ne: यदि सेट छ भने, पाठको मुनिको कचले स्मृतिसहायक गतिवर्धक कुञ्जीका लागि प्रयोग गर्नु पर्दछ भन्ने दर्शाउदछ

source: If set, overfull text is cut-off and an ellipsis "..." is displayed instead
fr: Si défini, la partie de phrase hors marge est coupée et remplacée par des points de suspension « … »
it: Se impostato, un eccessivo testo è tagliato e un'ellisse "..." è visualizzato al suo posto
ja: 設定されていれば、長すぎる文字は切り捨てられ、省略記号"..." が代りに表示される。
ne: यदि सेट भएमा, भरि भएको पाठ काटिन्छ र सट्टामा इलिप्सिस् "..." प्रदर्शन हुन्छ

source: Image shade
fr: Ombrage de l'image
it: Immagine Ombra
ja: 透明度
ne: छवि सेड

source: Import MIDI: %s
fr: Importation MIDI : %s
it: Importa MIDI: %s
ja: MIDI をインポート: %s
ne: MIDI आयात गर्नुहोस्: %s

source: Import a standard MIDI file into the current project
fr: Importe un fichier MIDI standard dans le projet actuel
it: Importa un file standard MIDI nel progetto corrente
ja: 標準 MIDI ファイルを現在のプロジェクトにインポート
ne: हालको परियोजनामा मानक MIDI फाइल आयात गर्नुहोस्

source: Importing MIDI file `%s'
fr: Importation du fichier MIDI « %s »
it: Importazione file MIDI `%s'
ja: MIDI ファイル '%s' をインポート中
ne: MIDI फाइल `%s' आयात हुँदैछ

source: In music theory, a diatonic scale (also: heptatonia prima) is a seven-note musical scale comprising five whole-tone and two half-tone steps. The half tones are maximally separated, so between two half-tone steps there are either two or three whole tones, repeating per octave.
fr: En solfège théorique, une échelle diatonique (aussi : heptatonique) est une échelle musicale à 7 degrés à 5 tons entiers plus 2 demi-tons. Les demi-tons sont éloignés au maximum, ainsi entre les demi-tons il y a, soit deux, soit trois tons dont le motif se répète par octave.

source: In this tuning the fifths C-G, D-A, E-B, F#-C#, and Bb-F are tempered narrow by 1/3 comma, and the fifths G#-D# and Eb-Bb are widened by 1/3 comma. The other fifths are pure. Most of its intervals are close to sixth-comma meantone. Werckmeister designed this tuning for playing mainly diatonic music.
fr: Dans cet accord les quintes do-sol, ré-la, mi-si, fa#-do# et si bémol-fa sont tempérés en les réduisant d'un tiers de comma, et les quintes sol#-ré# et mi bémol-si bémol en les agrandissant d'un tiers de comma. La plupart de ces intervalles sont proches du tempérament mésotonique à un sixième de comma. Werckmeister conçut cet accord essentiellement pour l'interprétation de la musique diatonique.

source: In this tuning the fifths D-A, A-E, F#-C#, C#-G#, and F-C are narrowed by 1/4 comma, and the fifth G#-D# is widened by 1/4 comma. The other fifths are pure. This temperament is closer to equal temperament than Werckmeister III or IV.
fr: Dans cet accord les quintes ré-la, la-mi, fa#-do#, do#-sol# et fa-do sont diminuées d'un quart de comma, alors que la quinte sol#-ré# est augmentées d'un quart de comma. Les autres quintes sont pures. Ce tempérament est plus proche du tempérament égal que Werckmeister III ou IV.

source: Indian Scale
fr: Échelle hindoue
it: Scala Indiana

source: Initial phase of the oscillator wave form (cycle offset in degree)
fr: Déphasage initial de la forme d'onde de l'oscillateur (décalage de période en degrés)
it: Fase iniziale della forma d'onda dell'oscillatore (offset in gradi)
ne: ओस्सिलेटर तरङ्ग फारमको प्रारम्भिक फेज (डिग्रीमा साइकल अफसेट)

source: Initializers
fr: Initialiseurs
it: Inizializzatori
ja: 初期化
ne: इनिसियलाइजर

source: Input
fr: Entrée
it: Ingresso
ja: 入力
ne: आगत

source: Input 1 [%]
fr: Entrée 1 [%]
it: Ingresso 1 [%]
ja: 入力 1 [%]
ne: आगत १ [%]

source: Input 2 [%]
fr: Entrée 2 [%]
it: Ingresso 2 [%]
ja: 入力 2 [%]
ne: आगत २ [%]

source: Input Assignments
fr: Assignations d'entrées
it: Assegnazione ingressi
ja: 入力割り当て
ne: आगत पङ्क्तिबद्वता

source: Input Channel %u
fr: Canal d'entrée %u
it: Canale d'Ingresso %u
ja: 入力チャネル %u
ne: आगत च्यानल %u

source: Input Modulation [%]
fr: Modulation en entrée [%]
it: Modulazione d'Ingresso [%]
ja: 入力変調 [%]
ne: आगत मोड्युलेसन [%]

source: Input Port %u
fr: Port d'entrée %u
it: Ingresso Porta %u
ja: 入力ポート %u
ne: आगत पोर्ट %u

source: Input Signals
fr: Signaux d'entrée
it: Ingresso Segnali
ja: 入力信号
ne: आगत सङ्केत

source: Input channel already in use
fr: Canal d'entrée déjà utilisé
it: Il canale d'ingresso è in uso
ja: 入力チャネルは既に使用されています
ne: आगत च्यानल प्रयोगमा आइसक्यो

source: Input channel in use
fr: Canal d'entrée utilisé
it: Canale d'ingresso in uso
ja: 使用する入力チャネル
ne: प्रयोगमा च्यानल आगत

source: Input channel is private
fr: Canal d'entrée privé
it: Il canale d'ingresso è privato
ja: 入力チャネルはプライベートです
ne: आगत च्यानल गोप्य छ

source: Input port name to interface to
fr: Nom du port d'entrée vers lequel s'interfacer
it: Nome della porta d'ingresso da interfacciare a
ja: インターフェースする入力ポート名
ne: यसलाई इन्टरफेस गर्न आगत पोर्ट नाम

source: Input/Output channels already connected
fr: Canaux d'entrée/sortie déjà connectés
it: Canali Ingresso/Uscita correntemente connessi
ja: 入出力チャネルは既に接続されています
ne: निर्गत/आगत च्यानलहरू जडान भइसक्यो

source: Input/Output channels not connected
fr: Canaux d'entrée/sortie non connectés
it: Canali Ingresso/Uscita non connessi
ja: 入出力チャネルが接続されていません
ne: निर्गत/आगत च्यानलहरू जडित भएको छैन

source: Input/output error
fr: Erreur d'entrée/sortie
it: Errore Ingresso/Uscita
ne: निर्गत/आगत त्रुटि

source: Inputs
fr: Entrées
it: Ingressi
ja: 入力
ne: आगत

source: Insert
fr: Insérer
it: Inserisci
ja: 挿入
ne: घुसाउनुहोस्

source: Insert Control Event
fr: Insérer un événement de contrôle
it: Inserisci Controllo Evento
ja: コントロールイベントを挿入
ne: नियन्त्रण घटना घुसाउनुहोस्

source: Insert Module
fr: Insère un module
it: Inserisci Modulo
ja: モジュールを挿入
ne: मोड्युल घुसाउनुहोस्

source: Insert Note
fr: Insérer la note
it: Insrisci Nota
ja: ノートを挿入
ne: द्रष्टव्य घुसाउनुहोस्

source: Insert Part
fr: Insérer une mesure
it: Inserisci Parte
ja: パートを挿入
ne: अंश घुसाउनुहोस्

source: Insert clipboard contents as current selection
fr: Colle le contenu du presse-papiers à la position actuelle
it: Inserisci contenuto degli appunti come selezione corrente
ja: クリップボードの内容を選択領域として挿入
ne: क्लिपबोर्ड सामाग्री हालको चयनमा घुसाउनुहोस्

source: Insert eighths note
fr: Insère une simple croche
it: Inserisci note da un ottavo (croma)
ja: 8分ノートを挿入
ne: आठौ द्रष्टव्य घुसाउनुहोस्

source: Insert half notes
fr: Insère une blanche
it: Inserisci note metï¿½ (minima)
ja: 半ノートを挿入
ne: आधा द्रष्टव्य घुसाउनुहोस्

source: Insert hundred twenty-eighth note
fr: Insère une quintuple croche
it: Inserisci note da un centoventottesimo
ja: 128分ノートを挿入
ne: एक सय अठ्ठाइसौं द्रष्टव्य घुसाउनुहोस्

source: Insert part
fr: Insère une mesure
it: Inserisci Parte
ja: パートを挿入
ne: अंश घुसाउनुहोस्

source: Insert quarter notes
fr: Insère une noire
it: Inserisci note da un quarto (semiminima)
ja: 4分ノートを挿入
ne: चौथाइ द्रष्टव्य घुसाउनुहोस्

source: Insert sixteenth note
fr: Insère une double croche
it: Inserisci note da un sedicesimo (semicroma)
ja: 16分ノートを挿入
ne: सोर्हौ द्रष्टव्य घुसाउनुहोस्

source: Insert sixty-fourth note
fr: Insère une quadruple croche
it: Inserisci note da un sessantaquattresimo (semibiscroma)
ja: 64分ノートを挿入
ne: चौसाठ्ठिऔ द्रष्टव्य घुसाउनुहोस्

source: Insert thirty-second note
fr: Insère une triple croche
it: Inserisci note da un trentaduesimo (biscroma)
ja: 32分ノートを挿入
ne: बत्तिसौं द्रष्टव्य घुसाउनुहोस्

source: Insert whole notes
fr: Insère une ronde
it: Inserisci note intere (semibreve)
ja: 全ノートを挿入
ne: पूरा द्रष्टव्य घुसाउनुहोस्

source: Insert/edit/move parts (mouse button 1 and 2)
fr: Insère/édite/déplace les mesures (bouton de souris 1 et 2)
it: Inserisci/Modifica/Sposta parti (pulsanti del mouse 1 e 2)
ja: パートを挿入/編集/移動 (マウスボタン1, 2)
ne: अशं घुसाउनुहोस्/सम्पादन गर्नुहोस्/सार्नुहोस् (माउसको बटन १ र २)

source: Insert/resize/move notes (mouse button 1 and 2)
fr: Insérer/redimensionner/déplacer des notes (boutons de souris 1 et 2)
it: Inserisci/Ridimensiona/Sposta le note (pulsanti del mouse 1 e 2)
ja: ノートを挿入/リサイズ/移動(マウスボタン 1, 2)
ne: घुसाउनुहोस्/रिसाइज गर्नुहोस्/द्रष्टव्य सार्नुहोस् (माउस बटन १ र २)

source: Instrument Path
fr: Chemin des instruments
it: Percorso Strumenti
ja: インストゥルメントパス
ne: बाजा बाटो

source: Insufficient permission
fr: Droits d'accès insuffisants
it: Permessi insufficienti
ne: अपर्याप्त अनुमति

source: Internal error (please report)
fr: Erreur interne (faites un rapport)
it: Errore interno (riportare il log)
ne: आन्तरिक त्रुटि (कृपया प्रतिवेदन गर्नुहोस्)

source: Internals
fr: Internes
ja: 内部
ne: आन्तरिक

source: Invalid MIDI control type
fr: Type de contrôle MIDI non valide
it: Tipo di controllo MIDI non valido
ja: 不正な MIDI コントロールタイプ
ne: मिडि नियन्त्रण प्रकार अवैध

source: Invalid duration
fr: Durée non valide
it: Durata non valida
ja: 不正な持続期間
ne: समय अन्तराल अवैध

source: Invalid format
fr: Format non valide
it: Formato non valido
ne: अवैध ढाँचा

source: Invalid object property
fr: Propriété d'objet non valide
it: Proprietà oggetto non valida
ja: 不正なオブジェクトプロパティ
ne: अवैध वस्तु गुण

source: Invalid offset
fr: Décalage non valide
it: Offset non valido
ja: 不正なオフセット
ne: अवैध अफसेट

source: Invalid overlap
fr: Chevauchement invalide
it: Sovrapposizione non valida
ja: 不正なオーバーラップ
ne: अवैध ओभरल्याप

source: Invalid synthesis module connection
fr: Connexion non valide du module de synthèse
it: Non valida connessione del odulo di sintesi
ja: 不適切なシンセモジュール接続
ne: सिन्थेसिस मोड्युल जडान खारेज छ

source: Invalid synthsis module type
fr: Type de module de synthèse non valide
it: Non valido il tipo del modulo di sintesi
ja: 不正なシンセモジュールタイプ
ne: सिन्थेसिस मोड्युल प्रकार खारेज छ

source: Invert
fr: Inverser
it: Inverti
ne: उल्टो पार्नुहोस्

source: Invert Sustain Pedal
fr: Pédale de sostenuto inversée
it: Inversione pedale sustain
ja: サスティンペダルを反転
ne: थाम्ने पेडल उल्टो पार्नुहोस्

source: Invert the current selection
fr: Inverser la sélection actuelle
it: Inverti la selezione corrente
ne: हालमा चयन उल्टो पार्नुहोस्

source: Invert the state of sustain (damper) pedal so on/off meanings are reversed
fr: Inverse les positions d'activation de la pédale du sostenuto (marche/arrêt sont inversés)
it: Inverte lo stato del pedale (sordina) di sustain; in sostanza la sequenza on/off è invertita.
ja: サスティン(ダンパー)ペダルのオン/オフを反転
ne: थाम्ने (ड्याम्प्लर) पेडलको स्थिति उल्टो पार्नुहोस् किनकि खुला/बन्द परिभाषाहरू उल्टाउन सकिन्छ

source: Is a directory
fr: Est un dossier
it: E' una cartella
ne: एउटा डाइरेक्टरी हो

source: Item
fr: Élément
it: Voce
ja: アイテム
ne: वस्तु

source: Item List
fr: Liste d'éléments
it: Lista Voci
ne: वस्तु सूची

source: Justify
fr: Justifier
it: Giustificato
ja: 調整
ne: समरेखन गर्नुहोस्

source: Key Binding
fr: Combinaison de touche
it: Combinazione Tasti
ja: キーボードショートカット
ne: कुञ्जी बाइन्डिङ

source: Key combinations used to activate a function
fr: Combinaisons de touches utilisées pour activer une fonction
it: Combinazione di tasti usati per attivare una funzione del programma
ja: 機能を有効にするショートカット
ne: कुञ्जी संयोजन कार्य सक्रिय गर्न प्रयोग हुन्छ

source: Kirnberger's method of compensating for and closing the circle of fifths is to split the "wolf" interval known to those who have used meantone temperaments between four fifths instead, allowing for four 1/4-comma wolves to take their place. 1/4-comma wolves are used extensively in meantone and are much easier to tune and to listen to. Therefore, only one third remains pure (between C and E).
fr: La méthode de compensation de Kirnberger pour fermer le cercle des quintes est de partager l'intervalle du « loup », connu par ceux qui utilisent le tempérament mésotonique, entre quatre au lieu de cinq quintes ; cela permet à quatre quarts de comma du loup de prendre place. Les quart de commas du loup sont beaucoup utilisés en tempérament mésotonique ; ils sont plus faciles à accorder et à écouter également. De la sorte, seule une tierce reste pure (entre do et mi).

source: Knob
fr: Potentiomètre rotatif
it: Manopola
ja: ノブ
ne: नब

source: Knob (Logarithmic)
fr: Potentiomètre (logarithmique)
it: Manopola (Reg Logaritmica)
ne: नब (लोगारिथ्मिक)

source: LADSPA Path
fr: Chemin LADSPA
it: Percorso LADSPA
ja: LADSPA パス
ne: LADSPA बाटो

source: LADSPA Plugins
fr: Greffons LADSPA
it: Plugin LADSPA
ja: LADSPA プラグイン
ne: लाडस्पा प्लगइन

source: Label
fr: Étiquette
it: Etichetta
ja: ラベル
ne: लेबुल

source: Last modification time
fr: Date/heure de la dernière modification
it: Ultima modifica
ja: 最終更新日時
ne: अन्तिम संशोधन समय

source: Latency [ms]
fr: Latence [ms]
it: Latenza [ms]
ja: レイテンシ [ms]
ne: ल्याटेन्स [ms]

source: Layout:
fr: Disposition :
it: Aspetto:
ja: 配置:
ne: सजावट:

source: Left
fr: Gauche
it: Sinistra
ja: 左
ne: बायाँ

source: Left Audio
fr: Audio gauche
it: Audio SInistro
ja: 左オーディオ
ne: बायाँ अडियो

source: Left Audio In
fr: Entrée audio gauche
it: Ingresso Audio Sinistro
ja: 左オーディオ入力
ne: बायाँ अडियो आगत

source: Left Audio Input
fr: Entrée audio gauche
it: Ingresso Audio Sinistro
ja: 左オーディオ入力
ne: बायाँ अडियो आगत
