Repository: tim-janik/beast
Catalog: po/*.po
Languages: fr, it, ja, ne

source: Note _Length
fr: _Longueur de la note
it: Durata Nota
ja: ノート長さ(_L)
ne: द्रष्टव्य लम्बाइ

source: Note decay is the 'half-life' of the note's decay in seconds
fr: L'extinction de la note s'exprime par sa demie-vie en secondes

source: Notes and informations about this release cycle
fr: Notes et informations à propos du présent cycle de parution
it: Note e informazioni su questo rilascio stabile
ja: このリリースサイクルについてのノートと情報
ne: निष्काशन चक्रका बारेमा टिप्पणी र सूचना

source: Notes from unchecked tracks are ignored by the sequencer during playback
fr: Les notes des pistes non cochées sont ignorées par le séquenceur lors de l'exécution
it: Le note delle tracce non spuntate sono ignorate dal sequencer durante l'esecuzione
ja: 演奏中シーケンサは未検証のトラックのノートを無視します
ne: प्लेब्याकको बेला जाँच नभएको ट्र्याकहरूबाट टिप्पणीहरू अनुक्रमणद्वारा वेबस्ता गरियो

source: Notify users via error bells if edits cannot be carried out
fr: Avertir l'utilisateur par un bip d'erreur si l'édition ne peut pas être enregistrée

source: Number of Columns
fr: Nombre de colonnes
it: Numero di Colonne
ja: カラム数
ne: स्तम्भको सङ्ख्या

source: Number of Rows
fr: Nombre de lignes
it: Numero di Righe
ja: 列数
ne: पङ्क्तिको सङ्ख्या

source: Number of elements (C specific)
fr: Nombre d'éléments (spécifique au C)
it: Numero di elementi (C specifico)
ne: तत्वको सङ्ख्या (C निर्दिष्ट)

source: Number of octaves to be affected by exponential frequency modulation
fr: Nombre d'octaves affectées par la modulation de fréquence exponentielle
it: Numero di Ottave alle quali viene applicata la Modulazione di Frequenza Esponenziale
ja: 指数関数的周波数変調の影響を受けるオクターブ数
ne: एक्सपोनेन्सियल आवृति मोडुलेसनबाट प्रभावित हुने अक्टेभको सङ्ख्या

source: Number of ticks per quarter note
fr: Nombre de battements par noire
it: Risoluzioni per note da un quarto
ja: 4分ノート当りのティック数
ne: प्रति चौथाइ द्रष्टव्यमा टिकको सङ्ख्या

source: Numerator
fr: Numérateur
it: Numeratore
ne: गणक

source: Object Drop Down Box
fr: Boîte déroulante des objets
ja: オブジェクトドロップダウンボックス
ne: वस्तु ड्रप डाउन बाकस

source: Object Selection: %s
fr: Sélection de l'objet : %s
it: Selezione Oggetto: %s
ne: वस्तु चयन: %s

source: Online Demos...
fr: Démos en ligne...
it: Demo Online...
ja: オンラインデモ...
ne: अनलाइन डेमोहरू...

source: Online Sound Archive...
fr: Archive de sons en ligne...
it: Archivio Suoni Online...
ja: オンラインサウンドアーカイブ...
ne: अनलाइन ध्वनि सङ्ग्रह...

source: Online _Help Desk...
fr: A_ssistance en ligne...
ja: オンラインヘルプデスク(_H)...
ne: अनलाइन मद्दत डेस्क...

source: Only parts louder than threshold are compressed
fr: Seules les parties au dessus du seuil sont compressées
it: Solo i segnali maggiori della soglia verranno compressi
ne: अंशहरू थ्रेसहोल्डर भन्दा उच्च स्वरको कम्प्रेस्ड हुन्छ

source: Open Project
fr: Ouvrir un projet
it: Apri Progetto
ja: プロジェクトを開く
ne: परियोजना खोल्नुहोस्

source: Open Sound System MIDI driver: DEVICE - MIDI device file name. MODE - one of "ro", "rw" or "wo" for read-only, read-write or write-only access.
fr: Pilote MIDI Open Sound System : DEVICE - nom du fichier du périphérique MIDI. MODE - « ro », « rw » ou « wo » pour accès en lecture seule, lecture-écriture ou écriture seule.
it: Open Sound System driver MIDI: DISPOSITIVO - nome file dispositivo. MODO - uno solo tra "ro", "rw" or "wo" per accesso in sola-lettura, lettura-scrittura o sola-scrittura.
ne: ध्वनि प्रणाली मिडि ड्राइभर खोल्नुहोस्: यन्त्र - मिडि यन्त्र फाइलको नाम मोड - एकको "ro", "rw" or "wo" for पढ्न मात्र, पढ्न-लेख्न वा लेख्न-मात्र पहुँच

source: Open Sound System PCM driver: DEVICE - PCM device file name MODE - may contain "rw", "ro" or "wo" for read-only, read-write or write-only access; adding "hs" forces hard sync on underruns.
fr: Pilote PCM Open Sound System : DEVICE - nom du fichier du périphérique PCM MODE - « rw », « ro » ou « wo » pour un accès lecture seule, lecture-écriture ou écriture seule ; ajouter « hs » force une synchronisation matérielle si l'alimentation du tampon est trop lente.
it: Open Sound System driver PCM: DISPOSITIVO - nome file dispositivo PCM MODO - puï¿½ contenere "rw", "ro" o "wo" per l'accesso in sola lettura, lettura-scrittura o sola scrittura; aggiungendo "hs" si forza la sync in underruns.
ne: ध्वनि प्रणाली PCM ड्राइभर खोल्नुहोस्: यन्त्र - PCM यन्त्र फाइलनाम मोड - यसले "rw", "ro" or "wo"का लागि छनोट गर्न सक्छ पढ्न-मात्र, पढ्न-लेख्न वा लेख्न मात्र सक्षम; जोड्नुहोस् "एचएस" तल चालूमा कडा समक्रमण दवाब

source: Open existing project
fr: Ouvre un projet existant
it: Apri un progetto esistente
ja: プロジェクトを開く
ne: अवस्थित परियोजना खोल्नुहोस्

source: Open failed
fr: Échec à l'ouverture
it: Apertura fallita
ne: खोल्न असफल

source: Open file browser
fr: Ouvre le navigateur de fichiers
it: Navigazione file
ja: ファイルブラウザを開く
ne: फाइल ब्राउजर खोल्नुहोस्

source: Opening project `%s'
fr: Ouverture du projet « %s »
it: Apertura progetto `%s'
ja: プロジェクト '%s' を開く
ne: `%s' परियोजना खोल्दैछ

source: Order
fr: Ordre
it: Ordine
ja: 順番
ne: आदेश

source: Order of Filter
fr: Ordre de filtrage
it: Ordine del Filtro
ja: フィルターの順番
ne: फिल्टरको आदेश

source: Organ frequency as note, converted to Hertz according to the current musical tuning
fr: Fréquence de l'orgue définie par une note, convertie en Hertz selon la tonalité musicale retenue

source: Organ frequency in Hertz, i.e. the pitch of the base tone
fr: Fréquence de l'orgue en Hertz, c'est-à-dire la hauteur de la tonalité de base

source: Origin: %s
fr: Origine : %s
it: Origine: %s
ne: उत्पत्ती: %s

source: Orphan Parts
fr: Mesures orphelines
it: Parti Orfane
ja: パートを破棄
ne: ओर्फन अंश

source: Oscillated Output
fr: Sortie oscillation
it: Uscita Oscillata
ja: 発振された出力
ne: ओस्किलेटेड निर्गत

source: Oscillating Frequency Input
fr: Fréquence d'oscillation en entrée
ja: 発振器周波数入力
ne: ओस्किलेटिङ आवृति आगत

source: Oscillator
fr: Oscillateur
it: Oscillatore
ja: 発振器
ne: ओसिलेटर

source: Oscillator frequency as note, converted to Hertz according to the current musical tuning
fr: Fréquence d'oscillateur exprimée par une note, convertie en Hertz selon la tonalité musicale retenue

source: Oscillator frequency in Hertz, i.e. the number of oscillator cycles per second
fr: Fréquence de l'oscillateur en Hertz, c'est-à-dire nombre d'oscillations par seconde
it: Frequenza dell'oscillatore in Hz. L'Hertz indica il numero di oscillazioni (cicli) al secondo

source: Oscillator wave form
fr: Forme d'onde de l'oscillateur
it: Oscillatore di forma d'onda
ja: 発振器波形
ne: ओस्सिलेटर तरङ्ग फारम

source: Out of memory
fr: Mémoire saturée
ne: स्मृति बाहिरको

source: Output
fr: Sortie
it: Uscita
ja: 出力
ne: निर्गत

source: Output Assignments
fr: Assignations de sorties
it: Assegnazione Uscite
ja: 出力割り当て
ne: आगत पङ्क्तिबद्वता

source: Output Balance
fr: Balance de sortie
it: Bilanciamento d'Uscita
ja: 出力バランス
ne: निर्गत सन्तुलन

source: Output Panning
fr: Panoramique de sortie
ja: 出力パン
ne: निर्गत योजना

source: Output Port %u
fr: Port de sortie %u
it: Uscita Porta %u
ja: 出力ポート %u
ne: निर्गत पोर्ट %u

source: Output Signal Monitor
fr: Moniteur du signal de sortie
it: Monitor Segnali d'Uscita
ne: आगत सङ्केत मोनिटर

source: Output Signals
fr: Signaux de sortie
it: Uscita Segnali
ja: 出力信号
ne: आगत सङ्केत

source: Output [dB]
fr: Sortie [dB]
it: Uscita [dB]
ne: निर्गत [dB]

source: Output port name to interface from
fr: Nom du port de sortie à partir duquel s'interfacer
it: Nome della porta d'uscita da interfacciare da
ja: インターフェースする出力ポート名
ne: यसबाट इन्टरफेस गर्न निर्गत पोर्ट नाम

source: Output stage amplification in decibel
fr: Amplification de l'étage final en décibels
it: Stadio di amplificazione d'uscita in decibel
ne: डेसिबलमा आगत स्टेज एम्प्लिफिकेसन

source: Outputs
fr: Sorties
it: Uscite
ja: 出力
ne: निर्गत

source: Ownership mismatch
fr: Incohérence de propriété
ja: 所有者の不整合
ne: स्वामित्व अमिल्दो

source: PCM Input module
fr: Module d'entrée PCM (Pulse Code Modulation)
it: Modulo d'Ingresso PCM
ja: PCM 入力モジュール
ne: PCM आगत मोड्युल

source: PCM Output module
fr: Module de sortie PCM
it: Modulo di Uscita PCM
ja: PCM 出力モジュール
ne: PCM आगत मोड्युल

source: PLUGIN:CARD,DEV,SUBDEV
fr: GREFFON : CARTE, PÉRIPH, SOUS-PÉRIPH

source: Parameter
fr: Paramètres
it: Parametro
ja: パラメータ
ne: परामिति

source: Parameter to pass to functions upon activation
fr: Paramètres à passer aux fonctions lors de leur activation
it: Parametro da passare alle funzioni su attivazione
ja: 有効になるときに機能に渡されるパラメータ
ne: सक्रियतामा प्रकार्यलाई पास गर्ने परामिति

source: Parameters
fr: Paramètres
it: Parametri
ja: パラメータ
ne: परामिति

source: Parasite Paths
fr: Chemins parasites
ja: パラサイトパス
ne: पारासाइट बाटो

source: Parent mismatch
fr: Parent incompatible
ja: 親の不整合
ne: अविभावक अमिल्दो

source: Parsing error
fr: Erreur d'analyse
it: Errore d'analisi
ja: パーズエラー
ne: पद वर्णन त्रुटि

source: Parts
fr: Mesures
it: Parti
ja: パート
ne: अंश

source: Passband falloff at cutoff frequency
fr: Décroissance de bande passante à la fréquence de coupure
it: Frequenza di lavoro del filtro passa banda
ja: カットオフ周波数でのパスバンドフォールオフ
ne: काटिएको आवृतिमा पासब्यान्ड घट्छ

source: Paste
fr: Coller
it: Incolla
ja: 貼り付け
ne: टाँस्नुहोस्

source: Path
fr: Chemin
it: Percorso
ja: パス
ne: बाटो

source: Pattern
fr: Motif
ja: パターン
ne: बाँन्की

source: Pattern Editor Layout
fr: Disposition de l'éditeur de motifs
it: Aspetto Editor di Pattern
ja: パターンエディタ配置
ne: सम्पादक बाँन्की सजावट

source: Pentatonic 5-limit
fr: Pentatonique 5-limit

source: Pentatonic Blues
fr: Pentatonique blues
it: Pentatonica Blues

source: Pentatonic Gogo
fr: Pentatonique gogo

source: Pentatonic scales are used in modern jazz and pop/rock contexts because they work exceedingly well over several chords diatonic to the same key, often better than the parent scale.
fr: Les échelles pentatoniques s'utilisent en jazz moderne et dans les contextes pop/rock parce qu'elles fonctionnent extrêmement bien sur plusieurs accord diatoniques de la même clé, souvent mieux que l'échelle parente.

source: Percentage of CPU usage
fr: Pourcentage d'utilisation de la CPU
it: Percentuale d'uso della CPU
ja: CPU 使用量(%)
ne: CPU प्रयोगको प्रतिशत

source: Percentage of background image pixel to blend over background color.
fr: Pourcentage de mélange entre l'image et la couleur d'arrière plan.
it: Percentuale dell'immagine di sfondo da miscelare sul colore di sfondo.
ja: 背景画像ピクセルを背景色に混ぜ合わせる割合(%)
ne: पृष्ठभूमि छवि पिक्सेल पृष्ठभूमि रङमा ब्लेन्ड गरेको प्रतिशत

source: Perform exponential frequency modulation instead of linear
fr: Effectue une modulation de fréquence exponentielle au lieu de linéaire
it: Esegui Modulazione Esponenziale di Frequenza invece di quella Lineare
ja: 線形の代わりに指数関数的周波数変調を実行
ne: पङ्क्तिको सट्टा एक्सपोनेन्सियल आवृतिको मोडुलेसन कार्यसम्पादन गर्नुहोस्

source: Person changing or creating this object
fr: Personne modifiant ou créant cet objet
it: Persona che ha cambiato e/o creato questo oggetto
ja: このオブジェクトをつくった/変更した人
ne: यो वस्तु परिवर्तन वा निर्माण गर्ने व्यक्ति

source: Piano Keys
fr: Touches de clavier
it: Piano Key
ja: ピアノキー
ne: पियानो कुञ्जी

source: Piano Notes
fr: Notes du clavier
ja: ピアノノート
ne: पियानो द्रष्टव्य

source: Pitch Bend
fr: Distorsion de hauteur du son
ja: ピッチベンド
ne: पिच बेन्ड

source: Play note
fr: Jouer la note
it: Riproduci la nota
ja: ノートを演奏
ne: द्रष्टव्य प्ले गर्नुहोस्

source: Play or restart playback of the project
fr: Exécute le projet ou en relance l'exécution
it: Riproduce o riavvia l'esecuzione del progetto
ja: プロジェクトの再生を開始/再開
ne: परियोजनाको प्लेब्याक प्ले गर्नुहोस् वा पुन: सुरु गर्नुहोस्

source: Playback
fr: Jouer
it: Ripetizione
ja: 再生
ne: प्लेब्याक

source: Playback Settings
fr: Réglages pour l'exécution
it: Impostazioni Playback
ne: प्लेब्याक सेटिङ

source: Please press the keyboard shortcut to be installed for function: %s
fr: Saisissez le raccourci clavier à installer pour la fonction : %s
it: Per favore premi la scorciatoia da tastiera per installare la funzione: %s
ja: 機能 %s をインストールするにはキーボードショートカットを押して下さい
ne: कृपया प्रकार्यका लागि स्थापना गर्ने कुञ्जीपाटी थिच्नुहोस्: %s

source: Please press the keyboard shortcut to be installed...
fr: Saisissez le raccourci clavier à installer...
it: Per favore premi la scorciatoia da tastiera per installare...
ja: インストールするにはキーボードショートカットを押して下さい...
ne: कृपया स्थापना गर्न कुञ्जीपाटी सटकर्ट थिच्नुहोस्...

source: Pluck frequency input
fr: Entrée de la fréquence de pincement
it: Cattura la frequenza d'ingresso
ja: プラック周波数入力
ne: प्लक आवृति आगत

source: Pluck strings on raising edge
fr: Pincer la corde sur la montée de l'impulsion
ja: レイズ端でストリングスをヒット
ne: बढेको कुनामा प्लक स्ट्रिङ

source: Pluck the string
fr: Pincer la corde

source: Plugin Path
fr: Chemin des greffons
it: Percorso Plugin
ja: プラグインパス
ne: प्लगइन बाटो

source: Plugins
fr: Greffons
it: Plugin
ja: プラグイン
ne: प्लगइन

source: Popup Options
fr: Menu contextuel
it: Opzioni Popup
ja: ポップアップオプション
ne: पपअप विकल्प

source: Portamento Time
fr: Durée du glissando
it: Portamento Tempo
ja: ポルタメント時間
ne: पोर्टामेन्टो समय

source: Position taken
fr: Position prise
ja: 確保した位置
ne: स्थान लिइयो

source: Positive Value Color
fr: Couleur d'une valeur positive
it: Valore Colore Positivo
ja: 正の値の色
ne: सकरात्मक मान रङ

source: Postprocessor
fr: Post-processeur
it: Postprocessore
ja: ポストプロセッサ
ne: पोष्टप्रोसेसर

source: Preferences
fr: Préférences
it: Preferenze
ja: 設定
ne: प्राथमिकता

source: Premature EOF
fr: Fin de fichier prématurée
it: Prematuro End Of File
ne: असायामिक EOF

source: Preview
fr: Aperçu
it: Anteprima
ja: テスト再生
ne: पूर्वावलोकन

source: Procedure Browser
fr: Navigateur de procédures
it: Procedura Browser
ja: プロセスブラウザ
ne: कार्यविधि ब्राउजर

source: Procedure _Browser
fr: _Navigateur de procédures
it: Procedura _Browser
ja: プロセスブラウザ(_B)
ne: कार्यविधि ब्राउजर

source: Procedure currently busy
fr: Procédure actuellement occupée
it: Procedura correntemente occupata
ja: プロセスは現在ビュジーです
ne: कार्यविधि हाललाई ब्यस्त छ

source: Procedure execution aborted
fr: Abandon de l'exécution de la procédure
it: Esecuzione procedura annullata
ja: プロセス実行を中止
ne: कार्यविधि कार्यान्वयन हटाइयो

source: Procedure execution failed
fr: Échec à l'exécution de la procédure
it: Esecuzione procedura fallita
ja: プロセス実行に失敗
ne: कार्यविधि कार्यान्वयन असफल

source: Procedure parameter invalid
fr: Paramètre de procédure non valide
it: Non valido parametro procedura
ja: プロセスパラメータが不正です
ne: कार्यविधि परामिति खारेज छ

source: Procedure: %s Script: %s
fr: Procédure : %s Script : %s
it: Procedura: %s Script: %s
ne: प्रक्रिया: %s स्क्रिप्ट: %s

source: Process: %s
fr: Processus : %s
it: Processo: %s
ja: プロセッサ: %s
ne: प्रकृया: %s

source: Processing duration between input and output of a single sample, smaller values increase CPU load
fr: Durée de traitement entre l'entrée et la sortie d'un simple échantillonnage, les plus petites valeurs augmentent la charge CPU
it: Durata processamento tra ingresso e uscita di un singolo campione. A valori più piccoli corrisponde un carico maggiore sulla CPU
ja: サンプル一つの入出力の間での処理遅延時間。より小さくなるほど CPU 負荷を増大させる
ne: एकल नमूनाको निर्गत र आगत बिचको प्रकृया अवधि, साना मानहरूले CPU लोडको भार बढाउँछ

source: Profiler
fr: Moniteur
ja: プロファイラ
ne: प्रोफाइलर

source: Program Change
fr: Changement de programme
it: Cambio Programma
ja: プロパティ変更
ne: कार्यक्रम परिवर्तन

source: Properties
fr: Propriétés
it: Proprietà
ja: プロパティ
ne: गुण

source: Property Identifier
fr: Identifiant de la propriété
it: Identificatore Proprietà
ja: プロパティ識別子
ne: गुण पहिचायक

source: Property Name
fr: Nom de la propriété
it: Nome Proprietà
ja: プロパティ名
ne: गुण नाम

source: Proportion of the positive component duration of the pulse wave form (Pulse has to be selected as wave form for this to take effect)
fr: Rapport de la durée de la composante positive à celle de la pulsation de l'onde (l'impulsion doit doit être sous forme d'onde pour que ceci prenne effet)
it: Proporzione della durata della componente positiva della forma onda dell'impulso (L'impulso deve essere selezionato come forma d'onda affinché abbia effetto)
ja: パルス波形の正コンポーネントデュレイションの比率(このエフェクトについてはパルス波形を選択しなければなりません)
ne: समानुपातिक सकरात्मक अवयव प्लस तरङ्ग समय फारम (प्रभाव पार्नका लागि प्लसलाई तरङ्ग फारमको रूपमा चयन गर्नुपर्ने हुन्छ)

source: Provide an overview of all BEAST documentation contents
fr: Donne un aperçu du contenu de l'ensemble de la documentation de BEAST
it: Indice generale della documentazione di BEAST.
ja: すべての BEAST 文書内容の概要を提供します
ne: सबै BEAST मिसिलीकरण सामग्रीहरूको समिक्षा प्रदान गर्नुहोस्

source: Provide an overview of development related topics and documents
fr: Fournit un aperçu des articles et documents relatifs au développement
it: Determina una vista globale di documenti e argomenti correlati
ja: 開発関連のトピックや文書の概要を提供します
ne: विकास सम्बन्धित शीर्षक र कागजातको समिक्षा प्रदान गर्नुहोस्

source: Provides an introduction about how to accomplish the most common tasks
fr: Indique sommairement comment accomplir les tâches les plus courantes
it: Insegna ad usare il programma nelle sue parti principali.
ja: どのようにほとんどの共通タスクをこなすかについての情報を提供します
ne: साधारण कार्य कसरी सम्पन्न गर्ने भन्ने बारे सूचना पठाउनुहोस्

source: Pulse Modulation
fr: Modulation par impulsion
it: Modulazione Impulsi
ja: パルス変調
ne: प्लस मोड्युलेसन

source: Pulse Modulation [%]
fr: Modulation par impulsion [%]
it: Modulazione d'Impulsi [%]
ja: パルス変調 [%]
ne: प्लस मोड्युलेसन [%]

source: Pulse Width
fr: Largeur d'impulsion
it: Larghezza Impulsi
ja: パルス幅
ne: प्लस चौडाइ

source: Pulse Width Modulation Input
fr: Entrée de la modulation par largeur d'impulsion
it: Ingresso PWM (Modulazione Larghezza Impulsi)
ja: パルス幅変調入力
ne: प्लस चौडाइ मोड्युलेसन आगत

source: Pythagorean Tuning
fr: Accord pythagoricien

source: Pythagorean tuning is the oldest way of tuning the 12-note chromatic scale, in which the frequency relationships of all intervals are based on the ratio 3:2. Its discovery is generally credited to Pythagoras.
fr: L'accord pythagoricien est la plus ancienne façon d'accorder les 12 notes de la gamme chromatique, dans laquelle les rapports des intervalles de fréquences sont proches de 3/2. Cette découverte est généralement attribuée à Pythagore.

source: Q: None
fr: Q : aucun
it: Q: Non Attivo
ja: Q: なし
ne: क्यू: कुनै पनि होइन

source: Q: Tact
fr: Q : Doigté
it: Q: Risoluzione
ja: Q: タクト
ne: क्यू: दक्षता

source: Quantize to eighths note boundaries
fr: Calage temporel sur la croche la plus proche
it: Quantizza nota da un ottavo (croma) agli estremi
ja: 8分ノート境界を量子化
ne: आठौं द्रष्टव्य सीमालाई परिमाणात्मक गर्नुहोस्

source: Quantize to half note boundaries
fr: Calage temporel sur la blanche la plus proche
it: Quantizza nota metï¿½ (minima) agli estremi
ja: 半ノート境界を量子化
ne: आधा द्रष्टव्य सीमालाई परिमाणात्मक गर्नुहोस्

source: Quantize to hundred twenty-eighth note boundaries
fr: Calage temporel sur la quintuple-croche la plus proche
it: Quantizza nota da un centoventottesimo agli estremi
ja: 128分ノート境界を量子化
ne: एक सय अठ्ठाइसौ द्रष्टव्य सीमालाई परिमाणात्मक गर्नुहोस्

source: Quantize to quarter note boundaries
fr: Calage temporel sur la noire la plus proche
it: Quantizza nota da un quarto (semiminima) agli estremi
ja: 4分ノート境界を量子化
ne: चौथाइ द्रष्टव्य सीमालाई परिमाणात्मक गर्नुहोस्

source: Quantize to sixteenth note boundaries
fr: Calage temporel sur la double-croche la plus proche
it: Quantizza nota da un sedicesimo (semicroma) agli estremi
ja: 16分ノート境界を量子化
ne: सोर्हौं द्रष्टव्य सीमालाई परिमाणात्मक गर्नुहोस्

source: Quantize to sixty-fourth note boundaries
fr: Calage temporel sur la quadruple-croche la plus proche
it: Quantizza nota da un sessantaquattresimo (semibiscroma) agli estremi
ja: 64分ノート境界を量子化
ne: चौसठ्ठिऔं द्रष्टव्य सीमा परिमाणात्मक गर्नुहोस्

source: Quantize to tact boundaries
fr: Se caler temporellement aux limites de doigté
it: Quantizza con 'attenzione' gli estremi
ja: タクト境界を量子化
ne: सीमा ठीक गर्न परिमाणात्मक गर्नुहोस्

source: Quantize to thirty-second note boundaries
fr: Calage temporel sur la triple-croche la plus proche
it: Quantizza nota da un trentaduesimo (biscroma) agli estremi
ja: 32分ノート境界を量子化
ne: बत्तिसौं द्रष्टव्य सीमालाई परिमाणात्मक गर्नुहोस्

source: Quantize to whole note boundaries
fr: Calage temporel sur la ronde la plus proche
it: Quantizza nota intera (semibreve) agli estremi
ja: 全ノート境界を量子化
ne: सम्पूर्ण द्रष्टव्य सीमालाई परिमाणात्मक गर्नुहोस्

source: Quarter note
fr: Noire
it: Nota da un Quarto (semiminima)
ja: 4 分ノート
ne: चौथाइ द्रष्टव्य

source: Quarter-Comma Meantone
fr: Mésotonique à 1/4 de comma
it: Quarto puntato (semitono)

source: Quarter-comma meantone was the most common meantone temperament in the sixteenth and seventeenth centuries and sometimes used later.
fr: Le tempérament mésotonique à 1/4 de comma est la plus courant dans les musiques des XVIe et XVIIe siècles. Il a parfois été utilisé plus tard.

source: RC Files
fr: Fichiers RC
it: File RC
ja: 初期化ファイル
ne: आर सी फाइल

source: Rack Editor
fr: Éditeur de rack
ja: ラックエディタ
ne: र्याक सम्पादक

source: Rack editor
fr: Éditeur de rack
ja: ラックエディタ
ne: र्याक सम्पादक

source: Raise
fr: Monter
it: Sposta su
ja: 上へ
ne: बढाउनुहोस्

source: Raise the currently selected key binding, relative to its neighbours
fr: Monte la combinaison de touches actuellement sélectionnée par rapport à ses voisines.
it: Sposta verso l'alto di una posizione la combinazione selezionata
ja: 選択したショートカットを上へ移動
ne: छिमेकसँग सम्बन्धित हालमा छानिएको कुञ्जी बाइन्डिङ बढाउनुहोस्

source: Range:
fr: Plage :
ja: 範囲:
ne: दायरा:

source: Read failed
fr: Échec à la lecture
it: Lettura fallita
ne: पढ्न असफल

source: Rebuild
fr: Reconstruire
it: Aggiorna
ja: 再構築
ne: फेरी बनाउनुहोस्

source: Rectangle select notes
fr: Sélection rectangulaire de notes
it: Area di selezione delle note
ja: ノートを矩形選択
ne: आयात चयन द्रष्टव्य

source: Redo
fr: Refaire
it: Ripristina
ja: リドゥ
ne: रिडु गर्नुहोस्

source: Redo the last undone action
fr: Rétablit la dernière action annulée
it: Ripristina l'ultima azione
ja: 最後のアンドゥアクションを元に戻す
ne: अन्तिममा पूर्वस्थितिमा फर्काएको कार्य रिडु गर्नुहोस्

source: Redo the last undone editing step
fr: Rétablit la dernière action annulée
it: Ripristina l'ultimo passo di editing
ja: 最後にアンドゥした編集ステップをリドゥ
ne: अन्तिम सम्पादन चरण रिडु गर्नुहोस्

source: Reflection cutoff frequency
fr: Reflet de la fréquence de coupure

source: Registered Parameter
fr: Paramètre enregistré
it: Parametro Registrato
ja: 登録されたパラメータ
ne: दर्ता गरिएको परामिति

source: Release [ms]
fr: Décroissance [ms]
it: Rilascio [ms]
ja: リリース [ms]
ne: छोड्नुहोस् [ms]

source: Release counter
fr: Compteur de versions
it: Rilascio contatore
ja: リリースカウンタ
ne: जारी गणक

source: Reload current page
fr: Recharge la page actuelle
it: Ricarica pagina corrente
ja: 現在のページを再読み込み
ne: हालको पृष्ठ पुन: लोड गर्नुहोस्

source: Remove Module
fr: Enlève un module
it: Rimuovi Modulo
ja: モジュールを削除
ne: मोड्युल हटाउनुहोस्

source: Remove Paths
fr: Supprimer les chemins
it: Rimuovi Percorsi
ja: パスを削除
ne: बाटो हटाउनुहोस्

source: Remove Song or Synthesizer
fr: Supprimer une mélodie ou un synthétiseur
it: Rimuovi Canzone o Sintetizzatore
ja: 曲またはシンセサイザを削除
ne: गीत वा सिन्थेसाइजर हटाउनुहोस्

source: Remove any events in the focus cell
fr: Enlever tout événement de la cellule ayant le focus
it: Rimuovi qualsiasi evento nella cella con il focus attivo
ja: フォーカスセル内のイベントを削除
ne: फोकस कक्षमा केही घटना हटाउनुहोस्

source: Remove directory from searchpath
fr: Enlever le répertoire du chemin de recherche
it: Rimuovi directory dal percorso di ricerca
ja: 検索パスからディレクトリを削除
ne: खोजी बाटोबाट डाइरेक्टरी हटाउनुहोस्

source: Remove the currently selected synthesizer (song)
fr: Supprime le synthétiseur (la mélodie) actuellement sélectionné
it: Rimuove il sintetizzatore correntemente selezionato (canzone)
ja: 選択したショートカットを削除
ne: हालमा चयन गरिएको सिन्थेसाइजर (गीत) हटाउनुहोस्

source: Removes the selection from the "%s" list
fr: Enlève la sélection de la liste « %s »
it: Rimuovi la selezione dalla lista "%s"
ne: "%s" सूचीबाट चयन हटाउँदछ

source: Rename
fr: Renommer
it: Rinomina
ja: 名前の変更
ne: पुन: नामकरण गर्नुहोस्

source: Rename parts
fr: Renommer des mesures
it: Rinomina Parti
ja: パートの名前を変更
ne: अंश पुन: नामकरण गर्नुहोस्
