Repository: tim-janik/beast
Catalog: po/*.po
Languages: fr, it, ja, ne

source: Left Audio Out
fr: Sortie audio gauche
it: Uscita Audio Sinistra
ja: 左オーディオ出力
ne: बायाँ अडियो निर्गत

source: Left Audio Output
fr: Sortie audio gauche
it: Uscita Audio SInistra
ja: 左オーディオ出力
ne: बायाँ अडियो आगत

source: Left Channel Output
fr: Sortie audio du canal gauche
it: Uscita Canale Sinistro
ja: 左チャネル出力
ne: बायाँ च्यानल आगत

source: Left In
fr: Entrée gauche
it: Ingr.Sinistro
ja: 左入力
ne: भित्री बायाँ

source: Left Input
fr: Entrée gauche
it: Ingresso Sinistro
ja: 左入力
ne: बायाँ आगत

source: Left Out
fr: Sortie gauche
it: Uscita Sinistra
ja: 左出力
ne: बायाँ बाहिर

source: Left Output
fr: Sortie gauche
it: Uscita Sinistra
ja: 左出力
ne: बायाँ निर्गत

source: Left Volume
fr: Volume canal gauche
it: Volume Sinistro
ja: 左音量
ne: बायाँ भोल्युम

source: Left audio output
fr: Sortie audio gauche
it: Uscita audio sinistra
ja: 左オーディオ出力
ne: बायाँ अडियो निर्गत

source: Left channel input
fr: Entrée du canal de gauche
it: Ingresso canale sinistro
ja: 左チャネル入力
ne: बायाँ च्यानल आगत

source: Left channel output
fr: Sortie du canal gauche
it: Uscita canale sinistro
ja: 左チャネル出力
ne: बायाँ च्यानल निर्गत

source: Left to Right
fr: Gauche à droite
it: Da sinistra a destra

source: Lib...
fr: Bibliothèque...
ja: ライブラリ...
ne: लिब...

source: License
fr: Licence
it: Licenza
ja: ライセンス
ne: अनुमतिपत्र

source: License:
fr: Licence :
it: Licenza:
ja: ライセンス:
ne: अनुमतिपत्र:

source: Link
fr: Lier
it: Collegamento
ja: リンク
ne: लिङ्क गर्नुहोस्

source: Link Part
fr: Lier la mesure
it: Collega Parte
ja: パートをリンク
ne: लिङ्क अंश

source: Link or move parts (mouse button 1 and 2)
fr: Lie ou déplace les mesures (bouton de souris 1 et 2)
it: Collega o Sposta parti (pulsanti del mouse 1 e 2)
ja: パートをリンク、移動 (マウスボタン1, 2)
ne: लिङ्क वा अंशहरू चलाउनुहोस् (माउसको बटन १ र २)

source: List of available mixer busses to be used as bus output
fr: Liste des bus de la table de mixage disponibles pour utilisation en sortie
it: Lista dei bus del mixer disponibili per essere usati come bus d'uscita
ne: बस आगतमा प्रयोग गर्न उपलब्ध मिश्रण बसहरूको सूची

source: List of available mixer busses to be used as track output
fr: Liste des bus de mixage disponibles à utiliser en tant que sortie de piste
it: Lista dei bus mixer disponibili per essere usati come traccia per l'uscita
ne: ट्र्याक आगतमा प्रयोग गर्नका लागि उपलब्ध मिश्रण बसको सूची

source: List of available synthesis networks to choose a MIDI instrument from
fr: Liste des réseaux de synthèse disponibles pour le choix d'un instrument MIDI
it: Lista delle reti di sintesi disponibili da scegliere per uno strumento MIDI
ne: मिडि बाजा रोज्नका लागि उपलब्ध सिन्थेसिस सञ्झ्यालको सूची

source: List of available synthesis networks to choose a postprocessor from
fr: Liste des réseaux de synthèse disponibles pour le choix d'un post-processeur
it: Lista delle reti di sintesi disponibili da scegliere come postprocessori
ja: ポストプロセッサを選択するための、利用可能なシンセネットワークのリスト
ne: पोष्टप्रोसेसर्स रोज्नका लागि उपलब्ध सिन्थेसिस सञ्झ्यालको सूची

source: List of available synthesis networks to choose a sub network from
fr: Liste des réseaux de synthèse disponibles parmi lesquels il convient de choisir un sous-réseau
it: Lista delle reti di sintesi disponibili per scegliere una sotto-rete da
ja: 副ネットワークを選択するための、利用可能なネットワークのリスト
ne: यसबाट सब सञ्जाल रोज्नका लागि उपलब्ध सिन्थेसिस सञ्जाल

source: List of available synthesis networks to choose a track instrument from
fr: Liste des réseaux synthèse disponibles à partir desquels choisir une piste d'instrument
it: Lista delle reti di sintesi disponibili per sceglierne una come traccia di uno strumento da
ja: トラック情報を選択するための、利用可能なシンセネットワークのリスト
ne: ट्र्याक बाजा रोज्नका लागि उपलब्ध सिन्थेसिस सञ्जालको सूची

source: List of available synthesis signals to be used as bus input
fr: Liste des signaux de synthèse disponibles pour utilisation en entrée de bus
it: Lista dei segnali di sintesi disponibili per essere usati come bus d'ingresso
ja: バス入力として使う、利用可能なシンセ信号のリスト
ne: बस आगतमा प्रयोग गर्न उपलब्ध सिन्थेसिस सङ्केतहरूको सूची

source: List of available waves to choose a track instrument from
fr: Liste des sons disponibles pour le choix d'une piste d'instrument
it: Elenco dei file wave disponibili da scegliere per la traccia selezionata
ja: トラックインスゥルメントとして選択する、利用可能な波形のリスト
ne: यसबाट तरङ्गको सूची रोज्न उपलब्ध एउटा ट्रयाक बाजा

source: List of available waves to choose as oscillator source
fr: Liste des sons disponibles pour le choix d'une source d'oscillateur
it: Lista delle forme d'onda disponibili da scegliere come sorgente oscillatrice
ja: 発振器ソースとして選択する、利用可能な波形のリスト
ne: ओस्सिलेटर स्रोतको रूपमा रोज्न उपलब्ध तरङ्गको सूची

source: List of available waves to choose as track instrument
fr: Liste des sons disponibles à choisir en tant que piste d'instrument
it: Lista dei wave disponibili per sceglierli come traccia di uno strumento
ja: トラックインスゥルメントとして選択する、利用可能な波形のリスト
ne: ट्र्याक बाजा रोज्न उपलब्ध तरङ्गको सूची

source: Load
fr: Charger
it: Carica
ja: 読み込み
ne: लोड गर्नुहोस्

source: Load Effect
fr: Charger un effet
it: Carica Effetto
ja: エフェクトを読み込み
ne: लोड प्रभाव

source: Load Instrument
fr: Charger un instrument
it: Carica Strumento
ja: インストゥルメントを読み込み
ne: बाजा लोड गर्नुहोस्

source: Load Key Binding
fr: Charge une combinaison de touche
it: Carica combinazione di tasti
ja: ショートカットを読み込み
ne: कुञ्जी बाइन्डिङ लोड गर्नुहोस्

source: Load Wave
fr: Charger un son
it: Carica Wave
ja: WAVE を読み込み
ne: तरङ लोड गर्नुहोस्

source: Load _Effect...
fr: Charger un _effet...
it: Carica _Effetto...
ne: लोड प्रभाव...

source: Load _Instrument...
fr: Charger un _instrument...
it: Carica Strumento...
ne: बाजा लोड गर्नुहोस्...

source: Load a key binding set
fr: Charge un jeu de combinaisons de touches
it: Carica una combinazione predefinita
ja: ショートカットセットを読み込み
ne: कुञ्जी बाइन्डिङ सेट लोड गर्नुहोस्

source: Load a new wave file from disk
fr: Charge une nouveau fichier de son à partir du disque
it: Carica un nuovo file wave dal disco
ja: 新しい wave ファイルをディスクから読み込み
ne: डिस्कबाट नयाँ वेभ फाइल लोड गर्नुहोस्

source: Load a new wave file from library paths
fr: Charge un nouveau fichier de son à partir des bibliothèques
it: Carica un nuovo file wave dal percorso delle librerie
ja: 新しい wave ファイルをライブラリパスから読み込み
ne: लाइब्रेरी बाटोबाट एउटा नयाँ वेभ फाइल लोड गर्नुहोस्

source: Load synthesizer mesh from effects folder
fr: Charge une trame de synthèse à partir du dossier des effets
it: Carica una rete sintetizzatrice dalla cartella degli effetti
ja: エフェクトフォルダからシンセサイザメッシュを読み込み
ne: सिन्थेसाइजर मेस प्रभाव फोल्डरबाट लोड गर्नुहोस्

source: Load synthesizer mesh from instruments folder
fr: Charge une trame de synthèse à partir du dossier des instruments
it: Carica una rete sintetizzatrice dalla cartella degli strumenti
ja: インストゥルメントフォルダからシンセサイザメッシュを読み込み
ne: सिन्थेसाइजर मेस बाजा फोल्डरबाट लोड गर्नुहोस्

source: Load...
fr: Charger...
it: Carica...
ja: 読み込み...
ne: लोड गर्नुहोस्...

source: Loading "%s"
fr: Chargement de « %s »
it: Caricamento "%s"
ja: "%s" を読み込み中
ne: "%s" लोड हुँदैछ

source: Loading skin `%s'
fr: Chargement du thème « %s »
it: Caricamento interfaccia `%s'
ja: スキン `%s' を読み込み
ne: `%s' स्किन लोड हुँदैछ

source: Loading wave `%s'
fr: Chargement du son : « %s »
it: Caricamento wave `%s'
ja: WAVE '%s' を読み込み中
ne: तरङ `%s' लोड हुँदैछ

source: Loading...
fr: Chargement...
it: Caricamento...
ja: 読み込み中...
ne: लोड हुँदैछ...

source: Location
fr: Emplacement
it: Locazione
ja: 場所
ne: स्थान

source: Looping
fr: Boucles
ja: ループ
ne: लूप

source: Lost Event
fr: Événement perdu
it: Evento Perso
ja: イベントがみつかりません
ne: घटना हरायो

source: Lost Note
fr: Note perdue
it: Nota Persa
ja: ノートがありません
ne: द्रष्टव्य हरायो

source: Lost Part
fr: Mesure perdue
it: Parte Persa
ja: パートがありません
ne: अंश हरायो

source: Lower
fr: Descendre
it: Sposta giù
ja: 下へ
ne: घटाउनुहोस्

source: Lower the currently selected key binding, relative to its neighbours
fr: Descend la combinaison de touches actuellement sélectionnée par rapport à ses voisines.
it: Sposta verso il basso di una posizione la combinazione selezionata
ja: 選択したショートカットを下へ移動
ne: छिमेकसँग सम्बन्धित हालमा छानिएको कुञ्जी बाइन्डिङ घटाउनुहोस्

source: Lowpass [Hz]
fr: Passe-bas [Hz]
it: PassaBasso [Hz]
ja: 低周波数パス [Hz]
ne: लोपास [Hz]

source: Lowpass filter frequency for the control signal
fr: Fréquence du filtre passe-bas pour le contrôle du signal
it: Frequenza del filtro PassaBasso per il segnale di controllo
ja: コントロール信号の低周波数パスフィルタ周波数
ne: नियन्त्रण सङ्केतका लागि लोपास फिल्टर आवृति

source: MIDI Channel
fr: Canal MIDI
it: Canale MIDI
ja: MIDI チャネル
ne: मिडि च्यानल

source: MIDI Instrument
fr: Instrument MIDI
it: Strumento MIDI
ja: MIDI インストゥルメント
ne: मिडि बाजा

source: MIDI Signal 1
fr: Signal MIDI 1
it: Segnale MIDI 1
ja: MIDI 信号 1
ne: मिडि सङ्केत १

source: MIDI Signal 2
fr: Signal MIDI 2
it: Segnale MIDI 2
ja: MIDI 信号 2
ne: मिडि सङ्केत २

source: MIDI Signal 3
fr: Signal MIDI 3
it: Segnale MIDI 3
ja: MIDI 信号 3
ne: मिडि सङ्केत ३

source: MIDI Signal 4
fr: Signal MIDI 4
it: Segnale MIDI 4
ja: MIDI 信号 4
ne: मिडि सङ्केत ४

source: MIDI Synthesizer: %s
fr: Synthétiseur MIDI : %s
it: Sintetizzatore MIDI: %s
ja: MIDI シンセサイザ: %s
ne: MIDI सिन्थेसाइजर: %s

source: MIDI Tracker, Music Composition and Modular Synthesis Application
fr: MIDI Tracker, application de composition musicale et synthèse modulaire
it: MIDI Tracker, Composizione Musica e Applicazione di Sintesi Modulare
ja: MIDI トラッカー、音楽編集そしてモジュールシンセサイザアプリケーション
ne: मिडि ट्र्याकर, सङ्गीत रचना र मोड्युलर सिन्थेसिस अनुप्रयोग

source: MODIFIERS:
fr: MODIFICATEURS :
it: MODIFICATORI:
ja: モディファイア:
ne: परिमार्जनकर्ता:

source: Manual trigger for the drum
fr: Déclencheur manuel pour la batterie
it: Trigger manuale per la batteria

source: Master
fr: Maître
ne: मास्टर

source: Master Output
fr: Sortie principale
it: Uscita Master
ja: 主出力
ne: मास्टर निर्गत

source: Master Volume
fr: Volume maître
it: Volume Master
ja: 主音量
ne: मास्टर भोल्युम

source: Master [%]
fr: Maître [%]
ne: मास्टर [%]

source: Master [dB]
fr: Maître [dB]
ne: मास्टर [dB]

source: Master [float]
fr: Maître [réel]
ne: मास्टर [फ्लोट]

source: Max Voices
fr: Voix max
it: Massimo numero voci
ne: म्याक्स स्वर

source: Maximum number of voices for simultaneous playback
fr: Nombre maximum de voix pour une exécution simultanée
it: Massimo numero di voci per la riproduzione simultanea
ja: 同時再生する最大音声数
ne: समकालिन प्लेब्याकका लागि आवाजको अधिकतम सङ्ख्या

source: Measure denominator, must be a power of 2
fr: Dénominateur du tempo des mesures, doit être une puissance de 2
it: Misura del denominatore. Deve essere una potenza di 2
ne: हर नाप्नुहोस्, यसको पावर २ हुनुपर्दछ

source: Measure numerator
fr: Numérateur du tempo des mesures
it: Misura numeratore
ne: गणक नाप्नुहोस्

source: Merge an existing project into the current project
fr: Fusionne un projet existant au projet actuel
it: Inserisci un progetto esistente nel progetto corrente
ja: 既存のプロジェクトを現在のプロジェクトに統合
ne: हालको परियोजनामा अवस्थित परियोजना गाभ्नुहोस्

source: Merge: %s
fr: Fusionner : %s
it: Fondi: %s
ja: 統合: %s
ne: गाभ्नुहोस्: %s

source: Merging effect `%s'
fr: Fusionner l'effet « %s »
it: Fusione effetto `%s'
ja: エフェクト '%s' を統合中
ne: प्रभाव `%s' गाभ्दैछ

source: Merging instrument `%s'
fr: Fusionner l'instrument « %s »
it: Fusione Strumento `%s'
ja: インストゥルメント '%s' を統合中
ne: बाजा `%s' गाभ्दैछ

source: Merging project `%s'
fr: Fusion du projet « %s »
it: Fusione progetto `%s'
ja: プロジェクト '%s' を統合中
ne: `%s' परियोजना गाभ्दैछ

source: Message Type
fr: Type de message
it: Tipo di Messaggio
ja: メッセージタイプ
ne: सन्देश प्रकार

source: Message has been repeated %u time
fr: Le message a été répété %u fois
it: Messaggio ripetuto un numero di volte pari a %u
ja: メッセージは %u 回繰り返されました
ne: सन्देश %u पटक दोहोरियो

source: Message has been repeated %u times
fr: Le message a été répété %u fois
it: Messaggio ripetuto un numero di volte pari a %u
ja: メッセージは %u 回繰り返されました
ne: सन्देश %u पटक दोहोरियो

source: Metallic Factor [%]
fr: Facteur métallique [%]
it: Fattore Metallico [%]

source: Metallicness of the string
fr: Métallique de la corde

source: Middle Bar Color
fr: Couleur de la ligne intermédiaire
it: Colore Linea Centrale
ja: 中央バーの色
ne: मध्य पट्टी रङ

source: Midi channel assigned to this track, 0 uses internal per-track channel
fr: Canal MIDI assigné à cette piste ; 0 utilise un canal interne par piste
ne: यो ट्र्याकका लागि मिडि च्यानलको मानाङ्कन गर्नुहोस्, ० ले अवधि प्रति ट्र्याक च्यानल प्रयोग गर्दछ

source: Midi channel assigned to this track, 0 uses private per-track channel
fr: Canal MIDI assigné à cette piste, 0 utilise un canal privé par piste
ja: このトラック 0 に割当てられている MIDI チャネルはプライベートパートラックチャネルを使っています
ne: यो ट्र्याकमा मिडि च्यानल मानाङ्कन गरियो, प्रति ट्रयाक ० प्रयोग गर्दछ

source: Mix track outputs, adjust volume and add effects
fr: Mélange les pistes en sortie, ajuste le volume et ajoute des effets
it: Miscela le tracce di uscita, regola il volume e aggiungi effetti
ja: トラック出力を mix、音量を調整してエフェクトを加える
ne: ट्र्याक आगतहरूको मिश्रण गर्नुहोस्, ध्वनि मिलाएर प्रभाव थप्नुहोस्

source: Mixed audio output
fr: Sortie audio mixée
it: Uscita audio miscelata
ja: ミックスされたオーディオ出力
ne: मिश्रित अडियो निर्गत

source: Mixer
fr: Table de mixage
ja: ミキサー
ne: मिक्सर

source: Mixer busses connected to track output
fr: Bus de la table de mixage connectés à la sortie de la piste
it: Bus del Mixer connesso alla traccia d'uscita
ja: トラック出力に接続するミキサーバス
ne: मिश्रण बसहरू ट्र्याक आगतका लागि जडान गरियो

source: Mixer busses used as output for synthesis signals
fr: Table de mixage des bus utilisés en tant que sortie pour les signaux synthétisés
it: Bus del mixer usati come uscite per i segnali di sintesi
ja: シンセ信号の出力として使われるミキサーバス
ne: सिन्थेसिस सङ्केतका लागि आगतको मिश्रण बस

source: Mixer busses used as output for this track
fr: Bus de mixage utilisés en tant que sortie pour cette piste
it: Bus del mixer usati come uscite per questa traccia
ne: यो ट्र्याकका लागि निर्गतको रूपमा प्रयोग गरिने मिश्रण बस

source: Mnemonic key
fr: Touche mnémonique
it: Chiave Mnemonica
ja: ニーモニックキー
ne: एम्नेमोनिक कुञ्जी

source: Mnemonic widget
fr: Mnémonique de widget
it: Oggetto Mnemonico
ja: 記憶ウィジェット
ne: एम्नेमोनिक विजेट

source: Modulation Depth
fr: Profondeur de modulation
it: Profondità della modulazione
ja: 変調深度
ne: मोडुलेसन गहिराइ

source: Modulation Input
fr: Entrée de modulation
it: Modulazione d'Ingresso
ja: 変調入力
ne: मोड्युलेसन आगत

source: Modulation Strength for linear frequency modulation
fr: Intensité de modulation pour une modulation de fréquence linéaire
it: Intensità Modulazione per la modulazione di frequenza lineare
ja: 線形周波数変調の変調強度
ne: रेखा आवृति मोड्युलेसनका लागि मोड्युलेसन बल

source: Module Info
fr: Informations sur le module
it: Informazioni Modulo
ja: モジュール情報
ne: मोड्युल सूचना

source: Module Link:
fr: Lien vers le module :
it: Collegamento Modulo:
ja: モジュールリンク:
ne: मोड्युल लिङ्क:

source: Module link
fr: Lien vers le module
it: Collegamento modulo
ja: モジュールリンク
ne: मोड्युल लिङ्क

source: Move Control Event
fr: Déplacer l'événement de contrôle
it: Sposta Controllo Evento
ja: コントロールイベントを移動
ne: नियन्त्रण घटना सार्नुहोस्

source: Move Note
fr: Déplacer une note
it: Sposta Nota
ja: ノートを移動
ne: द्रष्टव्य सार्नुहोस्

source: Move Part
fr: Déplacer la mesure
it: Sposta Parte
ja: パートを移動
ne: अंश सार्नुहोस्

source: Move downwards
fr: Déplacer vers le bas
it: Sposta in basso
ja: 下へ移動
ne: तलतिर सार्नुहोस्

source: Move focus cell downwards
fr: Déplace le focus dans la cellule du dessous
it: Sposta il focus sulla cella inferiore
ja: 下のセルにフォーカス
ne: फोकस कक्ष तलतिर सार्नुहोस्

source: Move focus cell downwards page-wise
fr: Déplace le focus d'une page vers le bas
ja: ページ下方向のセルにフォーカス
ne: फोकस कक्ष तल पृष्ठ-हुँदै सार्नुहोस्

source: Move focus cell to the left
fr: Déplace le focus dans la cellule de gauche
it: Sposta il focus sulla cella a sinistra
ja: 左のセルにフォーカス
ne: फोकस कक्ष बायाँतिर सार्नुहोस्

source: Move focus cell to the left page-wise
fr: Déplace le focus d'une page vers la gauche
ja: ページ左方向のセルにフォーカス
ne: फोकस कक्ष बायाँ पृष्ठ-हुँदै सार्नुहोस्

source: Move focus cell to the right
fr: Déplace le focus dans la cellule de droite
it: Sposta il focus sulla cella a destra
ja: 右のセルにフォーカス
ne: फोकस कक्ष दायाँतिर सार्नुहोस्

source: Move focus cell to the right page-wise
fr: Déplace le focus d'une page vers la droite
ja: ページ右方向のセルにフォーカス
ne: फोकस कक्ष दायाँ पृष्ठ-हुँदै सार्नुहोस्

source: Move focus cell upwards
fr: Déplace le focus dans la cellule du dessus
it: Sposta il focus sulla cella superiore
ja: 上のセルにフォーカス
ne: फोकस कक्ष माथितिर सार्नुहोस्

source: Move focus cell upwards page-wise
fr: Déplace le focus d'une page vers le haut
ja: ページ上方向のセルにフォーカス
ne: फोकस कक्ष माथि पृष्ठ-हुँदै सार्नुहोस्

source: Move focus to the next cell (up/left/right/down according to configuration)
fr: Déplace le focus à la cellule suivante (au dessus/à gauche/à droite/en bas selon la configuration)
it: Sposta il focus alla cella successiva (sopra/sinistra/destra/sotto in funzione della configurazione)
ja: 次のセルにフォーカス(上下左右: 設定による)
ne: फोकसलाई पछिल्लो कक्षमा सार्नुहोस् (कन्फिगरेसन अनुसार माथी/दायाँ/तल)

source: Move the current selection into clipboard
fr: Déplace la sélection en cours dans le presse-papiers
it: Sposta la selezione corrente negli appunti
ja: 選択領域をクリップボードに移動
ne: हालको चयन क्लिपबोर्डमा सार्नुहोस्

source: Move the selection down by one position
fr: Descendre la sélection d'une case
it: Sposta la selezione corrente di una posizione in basso
ja: 選択領域を一つ分だけ位置を下に移動
ne: चयनलाई एक स्थान तल सार्नुहोस्

source: Move the selection up by one position
fr: Monter la sélection d'une case
it: Sposta la selezione corrente su di una posizione
ja: 選択領域を一つ分だけ位置を上に移動
ne: चयनलाई एक स्थान माथी सार्नुहोस्

source: Move to the left
fr: Déplacer vers la gauche
it: Sposta a Sinistra
ja: 左へ移動
ne: बायाँतिर सार्नुहोस्

source: Move to the right
fr: Déplacer vers la droite
it: Sposta a Destra
ja: 右へ移動
ne: दायाँतिर सार्नुहोस्

source: Move upwards
fr: Déplacer vers le haut
it: Sposta in alto
ja: 上へ移動
ne: माथितिर सार्नुहोस्

source: Multiply Controls
fr: Contrôles multiplicatifs
it: Controlli Multipli
ja: コントロールを掛け合せ
ne: गुणन नियन्त्रण

source: Music Composer
fr: Compositeur de musique
ja: 音楽編集
ne: सङ्गीत रचनाकार

source: Musical Tuning
fr: Accord musical

source: Mute
fr: Muet
it: Silenzia
ja: ミュート
ne: मौन

source: Mute: turn off the bus volume
fr: Muet : coupe le volume du bus
it: Silenzia: azzera il volume del bus
ja: ミュート: バス音量を切る
ne: मौन: बसको भोल्युम बन्द गर्नुहोस्

source: Muted
fr: Rendu muet
it: Silenziato
ja: ミュート
ne: मौन गराइएको

source: Name
fr: Nom
it: Nome
ja: 名前
ne: नाम

source: Name for the current skin configuration (used for skin selections).
fr: Nom de la configuration du thème d'apparence actuel (utilisé pour le choix de l'apparence).
it: Nome per la corrente configurazione dell'interfaccia (usato per la selezione delle medesime)
ja: 今のスキン設定の名前(スキン選択時に利用)
ne: हालको स्किन कन्फिगरेसनका लागि नाम (स्किन चयनका लागि प्रयोग गरिने)

source: Name of the WAVE file used for recording BSE sound output
fr: Nom du fichier WAVE utilisé pour enregistrer la sortie son BSE
ja: BSE 音声出力を録音する WAVE ファイル名
ne: BSE ध्वनि निर्गत रेकर्ड गर्न प्रयोग गरिने वेभ फाइलको नाम

source: Negative Value Color
fr: Couleur d'une valeur négative
it: Valore Colore Negativo
ja: 負の値の色
ne: नकरात्मक मान रङ

source: New Song
fr: Nouvelle mélodie
it: Nuova Canzone
ja: 新しい曲
ne: नयाँ गीत

source: New View
fr: Nouvelle vue
it: Nuova Vista
ja: 新しいビュー
ne: नयाँ दृश्य

source: No Part
fr: Aucune mesure
it: Nessuna Parte
ja: パートなし
ne: अंश छैन

source: No Track
fr: Aucune piste
it: Nessuna Traccia
ja: トラックなし
ne: ट्र्याक छैन

source: No available MIDI device could be found and opened successfully. Reverting to null device, no MIDI events will be received or sent.
fr: Aucun périphérique MIDI disponible ne peut être trouvé et ouvert avec succès. Renvoi vers le périphérique NULL, aucun événement MIDI ne sera reçu ou envoyé.
it: Nessun dispositivo MIDI è stato aperto e/o trovato nel tuo hardware. Regressione in corso al device 'null'; nessun evento MIDI sarà ricevuto e/o trasmesso.
ne: उपलब्ध मिडि यन्त्रहरू सफलतापूर्वक फेला पारेर खोल्न सकेन । शून्य यन्त्र पुन: प्राप्त गर्दैछ, मिडि घटनाहरू पाइएन वा पठाइएको छैन ।

source: No available audio device could be found and opened successfully. Sorry, no fallback selection can be made for audio devices, giving up.
fr: Aucun périphérique audio disponible n'a été trouvé et ouvert avec succès. Désolé, il n'y a pas de possibilité de repli pour les périphériques audio : abandon.
ne: उपलब्ध अडियो यन्त्र सफलतापूर्वक फेला पारेर खोल्न सकेन । माफ गर्नुहोस्, अडियो यन्त्रका लागि फलब्याक चयन बनाउन सकिँदैन, छोड्दैछ ।

source: No available audio device was found.
fr: Aucun périphérique audio disponible n'a été trouvé.
it: Nessun dispositivo audio è stato trovato.
ne: उपलब्ध अडियो यन्त्र फेला परेन

source: No data available
fr: Pas de données disponibles
it: Nessun dato disponibile
ne: डेटा उपलब्ध छैन

source: No device (driver) available
fr: Pas périphérique (pilote) accessible
it: Nessun dispositivo (driver) disponibile
ja: デバイス(ドライバ)が利用できません
ne: यन्त्र (ड्राइभर) उपलब्ध भएन

source: No quantization selected
fr: Pas de calage temporel défini
it: Nessuna quantizzazione selezionata
ja: 量子化範囲が選択されていません
ne: कुनै परिमाणात्मक चयन गरिएको छैन

source: No space left on device
fr: Il ne reste plus de place sur le périphérique
it: Non c'è spazio disponibile sul dispositivo
ne: यन्त्रमा ठाउँ छैन

source: No such entry
fr: Aucune entrée de ce type
it: Nessun elemento inserito
ja: そのようなエントリはありません
ne: त्यस्तो प्रविष्टि छैन

source: No such event
fr: Aucun événement de ce type
it: Nessun evento
ja: そのようなイベントはありません
ne: त्यस्तो घटना छैन

source: No such file, device or directory
fr: Aucun fichier, périphérique ou dossier sous ce nom
it: Nessun file, cartella o dispositivo
ne: फाइल, यन्त्र वा डाइरेक्टरी छैन

source: No such input channel
fr: Pas de canal d'entrée de ce type
it: Nessun canale d'ingresso
ja: そのような入力チャネルはありません
ne: त्यस्तो आगत च्यानल छैन

source: No such output channel
fr: Pas de canal de sortie de ce type
it: Nessun canale d'uscita
ja: そのような出力チャネルはありません
ne: त्यस्तो आगत च्यानल छैन

source: No such procedure
fr: Procédure inexistante
it: Nessuna procedura
ja: そのようなプロセスはありません
ne: त्यस्तो कार्यविधि छैन

source: No such synthesis module
fr: Aucun module de synthèse de ce type
it: Nessun modulo di sintesi
ja: そのようなシンセモジュールはありません
ne: त्यस्तो सिन्थेसिस मोड्युल छैन

source: No such wave
fr: Aucun son de ce type
it: Nessun file wave
ne: तरङ छैन

source: No target
fr: Aucune cible
it: Nessun Obiettivo
ja: ターゲットがありません
ne: लक्ष्य छैन

source: Noise Out
fr: Bruit Out
it: Usc.Rumore
ja: ノイズ出力
ne: हल्ला निर्गत

source: Noise Output
fr: Sortie du bruit
it: Uscita Rumore
ja: ノイズ出力
ne: हल्ला निर्गत

source: Noise is a generator of (supposedly) white noise
fr: Le bruit est issu d'un générateur de bruit (supposé) blanc
it: Il rumore è un generatore (presunto) di rumore bianco
ne: सेतो हल्ला (अनुमानित) को जेनरेटर हल्ला हो

source: Non-Registered Parameter
fr: Paramètre non enregistré
it: Parametro Non Registrato
ja: 未登録のパラメータ
ne: दर्ता नगिएको परामिति

source: None
fr: Aucun
it: Niente
ja: なし
ne: कुनै पनि होइन

source: Norm Type
fr: Type de normalisation
ja: 基準タイプ
ne: नर्म प्रकार

source: Note Decay
fr: Extinction de la note

source: Note Entry
fr: Saisie d'une note
it: Inserisci Nota
ja: ノートエントリ
ne: द्रष्टब्य प्रविष्टि

source: Note Fine Tune
fr: Accord fin de la note
it: Regolazione Puntuale Nota
ja: ノート微細調整
ne: द्रष्टव्य राम्रो धून

source: Note Frequency
fr: Fréquence de la note
it: Frequenza Nota
ja: ノート周波数
ne: द्रष्टव्य आवृति

source: Note Sequence Grid Editor
fr: Grille d'édition d'une suite de notes
it: Sequenza note nella griglia dell'editor
ja: ノートシーケンスグリッドエディタ
ne: द्रष्टब्य अनुक्रम ग्रिड सम्पादक

source: Note Sync
fr: Sync Note
it: Sync Note
ja: ノート同期
ne: द्रष्टव्य सिन्क

source: Note Sync Signal
fr: Signal de synchronisation de la note
it: Segnale Sync Note
ja: ノート同期信号
ne: द्रष्टव्य सिन्क सङ्केत

source: Note Velocity
fr: Dynamique des notes
ja: ノートヴェロシティ
ne: द्रष्टव्य वेग
