Repository: tim-janik/beast
Catalog: po/*.po
Languages: fr, it, ja, ne

source: BseBalance is a stereo panning module with two audio and two control inputs, each of which can be seperately level adjusted. The resulting output balance is controlled by a balance adjustment and the sum of the control inputs. To avoid aliasing artefacts for rapid balance changes, the control signal is preprocessed by a simple lowpass filter with adjustable cutoff frequency.
fr: BseBalance est un module de panoramique stéréo avec deux entrées audio et deux entrées de contrôle, le niveau de chacune d'entre elles pouvant être ajusté séparément. La balance du résultat en sortie est contrôlée par un ajustement de la balance et de la somme des entrées de contrôle. Pour éviter des crénelages sonores artificiels lors des changements rapide de balance, le signal de contrôle est pré-traité par un simple filtre passe-bas avec une fréquence de coupure ajustable.
ja: BseBalance は二つのオーディオ/コントロール入力(各々個別にレベル調整されます)に対するステレオパンモジュールです。結果出力バランスはバランス調整とコントロール入力の合計でコントロールされます。高速なバランス変化に対するエイリアスアーチフェクトを避けるためにコントロール信号は周波数カットオフ調整付きの単純な低周波フィルタによって前処理されます。
ne: बिस ब्यालेन्ससँग दुई अडियो र दुई नियन्त्रण आगत स्टेरियो योजना मोड्युल हो, मध्ये तह समायोजनबाट छुट्टयाइन्छ । सन्तुलन समायोजन र नियन्त्रण आगतहरूको जम्माद्धारा परिणाम निर्गत सन्तुलन नियन्त्रिण हुन्छ। एलियसिङ आर्टेफ्याक्ट्स र्यापिड सन्तुलन परिवर्तन हटाउनका लागि, नियन्त्रण सङ्केत पूर्व प्रोसेस्ड साधारण लोपास फिल्टरसँगै समायोजन काटिएको आवृतिसँँ गहुन् छ।

source: Bus Name
fr: Nom du bus
it: Nome Bus
ja: バス名
ne: बस नाम

source: Bus implementation for songs, used to route track audio signals to the master output.
fr: Implémentation du bus pour les mélodies, utilisée pour diriger les signaux des pistes audio vers la sortie maître.
it: Implementazione bus per le canzoni; viene usato per instradare le tracce audio del segnale all'uscita master.
ja: 主出力にトラックオーディオ信号をルーティングするのに使用する、曲のバス実装
ne: गीतका लागि बस कार्यान्वयन, मास्टर प्रतिफलमा ट्रयाक अडियो सङ्केत राउट गर्न प्रयोग हुन्छ

source: Busses
fr: Bus
it: Bus
ja: バス
ne: बस

source: CODEC failure
fr: Échec du CODEC
it: Errore CODEC
ne: कोडेक असफल

source: COLUMN TYPES:
fr: TYPES DE COLONNES :
it: TIPI DI COLONNE:
ja: カラムタイプ:
ne: स्तम्भ प्रकार:

source: CPU the thread is currently running on
fr: CPU sur laquelle la tâche est en train de s'exécuter
it: CPU il thread è correntemente attivo
ja: スレッドの実行されている CPU
ne: CPU थ्रेड हाल चलिरहेको छ

source: CPU#
fr: N° de CPU

source: Cancel
fr: Annuler
it: Cancella
ne: रद्द गर्नुहोस्

source: Center Frequency
fr: Fréquence centrale
it: Frequenza Centrale
ja: 中央周波数
ne: केन्द्र आवृती

source: Center Frequency Input
fr: Entrée de la fréquence médiane
it: Ingresso Frequenza Centrale
ja: 中央周波数入力
ne: केन्द्र आवृति आगत

source: Change the base octave by a given amount
fr: Modifie l'octave de base d'une quantité donnée
it: Cambia l'ottava base di un dato ammontare
ja: 指定した分基音を変更
ne: दिइएको रकमबाट ओक्टेभको आधार परिवर्तन गर्नुहोस्

source: Change the currently selected key binding
fr: Modifie la combinaison de touches actuellement sélectionnée
it: Cambia la combinazione dei tasti per la funzione selezionata
ja: 選択したショートカットを変更
ne: हालै चयन गरिएको कुञ्जी बाइन्डिङ परिवर्तन गर्नुहोस्

source: Change the numeric focus cell contents (e.g. octave) by a given amount
fr: Modifie d'une quantité donnée le contenu (par ex. l'octave) numérique de la cellule ayant le focus
it: Cambia il contenuto numerico (ad esempio l'ottava) di una cella dove è attivo il focus.
ja: 指定した分フォーカスセルの内容(例. オクターブ)を変更
ne: दिइएको रकमबाट सङ्ख्यात्मक फोकस कक्ष सामाग्री परिवर्तन गर्नुहोस् (उदाहरण. ओक्टेभ)

source: Change...
fr: Changement...
it: Cambia...
ja: 変更...
ne: परिवर्तन गर्नुहोस्...

source: Changes were made to project "%s" since the last time it was saved to disk.
fr: Des modifications ont été apportées au projet « %s » depuis son précédent enregistrement sur disque.
it: Sono stati effettuati dei cambi al progetto "%s" rispetto a quando è stato salvato su disco.
ne: अन्तिम समयमा यसलाई डिस्कमा बचत गरे देखी परियोजना "%s" मा परिवर्तनहरू गरिएका छन्।

source: Channel
fr: Canal
it: Canale
ne: च्यानल

source: Channel Hints
fr: Nom des canaux
it: Suggerimenti Canali
ja: チャネルヒント
ne: च्यानल सङ्केत

source: Channel Pressure
fr: Pression du canal
ja: チャネル圧力
ne: च्यानल दवाब

source: Channel%u
fr: Canal%u
it: Canale%u
ja: チャネル%u
ne: च्यानल %u

source: Channel%u [%%]
fr: Canal%u [%%]
it: Canale%u [%%]
ja: チャネル%u [%%]
ne: च्यानल %u [%%]

source: Channel%u [dB]
fr: Canal%u [dB]
it: Canale%u [dB]
ja: チャネル%u [dB]
ne: च्यानल %u [dB]

source: Channel%u [float]
fr: Canal%u [réel]
it: Canale%u [float]
ja: チャネル%u [浮動小数]
ne: च्यानल %u [फ्लोट]

source: Check/ToggleRadio Button
fr: Bouton radio/case à cocher
it: Verifica/Pulsante Radio Button
ne: जाँच्नुहोस्/रेडियो बटन टगल गर्नुहोस्

source: Choose display scrolling direction
fr: Choix du sens de déroulement de l'affichage
it: Scegli direzione dello scrolling
ja: 表示スクロール方向の選択
ne: प्रदर्शन स्क्रोलिङ दिशा रोज्नुहोस्

source: Choose horizontal or vertical orientation
fr: Choisir une orientation horizontale ou verticale
it: Scegli una direzione orizzontale o verticale
ja: 水平または垂直方向を選択
ne: तेर्सो वा ठाडो अभिमुखीकरण चयन गर्नुहोस्

source: Chorus audio output
fr: Sortie audio chorus
it: Uscita audio Chorus
ja: コーラスオーディオ出力
ne: कोरस अडियो निर्गत

source: Clear
fr: Effacer
it: Pulisci
ja: クリア
ne: खाली गर्नुहोस्

source: Clear the current selection
fr: Effacer la sélection courante
it: Pulisci la selezione corrente
ja: 選択をクリア
ne: हालको चयन खाली गर्नुहोस्

source: Close %s
fr: Ferme %s
it: Chiudi %s
ne: %s बन्द गर्नुहोस्

source: Close all windows and quit
fr: Ferme toutes les fenêtres et quitte
it: Chiude tutte le finestre e esce
ja: すべてのウィンドウを閉じて終了
ne: सबै सञ्झ्याल बन्द गर्नुहोस् र अन्त्य गर्नुहोस्

source: Close the project
fr: Ferme le projet
it: Chiudi il progetto
ja: プロジェクトを閉じる
ne: परियोजना बन्द गर्नुहोस्

source: Color Entry
fr: Saisie d'une couleur
it: Scegli Colore
ja: 色エントリ
ne: रङ प्रविष्टि

source: Comment
fr: Commentaire
it: Commento
ja: コメント
ne: टिप्पणी

source: Compressed audio output 1
fr: Sortie audio comprimée 1
it: Uscita Audio compressa 1
ne: कम्प्रेस्ड अडियो आगत १

source: Compressed audio output 2
fr: Sortie audio comprimée 2
it: Uscita Audio compressa 2
ne: कम्प्रेस्ड अडियो आगत २

source: Configure
fr: Configurer
it: Configura
ja: 設定
ne: कन्फिगर गर्नुहोस्

source: Configure the column layout of the pattern editor
fr: Configure la disposition de colonne de l'éditeur de motifs
it: Configura l'aspetto delle colonne dell'editor di pattern
ja: パターンエディタのカラム配置を設定
ne: बाँन्की सम्पादकको स्तम्भ सजावट कन्फिगर गर्नुहोस्

source: Constant CENTER
fr: Constante MÉDIUM
it: Costante CENTER
ja: 一定(中)
ne: अचल केन्द्र

source: Constant HIGH
fr: Constante AIGUS
it: Costante HIGH
ja: 一定(高)
ne: अचल उच्च

source: Constant LOW
fr: Constante BASSES
it: Costante LOW
ja: 一定(低)
ne: अचल तल्लो

source: Constant Negative CENTER
fr: Constante négative MÉDIUM
it: Costante Negativa CENTER
ne: अचल नकरात्मक केन्द्र

source: Constant Negative HIGH
fr: Constante négative AIGUS
it: Costante Negativa HIGH
ne: अचल नकरात्मक उच्च

source: Constant Output %u
fr: Sortie constante %u
it: Costante d'Uscita %u
ja: 一定出力 %u
ne: अचल प्रतिफल %u

source: Constant signal value
fr: Valeur du signal constant
it: Valore segnale costante

source: Constant signal value as note, converted to Hertz according to the current musical tuning
fr: Valeur du signal constant sous forme de note, convertie en Hertz selon la tonalité musicale retenue

source: Constant signal value interpreted as frequency value in Hertz
fr: Valeur du signal constant sous forme de fréquence en Hertz
it: Il valore del segnale costante è interpretato come valore di frequenza in Hertz

source: Contents
fr: Sommaire
it: Contenuti
ja: 内容
ne: सामग्री

source: Continuous 14
fr: Continuo 14
it: Continuo 14
ne: लगातार १४

source: Continuous 15
fr: Continuo 15
it: Continuo 15
ne: लगातार १५

source: Continuous 20
fr: Continuo 20
it: Continuo 20
ne: लगातार २०

source: Continuous 21
fr: Continuo 21
it: Continuo 21
ne: लगातार २१

source: Continuous 22
fr: Continuo 22
it: Continuo 22
ne: लगातार २२

source: Continuous 23
fr: Continuo 23
it: Continuo 23
ne: लगातार २३

source: Continuous 24
fr: Continuo 24
it: Continuo 24
ne: लगातार २४

source: Continuous 25
fr: Continuo 25
it: Continuo 25
ne: लगातार २५

source: Continuous 26
fr: Continuo 26
it: Continuo 26
ne: लगातार २६

source: Continuous 27
fr: Continuo 27
it: Continuo 27
ne: लगातार २७

source: Continuous 28
fr: Continuo 28
it: Continuo 28
ne: लगातार २८

source: Continuous 29
fr: Continuo 29
it: Continuo 29
ne: लगातार २९

source: Continuous 3
fr: Continuo 3
it: Continuo 3
ne: लगातार ३

source: Continuous 30
fr: Continuo 30
it: Continuo 30
ne: लगातार ३०

source: Continuous 31
fr: Continuo 31
it: Continuo 31
ne: लगातार ३१

source: Continuous 9
fr: Continuo 9
it: Continuo 9
ne: लगातार ९

source: Continuous MIDI Control #1 - Bank Select
fr: Contrôle MIDI continu n°1 — Sélection de banque
ja: 連続 MIDI コントロール #1 - バンク選択
ne: निरन्तर मिडि नियन्त्रण #1 - बैक चय

source: Contributions made by:
fr: Contributions de :
it: Sviluppatori e contributori al programma:
ja: 貢献した人々:
ne: योगदानकर्ता:

source: Control 0 Bank Select MSB
fr: Contrôle 0 Sélection de banque MSB
it: Controllo 0 Selezione Banco MSB
ja: コントロール 0 バンク選択 MSB
ne: नियन्त्रण ० बैंक छनोट MSB

source: Control 1 Modulation Depth MSB
fr: Contrôle 1 Profondeur de modulation MSB
it: Controllo 1 Profondità della modulazione MSB
ja: コントロール 1 変調深度 MSB
ne: नियन्त्रण १ मोडुलेसन गहिराइ MSB

source: Control 10 Panorama MSB
fr: Contrôle 10 Panoramique MSB
it: Controllo 10 Panorama MSB
ja: コントロール 10 パノラマ MSB
ne: नियन्त्रण १० पानोरामा MSB

source: Control 100 Registered Parameter MSB
fr: Contrôle 100 Paramètre enregistré MSB
it: Controllo 100 Parametro Registrato MSB
ja: コントロール 100 登録済みのパラメータ MSB
ne: नियन्त्रण १०० दर्ता भएको परामिति MSB

source: Control 101 Registered Parameter LSB
fr: Contrôle 101 Paramètre enregistré LSB
it: Controllo 101 Parametro Registrato LSB
ja: コントロール 101 登録済みのパラメータ LSB
ne: नियन्त्रण १०१ दर्ता भएको परामिति LSB

source: Control 11 Expression MSB
fr: Contrôle 11 Expression MSB
it: Controllo 11 Espressione MSB
ja: コントロール 11 エクスプレッション MSB
ne: नियन्त्रण ११ अभिव्यक्ति MSB

source: Control 12 Effect Control 1 MSB
fr: Contrôle 12 Contrôle de l'effet 1 MSB
it: Controllo 12 Controllo Effetto 1 MSB
ja: コントロール 12 エフェクトコントロール 1 MSB
ne: नियन्त्रण १२ प्रभाव नियन्त्रण १ MSB

source: Control 120 All Sound Off ITrigger
fr: Contrôle 120 ITrigger coupure de tous les sons
ja: コントロール 120 全サウンドオフ ITrigger
ne: नियन्त्रण १२० सबै आवाज बन्द आइ ट्रिग्गर

source: Control 121 All Controllers Off ITrigger
fr: Contrôle 121 ITrigger coupure de tous les contrôleurs
ja: コントロール 121 全コントローラオフ ITrigger
ne: नियन्त्रण १२१ सबै नियन्त्रक बन्द आइ ट्रिग्गर

source: Control 122 Local Control Switch
fr: Contrôle 122 Commutateur de contrôle local
it: Controllo 122 Interrutore Controllo Locale
ja: コントロール 122 ローカルコントロールスウィッチ
ne: नियन्त्रण १२२ स्थानीय नियन्त्रण स्विच

source: Control 123 All Notes Off ITrigger
fr: Contrôle 123 ITrigger coupure de toutes les notes
ja: コントロール 123 全ノートオフ ITrigger
ne: नियन्त्रण १२३ सबै द्रष्टव्यहरू बन्द आई ट्रिग्गर

source: Control 124 Omni Mode Off ITrigger
fr: Contrôle 124 ITrigger du mode Omni Off
ja: コントロール 124 オムニモードオフ ITrigger
ne: नियन्त्रण १२४ ओम्नि मोड बन्द आई ट्रिग्गर

source: Control 125 Omni Mode On ITrigger
fr: Contrôle 125 ITrigger du mode Omni On
ja: コントロール 125 オムニモードオン ITrigger
ne: नियन्त्रण १२५ ओम्नि मोड खुला आइ ट्रिग्गर

source: Control 126 Monophonic Voices Mode
fr: Contrôle 126 Mode voix monophoniques
it: Controllo 126 Modalità Voci Monofoniche
ja: コントロール 126 モノラル音声モード
ne: नियन्त्रण १२६ मोनोफोनिक स्वरको मोड

source: Control 127 Polyphonic Mode On ITrigger
fr: Contrôle 127 ITrigger mode polyphonique actif
it: Controllo 127 Modalità Polifonica On ITrigger
ja: コントロール 127 多声モードオン ITrigger
ne: नियन्त्रण १२७ पोलिफोनिक मोड खुला आइ ट्रिग्गर

source: Control 13 Effect Control 2 MSB
fr: Contrôle 13 Contrôle de l'effet 2 MSB
it: Controllo 13 Controllo Effetto 2 MSB
ja: コントロール 13 エフェクトコントロール 2 MSB
ne: नियन्त्रण १३ प्रभाव नियन्त्रण २ MSB

source: Control 16 General Purpose Controller 1 MSB
fr: Contrôle 16 Contrôleur d'usage général 1 MSB
it: Controllo 16 Controllo d'Uso Generale 1 MSB
ja: コントロール 16 汎用コントローラ 1 MSB
ne: नियन्त्रण १६ साधारण उद्देश्य नियन्त्रक १ MSB

source: Control 17 General Purpose Controller 2 MSB
fr: Contrôle 17 Contrôleur d'usage général 2 MSB
it: Controllo 17 Controllo d'Uso Generale 2 MSB
ja: コントロール 17 汎用コントローラ 2 MSB
ne: नियन्त्रण १७ साधारण उद्देश्य नियन्त्रक २ MSB

source: Control 18 General Purpose Controller 3 MSB
fr: Contrôle 18 Contrôleur d'usage général 3 MSB
it: Controllo 18 Controllo d'Uso Generale 3 MSB
ja: コントロール 18 汎用コントローラ 3 MSB
ne: नियन्त्रण १८ साधारण उद्देश्य नियन्त्रक ३ MSB

source: Control 19 General Purpose Controller 4 MSB
fr: Contrôle 19 Contrôleur d'usage général 4 MSB
it: Controllo 19 Controllo d'Uso Generale 4 MSB
ja: コントロール 19 汎用コントローラ 4 MSB
ne: नियन्त्रण १९ साधारण उद्देश्य नियन्त्रक ४ MSB

source: Control 2 Breath Control MSB
fr: Contrôle 2 Contrôle du souffle MSB
ja: コントロール 2 ブレスコントロール MSB
ne: नियन्त्रण २ श्वास नियन्त्रण MSB

source: Control 32 Bank Select LSB
fr: Contrôle 32 Sélection de banque LSB
it: Controllo 32 Selezione Banco LSB
ja: コントロール 32 バンク選択 LSB
ne: नियन्त्रण ३२ बैंक छनोट LSB

source: Control 33 Modulation Depth LSB
fr: Contrôle 33 Profondeur de modulation LSB
it: Controllo 33 Profondità della modulazione LSB
ja: コントロール 33 変調深度 LSB
ne: नियन्त्रण ३३ मोडुलेसन गहिराइ LSB

source: Control 34 Breath Control LSB
fr: Contrôle 34 Contrôle du souffle LSB
ja: コントロール 34 ブレスコントロール LSB
ne: नियन्त्रण ३४ श्वास नियन्त्रण LSB

source: Control 36 Foot Controller LSB
fr: Contrôle 36 Contrôleur de la pédale LSB
it: Controllo 36 Controllo Pedale LSB
ja: コントロール 36 フットコントローラ LSB
ne: नियन्त्रण ३६ पाद नियन्त्रक LSB

source: Control 37 Portamento Time LSB
fr: Contrôle 37 Durée du glissando LSB
it: Controllo 37 Portamento Tempo LSB
ja: コントロール 37 ポルタメント時間 LSB
ne: नियन्त्रण ३७ पोर्टामेन्टो समय LSB

source: Control 38 Data Entry LSB
fr: Contrôle 38 Entrées de données LSB
ja: コントロール 38 データエントリ LSB
ne: नियन्त्रण ३८ डेटा प्रविष्टि LSB

source: Control 39 Volume LSB
fr: Contrôle 39 Volume LSB
it: Controllo 39 VOlume LSB
ja: コントロール 39 音量 LSB
ne: नियन्त्रण ३९ ध्वनि LSB

source: Control 4 Foot Controller MSB
fr: Contrôle 4 Contrôleur de la pédale MSB
it: Controllo 4 Controllo Pedale MSB
ja: コントロール 4 フットコントローラ MSB
ne: नियन्त्रण ४ पाद नियन्त्रक MSB

source: Control 40 Balance LSB
fr: Contrôle 40 Balance LSB
it: Controllo 40 Bilanciamento LSB
ja: コントロール 40 バランス LSB
ne: नियन्त्रण ४० सन्तुलन LSB

source: Control 42 Panorama LSB
fr: Contrôle 42 Panorama LSB
it: Controllo 42 Panorama LSB
ja: コントロール 42 パノラマ LSB
ne: नियन्त्रण ४२ पानोरामा LSB

source: Control 43 Expression LSB
fr: Contrôle 43 Expression LSB
it: Controllo 43 Espressione LSB
ja: コントロール 43 エクスプレッション LSB
ne: नियन्त्रण ४३ अभिव्यक्त्ति LSB

source: Control 44 Effect Control 1 LSB
fr: Contrôle 44 Contrôle de l'effet 1 LSB
it: Controllo 44 Controllo Effetto 1 LSB
ja: コントロール 44 エフェクトコントロール 1 LSB
ne: नियन्त्रण ४४ प्रभाव नियन्त्रण १ LSB

source: Control 45 Effect Control 2 LSB
fr: Contrôle 45 Contrôle de l'effet 2 LSB
it: Controllo 45 Controllo Effetto 2 LSB
ja: コントロール 45 エフェクトコントロール 2 LSB
ne: नियन्त्रण ४५ प्रभाव नियन्त्रण २ LSB

source: Control 48 General Purpose Controller 1 LSB
fr: Contrôle 48 Contrôleur d'usage général 1 LSB
it: Controllo 48 Controllo d'Uso Generale 1 LSB
ja: コントロール 48 汎用コントローラ 1 LSB
ne: नियन्त्रण ४८ साधारण उद्देश्य नियन्त्रक १ LSB

source: Control 49 General Purpose Controller 2 LSB
fr: Contrôle 49 Contrôleur d'usage général 2 LSB
it: Controllo 49 Controllo d'Uso Generale 2 LSB
ja: コントロール 49 汎用コントローラ 2 LSB
ne: नियन्त्रण ४९ साधारण उद्देश्य नियन्त्रक २ LSB

source: Control 5 Portamento Time MSB
fr: Contrôle 5 Durée du glissando MSB
it: Controllo 5 Portamento Tempo MSB
ja: コントロール 5 ポルタメント時間 MSB
ne: नियन्त्रण ५ पोर्टामेन्टो समय MSB

source: Control 50 General Purpose Controller 3 LSB
fr: Contrôle 50 Contrôleur d'usage général 3 LSB
it: Controllo 50 Controllo d'Uso Generale 3 LSB
ja: コントロール 50 汎用コントローラ 3 LSB
ne: नियन्त्रण ५० साधारण उद्देश्य नियन्त्रक ३ LSB

source: Control 51 General Purpose Controller 4 LSB
fr: Contrôle 51 Contrôleur d'usage général 4 LSB
it: Controllo 51 Controllo d'Uso Generale 4 LSB
ja: コントロール 51 汎用コントローラ 4 LSB
ne: नियन्त्रण ५१ साधारण उद्देश्य नियन्त्रक ४ LSB

source: Control 6 Data Entry MSB
fr: Contrôle 6 Entrées de données MSB
ja: コントロール 6 データエントリ MSB
ne: नियन्त्रण ६ डेटा नियन्त्रक MSB

source: Control 64 Damper Pedal Switch (Sustain)
fr: Contrôle 64 Commutateur pédale d'amortissement (soutien)
it: Controllo 64 Commutazione pedale sordina (Sustain)
ja: コントロール 64 ダンパーペダルスウィッチ(サスティン)
ne: नियन्त्रण ६४ ड्याम्पर पेडल स्विच (सुस्टेन)

source: Control 65 Portamento Switch
fr: Contrôle 65 Commutateur glissando
ja: コントロール 65 ポルタメントスウィッチ
ne: नियन्त्रण ६५ पोर्टामेन्टो स्विच

source: Control 66 Sustenuto Switch
fr: Contrôle 66 Commutateur sostenuto
ja: コントロール 66 サスティヌートスウィッチ
ne: नियन्त्रण ६६ सुस्टेनुटो स्विच

source: Control 67 Soft Switch
fr: Contrôle 67 Commutateur piano
ja: コントロール 67 ソフトスウィッチ
ne: नियन्त्रण ६७ नरम स्विच

source: Control 68 Legato Pedal Switch
fr: Contrôle 68 Commutateur de la pédale de legato
ja: コントロール 68 レガートペダルスウィッチ
ne: नियन्त्रण ६८ लेगाटो पेडल स्विच

source: Control 69 Hold Pedal Switch
fr: Contrôle 69 Commutateur de la pédale de maintien
ja: コントロール 69 ホールドペダルスウィッチ
ne: नियन्त्रण ६९ होल्ड पेडल स्विच

source: Control 7 Volume MSB
fr: Contrôle 7 Volume MSB
it: Controllo 7 Volume MSB
ja: コントロール 7 音量 MSB
ne: नियन्त्रण ७ ध्वनि MSB

source: Control 70 Sound Variation
fr: Contrôle 70 Variation du son
it: Controllo 70 Variazione Suono
ja: コントロール 70 サウンドバリエーション
ne: नियन्त्रण ७० आवाज विविधता

source: Control 71 Filter Resonance (Timbre)
fr: Contrôle 71 Filtre de résonance (timbre)
it: Controllo 71 Risonanza Filtro (Timbro)
ja: コントロール 71 フィルターレゾナンス (音色)
ne: नियन्त्रण ७१ फोल्टर प्रतिध्वनी (टिम्ब्रे)

source: Control 72 Sound Release Time
fr: Contrôle 72 Durée du relâchement du son
it: Controllo 72 Tempo di Rilascio del Suono
ja: コントロール 72 サウンドリリース時間
ne: नियन्त्रण ७२ आवाज छाडिएको समय

source: Control 73 Sound Attack Time
fr: Contrôle 73 Durée d'attaque du son
it: Controllo 73 Tempo di Attacco del Suono
ja: コントロール 73 サウンドアタック時間
ne: नियन्त्रण ७३ आवाज आक्रामक समय

source: Control 74 Sound Brightness
fr: Contrôle 74 Brillance du son
ja: コントロール 74 サウンド明度
ne: नियन्त्रण ७४ आवाज चम्किलो

source: Control 75 Sound Decay Time
fr: Contrôle 75 Durée de décroissance du son
it: Controllo 75 Tempo di Decadimento del Suono
ja: コントロール 75 サウンドディケイ時間
ne: नियन्त्रण ७५ आवाज डिके समय

source: Control 76 Vibrato Rate
fr: Contrôle 76 Taux de vibrato
it: Controllo 76 Intensità Vibrato
ja: コントロール 76 バイブレート比率
ne: नियन्त्रण ७६ आन्दोलक दर

source: Control 77 Vibrato Depth
fr: Contrôle 77 Profondeur du vibrato
it: Controllo 77 Profondità Vibrato
ja: コントロール 77 バイブレート深度
ne: नियन्त्रण ७७ आन्दोलक गहिराइ

source: Control 78 Vibrato Delay
fr: Contrôle 78 Durée de vibrato
it: Controllo 78 Ritardo Vibrato
ja: コントロール 78 バイブレートディレイ
ne: नियन्त्रण ७८ आन्दोलक ढिलाइ

source: Control 79 Sound Control 10
fr: Contrôle 79 Contrôle du son 10
it: Controllo 79 Controllo Suono 10
ja: コントロール 79 サウンドコントロール 10
ne: नियन्त्रण ७९ आवाज नियन्त्रण १०

source: Control 8 Balance MSB
fr: Contrôle 8 Balance MSB
it: Controllo 8 Bilanciamento MSB
ja: コントロール 8 バランス MSB
ne: नियन्त्रण ८ सन्तुलन MSB

source: Control 80 General Purpose Switch 5
fr: Contrôle 80 Commutateur d'usage général 5
it: Controllo 80 Interruttore d'uso Generale 5
ja: コントロール 80 汎用スウィッチ 5
ne: नियन्त्रण ८० साधारण उद्देश्य स्विच ५

source: Control 81 General Purpose Switch 6
fr: Contrôle 81 Commutateur d'usage général 6
it: Controllo 81 Interruttore d'uso Generale 6
ja: コントロール 81 汎用スウィッチ 6
ne: नियन्त्रण ८१ साधारण उद्देश्य स्विच ६

source: Control 82 General Purpose Switch 7
fr: Contrôle 82 Commutateur d'usage général 7
it: Controllo 82 Interruttore d'uso Generale 7
ja: コントロール 82 汎用スウィッチ 7
ne: नियन्त्रण ८२ साधारण उद्देश्य स्विच ७

source: Control 83 General Purpose Switch 8
fr: Contrôle 83 Commutateur d'usage général 8
it: Controllo 83 Interruttore d'uso Generale 8
ja: コントロール 83 汎用スウィッチ 8
ne: नियन्त्रण ८३ साधारण उद्देश्य स्विच ८

source: Control 84 Portamento Control (Note)
fr: Contrôle 84 Contrôle du glissando (note)
it: Controllo 84 Controllo Portamento (Nota)
ja: コントロール 84 ポルタメントコントロール (ノート)
ne: नियन्त्रण ८४ पोर्टामेन्टो नियन्त्रण (द्रष्टव्य)

source: Control 91 Reverb Depth
fr: Contrôle 91 Profondeur de réverbération
it: Controllo 91 Profondità Riverbero
ja: コントロール 91 リバーブ深度
ne: नियन्त्रण ९१ रिभर्ब गहिराइ

source: Control 92 Tremolo Depth
fr: Contrôle 92 Profondeur de tremolo
it: Controllo 92 Profondità Tremolo
ja: コントロール 92 トレモロ深度
ne: नियन्त्रण ९२ ट्रेमोलो गहिराइ

source: Control 93 Chorus Depth
fr: Contrôle 93 Profondeur du chorus
it: Controllo 93 Profondità Chorus
ja: コントロール 93 コーラス深度
ne: नियन्त्रण ९३ कोरस गहिराइ

source: Control 93 Detune Depth
fr: Contrôle 93 Taux de désaccord
ja: コントロール 93 デチューン深度
ne: नियन्त्रण ९३ डेट्युन गहिराइ

source: Control 95 Phase Depth
fr: Contrôle 95 Profondeur de phase
it: Controllo 95 Profondità Fase
ja: コントロール 95 位相深度
ne: नियन्त्रण ९५ फेज गहिराइ

source: Control 96 Data Increment Trigger
fr: Contrôle 96 Déclencheur d'incrément de données
ja: コントロール 96 データ増分トリガー
ne: नियन्त्रण ९६ डेटा इन्क्रिमेन्ट ट्रिग्गर

source: Control 97 Data Decrement Trigger
fr: Contrôle 97 Déclencheur de décrément de données
ja: コントロール 97 データ減分トリガー
ne: नियन्त्रण ९७ डेटा डिक्रिमेन्ट ट्रिग्गर

source: Control 98 Non-Registered Parameter MSB
fr: Contrôle 98 Paramètre non enregistré MSB
it: Controllo 98 Parametro Non Registrato MSB
ja: コントロール 98 未登録のパラメータ MSB
ne: नियन्त्रण ९८ दर्ता नभएको परामिति MSB

source: Control 99 Non-Registered Parameter LSB
fr: Contrôle 98 Paramètre non enregistré LSB
it: Controllo 99 Parametro Non Registrato LSB
ja: コントロール 99 未登録のパラメータ LSB
ne: नियन्त्रण ९९ दर्ता नभएको परामिति LSB

source: Control Automation
fr: Contrôle automatisé
it: Controllo Automazione
ne: नियन्त्रण स्वचालन

source: Control Automation: %s
fr: Contrôle automatisé : %s
it: Controllo Automazione: %s
ja: コントロール自動化: %s
ne: नियन्त्रण स्वचालन: %s

source: Control Input
fr: Entrée du contrôle
it: Controllo Ingresso
ja: コントロール入力
ne: नियन्त्रण आगत

source: Control Strength
fr: Intensité du contrôle
it: Controllo Intensità
ja: コントロールの強さ
ne: नियन्त्रण बल

source: Control Type:
fr: Type de contrôle :
it: Tipo di Controllo:
ja: コントロールタイプ:
ne: नियन्त्रण प्रकार:

source: Controller
fr: Contrôleur
ja: コントローラ
ne: नियन्त्रक

source: Controls the octave relative to which notes are entered
fr: Définit l'octave par rapport auquel les notes sont entrées
it: Controlla l'ottava relativa dove le note sono inserite
ja: 入力されたノートをコントロールする音階
ne: ओक्टेभ सम्बन्धित जहाँ द्रष्टव्य प्रविष्ट गरिन्छ त्यसको नियन्त्रण गर्दछ

source: Copy
fr: Copier
it: Copia
ja: コピー
ne: प्रतिलिपि बनाउनुहोस्

source: Copy the current selection into clipboard
fr: Copie la sélection actuelle dans le presse-papiers
it: Copia la selezione corrente negli appunti
ja: 選択領域をクリップボードにコピー
ne: हालको चयन क्लिपबोर्डमा प्रतिलिपि बनाउनुहोस्

source: Copyright license applying to this object
fr: Licence de copyright applicable à cet objet
it: Licenza del Copyright applicato a questo oggetto
ja: このオブジェクトに適用するコピーライトライセンス
ne: यो वस्तुमा लागू गरिएको प्रतिलिपिअधिकार अनुमतिपत्र

source: Create Link
fr: Crée un lien
it: Crea Collegamento
ja: リンク作成
ne: लिङ्क सिर्जना गर्नुहोस्

source: Create a new Part in a Song.
fr: Crée une nouvelle mesure dans une mélodie.
it: Crea una nuova Parte in una Canzone
ja: 曲中に新しいパートを作成
ne: गीतमा नयाँ अंश सिर्जना गर्नुहोस्

source: Create a new Track for a Song.
fr: Crée une nouvelle piste pour une mélodie.
it: Crea una nuova Traccia per una canzone
ja: 曲の新しいトラックを作成
ne: गीतका लागि नयाँ ट्र्याक सिर्जना गर्नुहोस्
