Repository: tim-janik/beast
Catalog: po/*.po
Languages: fr, it, ja, ne

source: Create a new mixer bus for a Song.
fr: Crée un nouveau bus de mixage pour une mélodie.
it: Crea un nuovo bus mixer per una Canzone.
ja: 曲のための新しいミキサーバスを作成
ne: गीतका लागि नयाँ मिश्रण बस सिर्जना गर्नुहोस्

source: Create a new song, consisting of a mixer, tracks, parts and notes
fr: Crée une nouvelle mélodie, comprenant une table de mixage, des pistes, des mesures et des notes
it: Crea una nuova canzone consistente di un mixer, tracce, parti e note
ja: ミキサー、トラック、パートとノートを含む新しい曲を作成
ne: नयाँ गीत, मिक्सर ट्र्याक्स, पार्टस् र टिप्पणी सिर्जना गर्नुहोस्

source: Create an extra view of the project
fr: Crée une nouvelle vue du projet
it: Crea una extra vista del progetto
ja: プロジェクトの別のビューを作成
ne: परियोजनाको छुट्टै दृश्य सिर्जना गर्नुहोस्

source: Create new project
fr: Crée un nouveau projet
it: Crea un nuovo progetto
ja: 新しいプロジェクト
ne: नयाँ परियोजना सिर्जना गर्नुहोस्

source: Creation Time
fr: Date/heure de création
it: Creato il
ja: 作成日時
ne: सिर्जना समय

source: Current Items:
fr: Éléments courants :
it: Voci Correnti:
ja: 現在のアイテム:
ne: हालको वस्तुहरू:

source: Cut
fr: Couper
it: Taglia
ja: 切り取り
ne: काट्नुहोस्

source: Cutoff Frequency (All Filters)
fr: Fréquence de coupure (tous les filtres)
it: Frequenza di Taglio (Tutti i Filtri)
ja: カットオフ周波数 (すべてのフィルター)
ne: काटिएको आवृति (सबै फिल्टर)

source: Cutoff Frequency 2 (Band Pass/Stop)
fr: Fréquence de coupure 2 (bande passante/arrêt)
it: Frequenza di Taglio 2 (Passa Banda/Stop)
ja: カットオフ周波数 2 (バンドパス/停止)
ne: काटिएको आवृति २ (ब्यान्ड पास/रोक्नुहोस्)

source: Cutoff [%]
fr: Coupure [%]
it: Frequenza di Taglio (Cutoff) [%]
ja: カットオフ [%]
ne: [%] काट्नुहोस्

source: Cutoff [Hz]
fr: Fréquence de coupure [Hz]
it: Taglio (cutoff) [Hz]
ja: カットオフ [Hz]
ne: काट्नु [Hz]

source: DEVICE,MODE
fr: PÉRIPHÉRIQUE, MODE
it: DISPOSITIVO,MODO
ne: यन्त्र, मोड

source: DSP Engine...
fr: Moteur DSP...
it: Motore DSP...
ja: DSP エンジン...
ne: DSP इन्जिन...

source: Data Entry
fr: Saisie des données
ja: 日時エントリ
ne: डेटा प्रविष्टि

source: Data corrupt
fr: Données endommagées
it: Corruzione Dati
ne: दुषित डेटा

source: DavBassFilter is a low-pass resonant TB-303 style filter based on the VCF303 portions of gsyn v0.2. The filter algorithm is partly based on the one described in "Musical Applications of Microprocessors" by Hal Chamberlin.
fr: DavBassFilter est un filtre passe-bas à résonance du style du TG-303 fondé sur les portions VCF303 de gsyn v0.2. L'algorithme de filtration est partiellement inspiré de celui décrit dans « Musical Applications of Microprocessors » de Hal Chamberlin.
it: Il filtro DavBass è un filtro passa basso risonante in stile TB 303 basato sulla VCF303. L'algoritmo del filtro è parzialmente basato su quanto descritto nel libro "Musical Applications of Microprocessors" di Hal Chamberlin.
ja: DavBassFilter は gsyn v0.2 に含まれる VCF303 をベースにする低周波パスレゾナンス TB-303 スタイルのフィルタです。フィルタアルゴリズムは Hal Chamberlin 著 "Musical Applications of Microprocessors" のものに部分的に基づいています。
ne: ड्याभ बासफिल्टर कम-पास रेसोनान्ट टी बी-३०३ शैली फिल्टर भी सी एफ ३०३ जिसिन भि०.२ सँग आधार छ । फिल्टर एल्गोरिथम आंशिक रूपमा ह्याल च्याम्बरलिनद्वारा एकमा परिभाषित "माइक्रोप्रोसेसरको साङ्गितिक अनुप्रयोग" सँग आधारित छ ।

source: DavChorus adds more depth to sounds
fr: DavChorus ajoute de la profondeur aux sons
it: Il DavChorus aggiunge maggiore profondità ai suoni
ja: DavChorus は音により深みを与えます
ne: ड्याभकोरसले बढी गहिराइ ध्वनिमा थप्दछ

source: Decay
fr: Extinction
it: Decadimento

source: Decay [%]
fr: Extinction [%]
it: Decadimento (Decay) [%]
ja: 減衰 [%]
ne: डिके [%]

source: Default Author
fr: Auteur par défaut
it: Autore principale

source: Default License
fr: Licence par défaut
it: Licenza d'origine

source: Default Values
fr: Valeurs par défaut
it: Valori predefiniti

source: Default value for 'Author' fields
fr: Nom par défaut dans le champ « Auteur »
it: Valori predefiniti per il campo "Autore"

source: Default value for 'License' fields
fr: Désignation par défaut dans le champ « Licence »
it: Valore predefinito per il campo "Licenza"

source: Delay (seconds)
fr: Retard (secondes)
it: Ritardo (in secondi)

source: Delete
fr: Supprimer
it: Cancella
ja: 削除
ne: मेट्नुहोस्

source: Delete Control Event
fr: Détruire un événement de contrôle
it: Cancella Controllo Evento
ja: コントロールイベントを削除
ne: नियन्त्रण घटना मेट्नुहोस्

source: Delete Link
fr: Détruit un lien
it: Cancella Collegamento
ja: リセットを削除
ne: लिङ्क मेट्नुहोस्

source: Delete Note
fr: Supprimer la note
it: Cancella Nota
ja: ノートを削除
ne: द्रष्टव्य मेट्नुहोस्

source: Delete Part
fr: Supprimer la mesure
it: Cancella Parte
ja: パートを削除
ne: अंश मेट्नुहोस्

source: Delete a Part from a Song.
fr: Détruit une mesure dans une mélodie.
it: Cancella una Parte da una Canzone
ja: 曲中のパートを削除
ne: गीतबाट अंश मेट्नुहोस्

source: Delete a Track from a Song.
fr: Détruit une piste dans une mélodie.
it: Cancella una Traccia da una Canzone
ja: 曲中のトラックを削除
ne: गीतबाट ट्र्याक मेट्नुहोस्

source: Delete a mixer bus from a Song.
fr: Détruit un bus de mixage pour une mélodie.
it: Cancella un bus mixer per una canzone.
ja: 曲からミキサーバスを削除
ne: गीतबाट मिश्रण बस मेट्नुहोस्

source: Delete note (mouse button 1)
fr: Effacer la note (bouton 1 de la souris)
it: Cancella nota (pulsante del mouse 1)
ja: ノートを削除(マウスボタン 1)
ne: द्रष्टव्य मेट्नुहोस् (माउस बटन १)

source: Delete parts
fr: Supprimer des mesures
it: Cancella Parti
ja: パートを削除
ne: अंश मेट्नुहोस्

source: Delete the complete undo history
fr: Supprime l'historique complet des annulations
it: Cancella completamente la storia delle azioni di Annulla
ja: アンドゥ履歴を完全に削除
ne: पूर्वस्थितिमा फर्काइएको इतिहास सम्पूर्ण मेट्नुहोस्

source: Delete the currently selected bus
fr: Supprime la voix actuellement sélectionnée
it: Cancella il bus correntemente selezionato
ne: हालमा चयन गरिएको बस मेट्नुहोस्

source: Delete the currently selected key binding
fr: Supprimer la combinaison de touches actuellement sélectionnée
it: Cancella la combinazione selezionata
ja: 選択したショートカットを削除
ne: हालमा चयन गरिएको कुञ्जी बाइन्डिङ मेट्नुहोस्

source: Delete the currently selected track
fr: Supprime la piste actuellement sélectionnée
it: Cancella la traccia correntemente selezionata
ja: 現在選択しているトラックを削除
ne: हालमा चयन गरिएको ट्र्याक मेट्नुहोस्

source: Delete the currently selected wave
fr: Supprime le son actuellement sélectionnée
it: Cancella il wave correntemente selezionato
ja: 現在選択している wave を削除
ne: हालमा चयन गरिएको तरङ मेट्नुहोस्

source: Denominator
fr: Dénominateur
it: Denominatore
ne: हर

source: Details:
fr: Détails :
it: Dettagli:
ja: 詳細:
ne: विवरण:

source: Detected file format
fr: Format de fichier détecté
it: Formato del file rilevato
ne: पत्ता लगाइएको फाइल ढाँचा

source: Developing Plugins...
fr: Développement de greffons...
it: Sviluppo Plugins...
ja: プラグイン開発...
ne: प्लगइन विकास गर्दैछ...

source: Development...
fr: Développement...
it: Sviluppo...
ja: 開発...
ne: विकास...

source: Device busy
fr: Périphérique occupé
it: Dispositivo occupato
ja: デバイスが使用中
ne: यन्त्र ब्यस्त

source: Device configurations mismatch
fr: Configurations du périphérique incohérentes
it: Disadattamento di configurazione del dispositivo
ja: デバイス設定の不整合
ne: यन्त्र कन्फिगरेसन अमिल्दो

source: Device not async capable
fr: Périphérique ne fonctionnant pas en mode asynchrone
ja: デバイスは非同期に利用できません
ne: यन्त्र एसिन्क सक्षम भएन

source: Device or resource busy
fr: Périphérique ou ressource occupés
it: Dispositivo o risorsa impegnata
ne: यन्त्र वा स्रोत ब्यस्त

source: Dial
fr: Cadran
it: Scala
ja: ダイアル
ne: डायल

source: Dial (Logarithmic)
fr: Cadran (logarithmique)
it: Scala (Logaritmica)
ja: ダイアル (対数)
ne: डायल (लोगारिथ्मिक)

source: Dialogs
fr: Boîtes de dialogue
ja: ダイアログ
ne: संवाद

source: Diatonic Scale
fr: Échelle diatonique
it: Scala Diatonica

source: Diatonic scale used in Indian music with wolf interval at Dha, close to 3/2
fr: Échelle diatonique utilisée dans la musique hindoue avec, à l'aplomb de la note Dha, la quinte du loup proche de 3/2

source: Discard Changes
fr: Annuler les modifications
it: Annulla i Cambi
ne: परिवर्तन छोड्नुहोस्

source: Discard changes and close dialog
fr: Annule les modifications et ferme la boîte de dialogue
it: Annulla i cambi e chiudi la finestra
ja: 変更を破棄しダイアログを閉じる
ne: परिवर्तन छोडेर बन्द गर्नुहोस्

source: Discards all output events and generates no input events. This driver is not part of the automatic device selection list for MIDI devices.
fr: Détruit tous les événements en sortie et n'en génère aucun en entrée. Ce pilote ne fait pas partie de la liste de choix automatique des périphériques MIDI.
it: Scarta tutti gli eventi in uscita e non genera alcun evento dall'ingresso. Questo driver non fa parte della lista di selezione automatica dei dispositivi per gli elementi MIDI.
ne: सबै आगत घटना छाड्नुहोस् र आगत घटना उत्पन्न नगर्नुहोस् । यो ड्राइभर मिडि यन्त्र सूचीको स्वत: यन्त्रको अंश होइन ।

source: Disconnect In
fr: Entrée déconnectée
it: Disconnetti Ingresso
ja: 入力切断
ne: भित्री जडान नभएको

source: Disconnect Inputs
fr: Déconnecte les entrées
it: Scollega gli ingressi

source: Disconnect Out
fr: Sortie déconnectée
it: Disconnetti Uscita
ja: 出力切断
ne: जडान नभएको बाहिर

source: Disconnect Outputs
fr: Déconnecte les sorties
it: Scollega le uscite

source: Display an overview of all procedures
fr: Affiche une vue d'ensemble de toutes les procédures
it: Visualizza un insieme di tutte le procedure
ja: すべてのプロセスを表示
ne: सबै कार्यविधि समिक्षा गरी प्रदर्शन गर्नुहोस्

source: Display developer and contributor credits
fr: Affiche le générique développeurs et contributeurs
it: Visualizza contributori e sviluppatori
ja: 開発者と貢献者のクレジットを表示
ne: विकासकर्ता र योगदानकर्ता श्रेय प्रदर्शन गर्नुहोस्

source: Display dialogs with debugging messages
fr: Afficher les boîtes de dialogue avec les messages de débogage
it: Visualizza messaggi di debug
ne: त्रुटि सच्याउने सन्देशसँग संवाद प्रदर्शन गर्नुहोस्

source: Display dialogs with information messages
fr: Afficher les boîtes de dialogue avec les messages d'information
it: Visualizza messaggi
ne: सूचना सन्देशसँग संवाद प्रदर्शन गर्नुहोस्

source: Display statistics and timing information
fr: Affiche des statistiques et des informations de chronométrage
it: Monitor di sistema: tempi e statistiche
ja: 状態とタイミング情報を表示
ne: तथ्याङ्क र समय सूचना प्रदर्शन गर्नुहोस्

source: Distorted Audio Output
fr: Sortie audio distordu
it: Uscita Audio Distorta
ja: 歪みオーディオ出力
ne: डिस्टोर्ट गरिएको अडियो निर्गत

source: Document _Index...
fr: _Index des documents...
it: _Indice Documento...
ja: 文書索引(_I)...
ne: कागजात अनुक्रमण...

source: Done Out
fr: Sortie effectuée
ja: 完了出力
ne: गरियो

source: Done Output
fr: Sortie effectuée

source: Dotted eighths note
fr: Croche pointée
it: Nota da 1 Ottavo Puntata
ja: ドット付き 8 分ノート
ne: आठौं द्रष्टव्य थोप्ला

source: Dotted half note
fr: Blanche pointée
it: Nota Metà Puntata
ja: ドット付き半ノート
ne: आधा द्रष्टव्य थोप्ला

source: Dotted hundred twenty-eighth note
fr: Quintuple croche pointée
it: Nota da un centoventottesimo puntata
ja: ドット付き 128 分ノート
ne: एक सय अठ्ठाइसौं द्रष्टव्य थोप्ला

source: Dotted quarter note
fr: Noire pointée
it: Nota da 1 Quarto Puntata
ja: ドット付き 4 分ノート
ne: चौथाइ द्रष्टव्य थोप्ला

source: Dotted sixteenth note
fr: Double croche pointée
it: Nota da 1 Sedicesimo Puntata
ja: ドット付き 16 分ノート
ne: सोर्हौं द्रष्टव्य थोप्ला

source: Dotted sixty-fourth note
fr: Quadruple croche pointée
it: Nota da 1 Sessantaquattresimo Puntata
ja: ドット付き 64 分ノート
ne: चौसाठ्ठिऔं द्रष्टव्य थोप्ला

source: Dotted thirty-secondth note
fr: Triple croche pointée
it: Nota da 1 Trentaduesimo Puntata
ja: ドット付き 32 分ノート
ne: बत्तिसौं द्रष्टव्य थोप्ला

source: Dotted whole note
fr: Ronde pointée
it: Nota Intera Puntata
ja: ドット付き全ノート
ne: पूरा द्रष्टव्य थोप्ला

source: Down
fr: Bas
it: Giù
ja: 下へ
ne: तल

source: Draw Values
fr: Écrire les valeurs
it: Disegna Valori
ja: 値を表示
ne: मान कोर्नुहोस्

source: Draw a line to align events to
fr: Tracer la ligne sur laquelle aligner les événements
it: Disegna una linea per allineare gli eventi a
ja: イベントを調整するための線を描画
ne: यसमा घटना पङ्क्तिबद्ध गर्न लाइन कोर्नुहोस्

source: Draw synthesis networks anti-aliased?
fr: Tracé sans crènelage des liens du réseau de synthèse
it: Disegna la rete di sintesi in modalitï¿½ anti-aliased?
ja: シンセネットワークをアンチエイリアス表示するかどうか
ne: एन्टी-एलाइज गरिएको सिन्थेसिस सञ्जाल कोर्नुहुन्छ ?

source: Drop Down Button
fr: Bouton déroulant
ja: ドロップダウンボタン
ne: ड्रप डाउन बटन

source: Drop Down Combo
fr: Bouton combiné déroulant
ja: ドロップダウンコンボ
ne: ड्रप डाउन कम्बो

source: Drum Frequency Input
fr: Entrée fréquence de la batterie
it: Frequenza d'Ingresso Batteria
ja: ドラム周波数入力
ne: ड्रम आवृति आगत

source: Drum frequency as note, converted to Hertz according to the current musical tuning
fr: Fréquence de la batterie définie par une note, convertie en Hertz selon la tonalité musicale retenue

source: Drum frequency in Hertz
fr: Fréquence de la batterie en Hertz
it: Frequenza della batteria (in Hertz)

source: Duplicate
fr: Dupliquer
it: Duplicato
ja: 複製
ne: नक्कल गर्नुहोस्

source: EVENTS:
fr: ÉVÉNEMENTS :
it: EVENTI:
ja: イベント:
ne: घटना:

source: EXAMPLE:
fr: EXEMPLE :
it: ESEMPIO:
ja: 例:
ne: उदाहरण:

source: E_xamples
fr: E_xemples
it: Esempi
ja: 例(_x)
ne: उदाहरण

source: Edit
fr: Éditer
it: Modifica
ja: 編集
ne: सम्पादन गर्नुहोस्

source: Edit Part
fr: Édite la mesure
it: Modifica Parte
ja: パートを編集
ne: अंश सम्पादन गर्नुहोस्

source: Edit Rack Item
fr: Éditer l'élément de rack
it: Modifica Voci Rack
ja: ラックアイテムを編集
ne: र्याक वस्तु सम्पादन गर्नुहोस्

source: Edit the currently selected wave
fr: Édite le son actuellement sélectionnée
it: Modifica il wave correntemente selezionato
ja: 現在選択している wave を編集
ne: हालमा चयन गरिएको तरङ सम्पादन गर्नुहोस्

source: Edit tool (mouse buttons 1-3) Use button1 to create links, button2 for movement and button3 to change properties
fr: Outil d'édition (boutons de souris 1-3) Utilisez le bouton 1 pour créer une liaison, le bouton 2 pour déplacer un module et le bouton 3 pour modifier ses propriétés
it: Modifica Strumenti (pulsanti mouse 1-3) Usa pulsante 1 per creare collegamenti, pulsante 2 per gli spostamenti e il pulsante 3 per cambiare le proprieta'
ja: ツール編集(マウスボタン1-3) ボタン1 でリンク作成、ボタン2 で移動、ボタン3 で変更
ne: सम्पादन उपकरण (माउस बटन १-३) लिङ्क सिर्जना गर्नका लागि बटन १ , चलाउनका लागि बटन २ र गुण परिवर्तन गर्न बटन ३ प्रयोग गर्नुहोस्

source: Edit/Move/Menu (mouse buttons 1-3)
fr: Éditer/Déplacer/Menu (boutons de souris 1-3)
it: Modifica/Sposta/Menù (pulsanti del mouse 1-3)
ja: 編集/移動/メニュー (マウスボタン 1-3)
ne: सम्पादन/सार्नुहोस्/मेनु (माउस बटन १-३)

source: Editor
fr: Éditeur
ja: エディタ
ne: सम्पादक

source: Effect Control 1
fr: Contrôle d'effet 1
it: Controllo Effetto 1
ja: エフェクトコントロール 1
ne: प्रभाव नियन्त्रण १

source: Effect Control 2
fr: Contrôle d'effet 2
it: Controllo Effetto 2
ja: エフェクトコントロール 2
ne: प्रभाव नियन्त्रण २

source: Effect Path
fr: Chemin des effets
it: Percorso Effetti
ja: エフェクトパス
ne: प्रभाव बाटो

source: Eighths note
fr: Croche
it: Nota da un Ottavo (croma)
ja: 8 分ノート
ne: आठौं द्रष्टव्य

source: Emphasis
fr: Amplification
it: Enfasi
ja: 強調
ne: महत्व

source: Empty Field Color
fr: Couleur de champ vide
it: Colore Campo
ja: 空のフィールドの色
ne: खाली फिल्ड रङ

source: Enable Error Bell
fr: Activer le bip d'erreur

source: Enable homogeneous sizes for most (numeric and text) input fields. For some fields, this will only take effect after a restart.
fr: Active une taille homogène pour la plupart des champs d'entrées (numériques et textuels). Pour certains champs, ce paramètre ne prendra effet qu'après redémarrage.
it: Abilita ampiezze comuni per i principali campi di ingresso (numeri e testo). Per alcuni campi, questo produrrà il relativo effetto solo se il programma verrà riavviato.
ja: ほとんどの(数字と文字)入力フィールドについて均一なサイズとなるようにする。いくつかのフィールドについては再起動後にのみ有効となる
ne: धेरै जसो (सख्यात्मक वा पाठ) आगत फाँटका लागि उस्तै साइज सक्षम पार्नुहोस् । केहि फाँटमा फेरि सुरु गरेपछि मात्र यसले प्रभाव पार्छ ।

source: Enable or disable message display of a specific message type
fr: Active ou désactive l'affichage de messages d'un type donné
it: Abilita o disabilita la visualizzazione dei messaggi di uno specifico tipo di messaggio
ja: 特定のメッセージタイプを表示/非表示
ne: विशेष सन्देश प्रकारको सन्देश प्रदर्शन सक्षम पार्नुहोस् वा अक्षम पार्नुहोस्

source: End:
fr: Fin :
it: Fine:
ja: 終了:
ne: अन्त्य:

source: Ensure that each part in a song is inserted into at least one track.
fr: S'assure que chaque mesure d'une mélodie est introduite dans au moins une piste.
it: Assicurarsi che ogni parte in una canzone sia inserita almeno in una traccia.
ja: 曲中の各々のパートが少くとも一つのトラックに挿入されるようにする
ne: गीतमा प्रत्येक अंश कम्तीमा एउटा ट्र्याक राखेको छ भनेर याद गर्नुहोस्

source: Enter document or file location
fr: Saisir l'emplacement du fichier ou du document
it: Inserisci locazione del documento o del file
ja: ドキュメントかファイル位置を入力
ne: कागजात वा फाइल स्थान प्रविष्ट गर्नुहोस्

source: Envelope Modulation [%]
fr: Modulation de l'enveloppe [%]
it: Modulazione Inviluppo [%]
ja: エンベロープ変調 [%]
ne: खाम मोड्युलेसन [%]

source: Error:
fr: Erreur :
it: Errore:
ne: त्रुटि:

source: Events
fr: Événements
it: Eventi
ja: イベント
ne: घटना

source: Every eighth and sixteenth row
fr: Chaque huitième et seizième de ligne
it: Ogni otto e sedici righe
ja: 第8, 16列毎
ne: हरेक आठौं र सोर्हौं पङ्क्ति

source: Every eighth row
fr: Chaque huitième de ligne
it: Ogni otto righe
ja: 第8列毎
ne: हरेक आठौं पङ्क्ति

source: Every fourth and eighth row
fr: Chaque quart et huitième de ligne
it: Ogni quattro e otto righe
ja: 第4, 8列毎
ne: हरेक चौथो र आठौं पङ्क्ति

source: Every fourth and sixteenth row
fr: Chaque quart et seizième de ligne
it: Ogni quattro e sedici righe
ja: 第4, 16列毎
ne: हरेक चौथो र सोर्हौं पङ्क्ति

source: Every fourth and twelfth row
fr: Chaque quart et douzième de ligne
it: Ogni quattro e dodici righe
ja: 第4, 12列毎
ne: हरेक चौथो र बार्हौं पङ्क्ति

source: Every fourth row
fr: Chaque quart de ligne
it: Ogni quattro righe
ja: 第4列毎
ne: हरेक चौथों पङ्क्ति

source: Every second and fourth row
fr: Chaque moitié et quart de ligne
it: Ogni due e quattro righe
ja: 第2, 4列毎
ne: हरेक दोस्रो र चौथों पङ्क्ति

source: Every second row
fr: Chaque demie ligne
it: Ogni due righe
ja: 第2列毎
ne: हरेक दोस्रो पङ्क्ति

source: Every sixteenth row
fr: Chaque seizième de ligne
it: Ogni sedici righe
ja: 第16列毎
ne: हरेक सोर्हौ पङ्क्ति

source: Every sixth and twelfth row
fr: Chaque sixième et douzième de ligne
it: Ogni sei e dodici righe
ja: 第6, 12列毎
ne: हरेक छैठौं र बार्हौं पङ्क्ति

source: Every sixth row
fr: Chaque sixième de ligne
it: Ogni sei righe
ja: 第6列毎
ne: हरेक छैठौं पङ्क्ति

source: Every third and sixth row
fr: Chaque tiers et sixième de ligne
it: Ogni tre e sei righe
ja: 第3, 6列毎
ne: हरेक तेस्रो र छैठौं पङ्क्ति

source: Every third and twelfth row
fr: Chaque sixième et douzième de ligne
it: Ogni tre e dodici righe
ja: 第3, 12列毎
ne: हरेक तेस्रो र बार्हौं पङ्क्ति

source: Every third row
fr: Chaque tiers de ligne
it: Ogni tre righe
ja: 第3列毎
ne: हरेक तेस्रो पङ्क्ति

source: Every twelfth row
fr: Chaque douzième de ligne
it: Ogni dodici righe
ja: 第12列毎
ne: हरेक बार्हौं पङ्क्ति

source: Everything went well
fr: Tout s'est bien passé
it: Qualunque cosa andava bene
ja: 万事オーケー
ne: सबै राम्रो भयो

source: Executing '%s'
fr: Exécution de « %s »
it: Esecuzione '%s'
ne: '%s' कार्यान्वयन गर्दैछ

source: Executing procedure '%s' from script '%s'.
fr: Exécution de la procédure « %s » du script « %s ».
it: Esecuzione procedura '%s' dallo script '%s'.
ne: स्क्रिप्ट '%s' बाट प्रक्रिया '%s' कार्यसम्पादन गर्दैछ

source: Exponential Control
fr: Contrôles exponentiels
it: Controllo Esponenziale
ja: 指数コントロール
ne: एक्पोनेन्सियल नियन्त्रण

source: Exponential FM
fr: FM exponentielle
it: FM Esponenziale
ja: 指数関数 FM
ne: एक्सपोनेन्शल FM

source: Export Audio
fr: Exporter le son
it: Esporta Audio
ja: オーディオにエクスポート
ne: अडियो निर्यात गर्नुहोस्

source: Failed to configure device buffer
fr: Échec de configuration du tampon du périphérique
it: Fallita la configurazione del buffer del dispositivo
ja: デバイスバッファー設定に失敗
ne: यन्त्र बफर कन्फिगर गर्न असफल

source: Failed to configure device format
fr: Échec de configuration du format de périphérique
it: Fallita la configurazione del formato del dispositivo
ja: デバイスフォーマット設定に失敗
ne: यन्त्र ढाँचा कन्फिगरमा असफल

source: Failed to configure device frequency
fr: Échec de configuration de la fréquence du périphérique
it: Fallita la configurazione della frequenza del dispositivo
ja: デバイス周波数設定に失敗
ne: यन्त्र आवृति कन्फिगर गर्न असफल

source: Failed to configure device latency
fr: Échec de configuration de la latence du périphérique
it: Fallita la configurazione della latenza del dispositivo
ja: デバイスレイテンシ設定に失敗
ne: यन्त्र ल्याटेन्सी कन्फिगर गर्न असफल

source: Failed to configure number of device channels
fr: Échec de configuration du nombre de canaux du périphérique
it: Fallita la configurazione del numero dei canali del dispositivo
ja: デバイスチャネル設定に失敗
ne: यन्त्र च्यानलहरूको नम्बर कन्फिगर गर्न असफल

source: Failed to detect (start of) header
fr: Échec lors de la détection (du début) de l'en-tête
ne: शीर्षक पत्ता लगाउन (खोल्न) असफल

source: Failed to execute script procedure '%s': %s
fr: Échec lors de l'exécution de la procédure de script « %s » : %s
it: Fallita l'esecuzione della procedura di script "%s": %s
ne: स्क्रिप्ट कार्यविधि कार्यान्वयन गर्न असफल '%s': %s

source: Failed to load project "%s": %s
fr: Échec lors du chargement de « %s » : %s
it: Fallito il caricamento del progetto "%s": %s
ne: परियोजना लोड गर्न असफल "%s": %s

source: Failed to load wave file "%s": %s
fr: Échec du chargement du fichier son « %s » : %s
it: Fallita il caricamento del file wave "%s": %s
ne: वेभ फाइल "%s" लोड गर्न असफल: %s

source: Failed to merge project "%s": %s
fr: Échec lors de la fusion du projet « %s » : %s
it: Inserimento (fusione) del progetto non riuscita "%s": %s
ne: परियोजना गाभ्न असफल "%s": %s

source: Failed to open MIDI devices: %s
fr: Échec à l'ouverture des périphériques MIDI : %s
it: Apertura dispositivo MIDI non riuscita: %s
ne: मिडि यन्त्र खोल्न असफल: %s

source: Failed to open PCM devices: %s
fr: Échec à l'ouverture des périphériques PCM : %s
it: Apertura dispositivo PCM non riuscita: %s
ne: PCM यन्त्र खोल्न असफल: %s

source: Failed to replace file `%s' due to: %s
fr: Impossible de remplacer le fichier « %s » en raison de : %s
it: Sostituzione del file non riuscita `%s' dovuta a: %s
ja: ファイル '%s' の置き換えに 失敗しました。 理由: %s
ne: फाइल प्रतिस्थापन गर्न असफल `%s' कारणले: %s

source: Failed to retrieve seek information
fr: Échec d'extraction de l'information recherchée
it: Fallita la ricerca sul recupero delle informazioni
ne: खोज्ने सूचना पुन प्राप्त गर्न असफल

source: Failed to save `%s' to `%s': %s
fr: Impossible d'enregistrer « %s » dans « %s » : %s
it: Salvataggio fallito `%s' per `%s': %s
ja: '%s' の '%s' への 保存に失敗: %s
ne: बचत गर्न असफल `%s' मा `%s': %s

source: Failed to save to file `%s' due to: %s
fr: Impossible d'enregistrer le fichier « %s » en raison de : %s
it: Fallito salvataggio del file `%s' dovuto a: %s
ne: फाइलमा बचत गर्न असफल `%s' कारणले: %s

source: Failed to spawn child process
fr: Impossible de générer dynamiquement le processus enfant
ja: 子プロセスの起動に失敗
ne: शाखा प्रकृया स्पान गर्न असफल

source: Failed to start recording from audio device.
fr: Le démarrage de l'enregistrement à partir du périphérique audio à échoué.
it: Avvio della registrazione da un dispositivo audio non riuscita.
ne: अडियो यन्त्रबाट रेकर्ड सुरु गर्न असफल

source: Fallback into Edit mode after creating synthesis modules?
fr: Retour automatique dans le mode Édition après avoir créé un module de synthèse
it: Ritorno nella modalità di editing dopo aver creato il modulo di sintesi?
ja: シンセモジュールを作成した後で編集モードにフォールバックするかどうか
ne: सिन्थेसिस मोड्युल निर्माण गरेपछि सम्पादन मोडबाट पछि हट्नुहुन्छ ?

source: Feedback [%]
fr: Rétroaction [%]

source: File Selection
fr: Sélection de fichier
it: Selezione File
ja: ファイル選択
ne: फाइल चयन

source: File empty
fr: Fichier vide
it: File vuoto
ne: फाइल खाली छ

source: File exists already
fr: Le fichier existe déjà
it: Il file già esiste
ne: फाइल पहिले नै अवस्थित छ
