Repository: tim-janik/beast
Catalog: po/*.po
Languages: fr, it, ja, ne

source: Available MIDI drivers:
fr: Pilotes MIDI disponibles :
it: Driver MIDI disponibile:
ne: उपलब्ध मिडि ड्राइभर:

source: Available PCM drivers:
fr: Pilotes PCM disponibles :
it: Driver PCM disponibile:
ne: उपलब्ध PCM ड्राइभर:

source: allow folding the column into left/right neighbour
fr: permet de replier la colonne dans la voisine de droite ou de gauche
it: permetti ripiego della colonna nelle vicine a destra/sinistra
ja: 左右隣りにカラムを畳めるようにする
ne: दायाँ/बायाँ छिमेकमा स्तम्भ फोल्डिङ अनुमति दिनुहोस्

source: display 2 (-99..+99) or 3 (-999..+999) digit signed decimal numbers
fr: affiche les nombres décimaux signés avec 2 (-99..+99) ou 3 (-999..+999) chiffres
it: visualizza 2 (-99..+99) o 3 (-999..+999) cifre decimali con segno
ja: 2 (-99..+99) または 4 (-999..+999) デジタル符号付き 10 進数を表示
ne: २ (-९९..+९९) वा ३ (-९९९..+९९९) अङ्क साइन्ड दशमलव नम्बर प्रदर्शन गर्नुहोस्

source: display 2 (-FF..+FF) or 4 (-FFFF..+FFFF) digit signed hex numbers
fr: affiche les nombres hexadécimaux signés avec 2 (-FF..+FF) ou 4 (-FFFF..+FFFF) chiffres
it: visualizza 2 (-FF..+FF) o 4 (-FFFF..+FFFF) cifre esadecimali con segno
ja: 2 (-FF..+FF) または 4 (-FFFF..+FFFF) デジタル符号付き 16 進数を表示
ne: २ (-एफएफ..+एफएफ) वा ४ (-एफएफएफएफ..+एफएफएफएफ) अङ्क साइन्ड हेक्स नम्बर प्रदर्शन गर्नुहोस्

source: display 2 (00..99) or 3 (000..999) digit decimal numbers
fr: affiche les nombres décimaux avec 2 (00..99) ou 3 (000..999) chiffres
it: visualizza 2 (00..99) o 3 (000..999) cifre decimali
ja: 2 (00..99) または 4 (000..999) デジタル 10 進数を表示
ne: २ (००..९९) वा ३ (०००..९९९) अङ्क दशमलव नम्बरहरू प्रदर्शन गर्नुहोस्

source: display 2 (00..FF) or 4 (0000..FFFF) digit hex numbers
fr: affiche les nombres hexadécimaux avec 2 (00..FF) ou 4 (0000..FFFF) chiffres
it: visualizza 2 (00..FF) o 4 (0000..FFFF) cifre esadecimali
ja: 2 (00..FF) または 4 (0000..FFFF) デジタル 16 進数を表示
ne: २ (००..एफएफ) वा ४ (००००..एफएफएफएफ) अङ्क हेक्स नम्बरहरू प्रदर्शन गर्नुहोस्

source: display dotted vertical bar
fr: affiche une barre verticale pointillée
it: visualizza una linea tratteggiata
ja: 垂直の点線を表示
ne: थोप्ला गरिएको ठाडोपट्टी प्रदर्शन गर्नुहोस्

source: display notes of the first, second, ... channel
fr: affiche les notes du premier, deuxième, ... canal
it: visualizza note del primo, secondo, ... canale
ja: 第一、二 ... チャネルのノートを表示
ne: पहिलो, दोस्रो, ... च्यानलको टिप्पणी प्रदर्शन गर्नुहोस्

source: display offset, length or velocity of notes in the first, second, ... channel
fr: affiche le décalage, la longueur ou la dynamique des notes dans le premier, second, ... canal
it: visualizza offset, lenght o velocity delle note nel primo, secondo, ... canale
ja: 第一、二...チャネル内のノートのオフセット、長さまたはベロシティを表示
ne: अफसेट, लम्बाइ वा वेग पहिलो, दोस्रो, ... च्यानलको प्रदर्शन गर्नुहोस्

source: display solid vertical bar
fr: affiche une barre verticale continue
it: visualizza una linea verticale continua
ja: 垂直線を表示
ne: ठोस ठाडोपट्टी प्रदर्शन गर्नुहोस्

source: insert vertical space
fr: insère un espacement vertical
it: inserisci spazio verticale
ja: 水平スペースを挿入
ne: ठाडो खाली ठाउँ घुसाउनुहोस्

source: select various event types (controls, continuous controllers)
fr: sélectionne divers types d'événements (contrôles, contrôleurs continus)
it: seleziona diversi tipi di eventi (controlli, ecc)
ja: 様々なイベントタイプ(コントロール、連続コントローラ)を選択
ne: विभिन्न घटना प्रकार चयन गर्नुहोस् (नियन्त्रण, निरन्तर नियन्त्रक)

source: selects one of 3 predefined colors
fr: sélectionne une des 3 couleurs prédéfinies
it: seleziona uno dei tre colori predefiniti
ja: 定義済みの三色の内一つを選択
ne: ३ पूर्वपरिभाषित रङ मध्ये एउटा चयन गर्नुहोस्

source: %s: automation disabled
fr: %s : automatisation désactivée
it: %s: automazione disabilitata
ja: %s: 自動化を無効に
ne: %s: स्वचालन अक्षम

source: %s: automation from MIDI control: %s
fr: %s : automatisation des contrôles MIDI : %s
it: %s: automazione dal controllo MIDI: %s
ja: %s: MIDI コントロールからの自動化: %s
ne: MIDI नियन्त्रणबाट: %s स्वचालन %s:

source: %s: automation from MIDI control: %s (MIDI channel: %d)
fr: %s : automatisation des contrôles MIDI : %s (canal MIDI : %d)
it: %s: automazione dal controllo MIDI: %s (canale MIDI: %d)
ja: %s: MIDI コントロールからの自動化: %s (MIDI チャネル: %d)
ne: MIDI नियन्त्रणबाट: %s स्वचालन %s: (MIDI च्यानल: %d)

source: (Hint)
fr: (astuce)
it: (Suggerimento)
ja: (ヒント)
ne: (सूचक)

source: /Audio Sources/Noise
fr: /Source audio/Bruit
it: /Audio Sorgenti/Rumore
ne: /अडियो स्रोत/हल्ला

source: /Audio Sources/Standard Oscillator
fr: /Sources audio/Oscillateur standard
it: /Audio Sorgenti/Oscillatore Standard
ja: /オーディオソース/標準発振器
ne: /अडियो स्रोत/स्ट्यान्डर्ड ओस्सिलेटर

source: /Audio Sources/Wave Oscillator
fr: /Sources audio/Oscillateur d'onde
it: /Audio Sorgenti/Oscillatore di Forme d'Onda
ja: /オーディオソース/波形発振器
ne: /अडियो स्रोत/तरङ्ग ओस्सिलेटर

source: /Enhance/ArtsCompressor
fr: /Avancé/ArtsCompressor
ja: /拡張/ArtsCompressor
ne: /बढाउनुहोस्/आर्ट कम्प्रेसर

source: /Enhance/Chorus
fr: /Avancé/Chorus
it: /Incrementa/Chorus
ja: /拡張/コーラス
ne: /बढाउनुहोस्/कोरस

source: /Filters/Bass Filter
fr: /Filtres/Filtres de basses
it: /Filtri/Filtro Basso
ja: /フィルター/バスフィルター
ne: /फिल्टर/ब्यास फिल्टर

source: /Filters/Biquad Types
fr: /Filtres/Types Biquad
ja: /フィルター/四乗べき
ne: /फिल्टर/बिक्वाइड प्रकार

source: /Input & Output/Instrument Output
fr: /Entrées Sorties/Sortie de la voix d'un instrument
it: /Ingresso & Uscita/Uscita Strumento
ja: /入出力/インストゥルメント出力
ne: /आगत र निर्गत/ बाजा निर्गत

source: /Input & Output/Instrument Voice Input
fr: /Entrées Sorties/Entrée de la voix d'un instrument
it: /Ingresso & Uscita/Ingresso Strumento Voce
ja: /入出力/インストゥルメント音声入力
ne: /निर्गत र आगत/बाजाको स्वर निर्गत

source: /Input & Output/MIDI Control Input
fr: /Entrées Sorties/Entrée du contrôle MIDI
it: /Ingresso & Uscita/Ingresso Controllo MIDI
ja: /入出力/MIDI コントロール入力
ne: /आगत र निर्गत/मिडि नियन्त्रण आगत

source: /Input & Output/MIDI Voice Input
fr: /Entrées Sorties/Entrée de la voix MIDI
it: /Ingresso & Uscita/Ingresso Voce MIDI
ja: /入出力/MIDI 音声入力
ne: /आगत र निर्गत/ मिडि स्वर आगत

source: /Input & Output/PCM Input
fr: /Entrées Sorties/Entrée PCM
it: /Ingresso & Uscita/Ingresso PCM
ja: /入出力/PCM 入力
ne: /आगत र निर्गत/PCM आगत

source: /Input & Output/PCM Output
fr: /Entrées Sorties/Sortie PCM
it: /Ingresso & Uscita/Uscita PCM
ja: /入出力/PCM 出力
ne: /आगत र निर्गत/PCM आगत

source: /Misc/Snooper
fr: /Divers/Surveillant
ja: /その他/スヌーパー
ne: /मिस्क/स्नुपर

source: /Other Sources/Constant
fr: /Autres sources/Constantes
it: /Altre Sorgenti/Costante
ja: /他のソース/一定
ne: /अन्य स्रोत/अचल

source: /Routing/Amplifier
fr: /Routage/Amplification
it: /Instradamento/Amplificatore
ja: /ルーティング/アンプ
ne: /राउटिङ/एम्प्लिफायर

source: /Virtualization/Virtual Input
fr: /Virtualisation/Entrée virtuelle
it: /Virtualizzazione/Ingresso Virtuale
ja: /仮想化/仮想入力
ne: /भर्चुलाइजेसन/अवास्तविक आगत

source: /Virtualization/Virtual Output
fr: /Virtualisation/Sortie virtuelle
it: /Virtualizzazione/Uscita Virtuale
ja: /仮想化/仮想出力
ne: /भर्चुलाइजेसन/अवास्तविक निर्गत

source: /Virtualization/Virtual Sub Synth
fr: /Virtualisation/ Sous-synthétiseur virtuel
it: /Virtualizazione/Sub Synth Virtuale
ja: /仮想化/仮想サブシンセ
ne: भर्चुलाइजेसन/अवास्तविक सब सिन्थ

source: 1024 Value FFT Window
fr: Fenêtre TFR 1024 points
it: Finestra con 1024 valori FFT
ja: 1024 値 FFT ウィンドウ
ne: १०२४ मान FFT सञ्झ्याल

source: 12 Tone Equal Temperament
fr: Tempérament à 12 tons égaux

source: 128 Value FFT Window
fr: Fenêtre TFR 128 points
it: Finestra con 128 valori FFT
ja: 128 値 FFT ウィンドウ
ne: १२८ मान FFT सञ्झ्याल

source: 16 Value FFT Window
fr: Fenêtre TFR 16 points
it: Finestra con 16 valori FFT
ja: 16 値 FFT ウィンドウ
ne: १६ मान FFT सञ्झ्याल

source: 16384 Value FFT Window
fr: Fenêtre TFR 16384 points
it: Finestra con 16384 valori FFT
ja: 16384 値 FFT ウィンドウ
ne: १६३८४ मान FFT सञ्झ्याल

source: 2 Value FFT Window
fr: Fenêtre TFR 2 points
it: Finestra con 2 valori FFT
ja: 2 値 FFT ウィンドウ
ne: २ मान FFT सञ्झ्याल

source: 2048 Value FFT Window
fr: Fenêtre TFR 2048 points
it: Finestra con 2048 valori FFT
ja: 2048 値 FFT ウィンドウ
ne: २०४८ मान FFT सञ्झ्याल

source: 256 Value FFT Window
fr: Fenêtre TFR 256 points
it: Finestra con 256 valori FFT
ja: 256 値 FFT ウィンドウ
ne: २५६ मान FFT सञ्झ्याल

source: 32 Value FFT Window
fr: Fenêtre TFR 32 points
it: Finestra con 32 valori FFT
ja: 32 値 FFT ウィンドウ
ne: ३२ मान FFT सञ्झ्याल

source: 32768 Value FFT Window
fr: Fenêtre TFR 32768 points
it: Finestra con 32768 valori FFT
ja: 32768 値 FFT ウィンドウ
ne: ३२७६८ मान FFT सञ्झ्याल

source: 4 Value FFT Window
fr: Fenêtre TFR 4 points
it: Finestra con 4 valori FFT
ja: 4 値 FFT ウィンドウ
ne: ४ मान FFT सञ्झ्याल

source: 4096 Value FFT Window
fr: Fenêtre TFR 4096 points
it: Finestra con 4096 valori FFT
ja: 4096 値 FFT ウィンドウ
ne: ४०९६ मान FFT सञ्झ्याल

source: 5 Tone Equal Temperament
fr: Tempérament 5 tons égaux

source: 512 Value FFT Window
fr: Fenêtre TFR 512 points
it: Finestra con 512 valori FFT
ja: 512 値 FFT ウィンドウ
ne: ५१२ मान FFT सञ्झ्याल

source: 64 Value FFT Window
fr: Fenêtre TFR 64 points
it: Finestra con 64 valori FFT
ja: 64 値 FFT ウィンドウ
ne: ६४ मान FFT सञ्झ्याल

source: 65536 Value FFT Window
fr: Fenêtre TFR 65536 points
it: Finestra con 65536 valori FFT
ja: 65536 値 FFT ウィンドウ
ne: ६५५३६ मान FFT सञ्झ्याल

source: 7 Tone Equal Temperament
fr: Tempérament 7 tons égaux

source: 8 Value FFT Window
fr: Fenêtre TFR 8 points
it: Finestra con 8 valori FFT
ja: 8 値 FFT ウィンドウ
ne: ८ मान FFT सञ्झ्याल

source: 8192 Value FFT Window
fr: Fenêtre TFR 8192 points
it: Finestra con 8192 valori FFT
ja: 8192 値 FFT ウィンドウ
ne: ८१९२ मान FFT सञ्झ्याल

source: A 1024 value FFT window corresponds to a spectrum with 513 frequency peaks
fr: Une fenêtre de TFR (Transformée de Fourier Rapide) à 1024 points correspond à un spectre avec 513 pics de fréquences
it: Una finestra con 1024 valori FFT corrisponde ad uno spettro con 513 picchi di frequenze
ja: 513 周波数ピークのスペクトルに対する 1024 値 FFT ウィンドウ
ne: १०२४ मान FFT सञ्झ्याल ५१३ आवृति पिकसँगको स्पेकट्रममा अनुरूप हुन्छ

source: A 128 value FFT window corresponds to a spectrum with 65 frequency peaks
fr: Une fenêtre de TFR (Transformée de Fourier Rapide) à 128 points correspond à un spectre avec 65 pics de fréquences
it: Una finestra con 128 valori FFT corrisponde ad uno spettro con 65 picchi di frequenze
ja: 65 周波数ピークのスペクトルに対する 128 値 FFT ウィンドウ
ne: १२८ मान FFT सञ्झ्याल ६५ आवृति पिकसँगको स्पेकट्रममा अनुरूप हुन्छ

source: A 16 value FFT window corresponds to a spectrum with 9 frequency peaks
fr: Une fenêtre de TFR (Transformée de Fourier Rapide) à 16 points correspond à un spectre avec 9 pics de fréquences
it: Una finestra con 16 valori FFT corrisponde ad uno spettro con 9 picchi di frequenze
ja: 9 周波数ピークのスペクトルに対する 16 値 FFT ウィンドウ
ne: १६ मान FFT सञ्झ्याल ९ आवृति पिकसँगको स्पेकट्रममा अनुरूप हुन्छ

source: A 16384 value FFT window corresponds to a spectrum with 8193 frequency peaks
fr: Une fenêtre de TFR (Transformée de Fourier Rapide) à 16384 points correspond à un spectre avec 8193 pics de fréquences
it: Una finestra con 16384 valori FFT corrisponde ad uno spettro con 8193 picchi di frequenze
ja: 8193 周波数ピークのスペクトルに対する 16384 値 FFT ウィンドウ
ne: १६३८४ मान FFT सञ्झ्याल ८१९३ आवृति पिकसँगको स्पेकट्रममा अनुरूप हुन्छ

source: A 2 value FFT window corresponds to a spectrum with 2 frequency peaks
fr: Une fenêtre de TFR (Transformée de Fourier Rapide) à 2 points correspond à un spectre avec 2 pics de fréquences
it: Una finestra con 2 valori FFT corrisponde ad uno spettro con 2 picchi di frequenze
ja: 2 周波数ピークのスペクトルに対する 2 値 FFT ウィンドウ
ne: २ मान FFT सञ्झ्याल २ आवृति पिकसँगको स्पेकट्रममा अनुरूप हुन्छ

source: A 2048 value FFT window corresponds to a spectrum with 1025 frequency peaks
fr: Une fenêtre de TFR (Transformée de Fourier Rapide) à 2048 points correspond à un spectre avec 1025 pics de fréquences
it: Una finestra con 2048 valori FFT corrisponde ad uno spettro con 1025 picchi di frequenze
ja: 1025 周波数ピークのスペクトルに対する 2048 値 FFT ウィンドウ
ne: २०४८ मान FFT सञ्झ्याल १०२५ आवृति पिकसँगको स्पेकट्रममा अनुरूप हुन्छ

source: A 256 value FFT window corresponds to a spectrum with 129 frequency peaks
fr: Une fenêtre de TFR (Transformée de Fourier Rapide) à 256 points correspond à un spectre avec 129 pics de fréquences
it: Una finestra con 256 valori FFT corrisponde ad uno spettro con 129 picchi di frequenze
ja: 129 周波数ピークのスペクトルに対する 256 値 FFT ウィンドウ
ne: २५६ मान FFT सञ्झ्याल १२९ आवृति पिकसँगको स्पेकट्रममा अनुरूप हुन्छ

source: A 32 value FFT window corresponds to a spectrum with 17 frequency peaks
fr: Une fenêtre de TFR (Transformée de Fourier Rapide) à 32 points correspond à un spectre avec 17 pics de fréquences
it: Una finestra con 32 valori FFT corrisponde ad uno spettro con 17 picchi di frequenze
ja: 17 周波数ピークのスペクトルに対する 32 値 FFT ウィンドウ
ne: ३२ मान FFT सञ्झ्याल १७ आवृति पिकसँगको स्पेकट्रममा अनुरूप हुन्छ

source: A 32768 value FFT window corresponds to a spectrum with 16385 frequency peaks
fr: Une fenêtre de TFR (Transformée de Fourier Rapide) à 32768 points correspond à un spectre avec 16385 pics de fréquences
it: Una finestra con 32768 valori FFT corrisponde ad uno spettro con 16385 picchi di frequenze
ja: 16385 周波数ピークのスペクトルに対する 32768 値 FFT ウィンドウ
ne: ३२७६८ मान FFT सञ्झ्याल १६३८५ आवृति पिकसँगको स्पेकट्रममा अनुरूप हुन्छ

source: A 4 value FFT window corresponds to a spectrum with 3 frequency peaks
fr: Une fenêtre de TFR (Transformée de Fourier Rapide) à 4 points correspond à un spectre avec 3 pics de fréquences
it: Una finestra con 4 valori FFT corrisponde ad uno spettro con 3 picchi di frequenze
ja: 3 周波数ピークのスペクトルに対する 4 値 FFT ウィンドウ
ne: ४ मान FFT सञ्झ्याल ३ आवृति पिकसँगको स्पेकट्रममा अनुरूप हुन्छ

source: A 4096 value FFT window corresponds to a spectrum with 2049 frequency peaks
fr: Une fenêtre de TFR (Transformée de Fourier Rapide) à 4096 points correspond à un spectre avec 2049 pics de fréquences
it: Una finestra con 4096 valori FFT corrisponde ad uno spettro con 2049 picchi di frequenze
ja: 2049 周波数ピークのスペクトルに対する 4096 値 FFT ウィンドウ
ne: ४०९६ मान FFT सञ्झ्याल २०४९ आवृति पिकसँगको स्पेकट्रममा अनुरूप हुन्छ

source: A 512 value FFT window corresponds to a spectrum with 257 frequency peaks
fr: Une fenêtre de TFR (Transformée de Fourier Rapide) à 512 points correspond à un spectre avec 257 pics de fréquences
it: Una finestra con 512 valori FFT corrisponde ad uno spettro con 257 picchi di frequenze
ja: 257 周波数ピークのスペクトルに対する 512 値 FFT ウィンドウ
ne: ५१२ मान FFT सञ्झ्याल २५७ आवृति पिकसँगको स्पेकट्रममा अनुरूप हुन्छ

source: A 64 value FFT window corresponds to a spectrum with 33 frequency peaks
fr: Une fenêtre de TFR (Transformée de Fourier Rapide) à 64 points correspond à un spectre avec 33 pics de fréquences
it: Una finestra con 64 valori FFT corrisponde ad uno spettro con 33 picchi di frequenze
ja: 33 周波数ピークのスペクトルに対する 64 値 FFT ウィンドウ
ne: ६४ मान FFT सञ्झ्याल ३३ आवृति पिकसँगको स्पेकट्रममा अनुरूप हुन्छ

source: A 65536 value FFT window corresponds to a spectrum with 32769 frequency peaks
fr: Une fenêtre de TFR (Transformée de Fourier Rapide) à 65536 points correspond à un spectre avec 32769 pics de fréquences
it: Una finestra con 65536 valori FFT corrisponde ad uno spettro con 32769 picchi di frequenze
ja: 32769 周波数ピークのスペクトルに対する 65536 値 FFT ウィンドウ
ne: ६५५३६ मान FFT सञ्झ्याल ३२७६९ आवृति पिकसँगको स्पेकट्रममा अनुरूप हुन्छ

source: A 8 value FFT window corresponds to a spectrum with 5 frequency peaks
fr: Une fenêtre de TFR (Transformée de Fourier Rapide) à 8 points correspond à un spectre avec 5 pics de fréquences
it: Una finestra con 8 valori FFT corrisponde ad uno spettro con 5 pichi di frequenze
ja: 5 周波数ピークのスペクトルに対する 8 値 FFT ウィンドウ
ne: ८ मान FFT सञ्झ्याल ५ आवृति पिकसँगको स्पेकट्रममा अनुरूप हुन्छ

source: A 8192 value FFT window corresponds to a spectrum with 4097 frequency peaks
fr: Une fenêtre de TFR (Transformée de Fourier Rapide) à 8192 points correspond à un spectre avec 4097 pics de fréquences
it: Una finestra con 8192 valori FFT corrisponde ad uno spettro con 4097 picchi di frequenze
ja: 4097 周波数ピークのスペクトルに対する 8192 値 FFT ウィンドウ
ne: ८१९२ मान FFT सञ्झ्याल ४०९७ आवृति पिकसँगको स्पेकट्रममा अनुरूप हुन्छ

source: A fairly common tuning system is the five-tone equal temperament tuning system, abbreviated as 5-TET. It divides the octave into 5 equal parts using 240 cent steps.
fr: Le tempérament à cinq tons égaux, abrégé en 5-TET, est un système d'accord assez courant. Il divise l'octave en 5 parts égales de 240 cents.

source: A fairly common tuning system is the seven-tone equal temperament tuning system, abbreviated as 7-TET. It divides the octave into 7 equal parts using 171 cent steps.
fr: Le tempérament à sept tons égaux, abrégé en 7-TET, est un système d'accord assez courant. Il divise l'octave en 7 parts égales de 171 cents.

source: A guide to synthesis plugin development
fr: Un guide pour le développement de greffons de synthèses sonores
it: Una guida per lo sviluppo dei plugin
ja: シンセプラグイン開発のガイド
ne: प्लगइन विकास सिन्थेसिस गर्न एउटा बाटोदर्शक

source: A string with _ characters in positions correspond to characters in the text to underline
fr: Une chaîne avec des caractères « _ » dont la position correspond à celle des caractères à souligner dans le texte
it: Una stringa con carattere _ nelle relative posizioni, corrisponde a caratteri nel testo da sottolineare.
ja: テキスト内の _ の付く文字の位置
ne: _ क्यारेक्टरसँगको स्ट्रिङको स्थितिले कच गरिने पाठको क्यारेक्टरसँग अनुरूप हुन्छ

source: ADSR Envelope Generator
fr: Générateur d'enveloppe ADSR (Attaque, Decay, Sustain, Release) (Attaque, Extinction, Maintien, Décroissance)
it: Generatore d'Inviluppo ADSR
ja: ADSR エンベロープジェネレータ
ne: ADSR खाम जेनेरेटर

source: Aborted
fr: Interrompu
it: Annullato
ja: 中止されました
ne: परित्याग गरियो

source: Abortion
fr: Annulation
it: Interruzione imprevista
ja: 中止
ne: एबोर्सन

source: Add
fr: Ajouter
it: Aggiungi
ja: 追加
ne: थप्नुहोस्

source: Add Custom Synthesizer
fr: Ajouter un synthétiseur personnalisé
it: Aggiungi Sintetizzatore Personalizzato
ne: अनुकूलन सिन्थेसाइजर थप्नुहोस्

source: Add MIDI Synthesizer
fr: Ajouter un synthétiseur MIDI
it: Aggiungi Sintetizzatore MIDI
ne: MIDI सिन्थेसाइजर थप्नुहोस्

source: Add a new MIDI synthesizer to control an instrument from external MIDI events
fr: Ajoute un nouveau synthétiseur MIDI pour contrôler un instrument à partir d'événements MIDI externes
it: Aggiungi un nuovo sintetizzatore MIDI per controllare uno strumento da un evento MIDI esterno
ne: बाह्या MIDI घटनाहरूबाट बाजा नियन्त्रण गर्न नयाँ MIDI सिन्थेसाइजर थप्नुहोस्

source: Add a new bus to the mixer
fr: Ajoute une nouvelle voix à la table de mixage
it: Aggiungi un nuovo bus al mixer
ne: मिक्सरमा नयाँ बस थप्नुहोस्

source: Add a new synthesizer mesh to be used as effect or instrument in songs
fr: Ajoute une nouvelle trame de synthèse à utiliser en temps qu'effet ou instrument dans des mélodies
it: Aggiungi una nuova rete sintetizzatrice da poter usare come effetto e/o strumento nelle composizioni
ne: प्रभाव वा गीतमा बाजाको रूपमा प्रयोग गर्न नयाँ सिन्थेसाइजर मेस थप्नुहोस्

source: Add a new track to this song
fr: Ajoute une nouvelle piste à cette mélodie
it: Aggiungi una nuova traccia a questa canzone
ja: 新しいトラックをこの曲に追加
ne: यो गीतमा नयाँ ट्र्याक थप्नुहोस्

source: Add directory to searchpath
fr: Ajouter le répertoire au chemin de recherche
it: Aggiungi directory dal percorso di ricerca
ja: 検索パスにディレクトリを追加
ne: खोजी बाटोमा डाइरेक्टरी थप्नुहोस्

source: Add, edit and connect synthesizer mesh components
fr: Ajoute, édite et connecte les composants d'une trame de synthèse

source: Add...
fr: Ajouter...
it: Aggiungi...
ja: 追加...
ne: थप्नुहोस्...

source: Adds the selection from the "%s" list to the "%s" list
fr: Ajoute la sélection de la liste « %s » dans la liste « %s »
it: Aggiungi la selezione dalla lista "%s" alla lista "%s"
ja: "%s"リストから選択して"%s"リストへ追加
ne: "%s" सूचीबाट "%s" सूचीमा चयन थप्दछ

source: Adjust FFT window size
fr: Ajuste la taille de la fenêtre TFR (Transformée de Fourrier Rapide)
it: Regola ampiezza finestra d'applicazione della FFT
ja: FFT ウィンドウサイズを調整
ne: FFT सञ्झ्याल साइज समायोजन गर्नुहोस्

source: Adjust frequency level threshold
fr: Ajuste le seuil du niveau de fréquence
it: Regola livello di soglia della frequenza
ja: 周波数レベル閾値を調整
ne: आवृत्ति तह थ्रेसहोल्ड समायोजन गर्नुहोस्

source: Adjust how much the control signals affect the output balance
fr: Ajuste de combien le signal de contrôle affecte la balance en sortie
it: Regola di quanto il controllo del segnale deve avere effetto sul bilanciamento d'uscita
ja: 出力バランスに影響させるコントロール信号を調整
ne: निर्गत सन्तुलनलाई नियन्त्रण सङ्केतहरूले कत्तिको प्रभाव पार्छ भनेर समायोजन गर्नुहोस्

source: Adjust how much the control signals affect the output volume
fr: Ajuste de combien le signal de contrôle affecte le volume de sortie
it: Regolazione dell'intensità del segnale di controllo sul volume d'uscita
ja: コントロール信号の出力音量に対する影響がどれぐらいか調整
ne: आगत भोल्युम नियन्त्रण सङ्केतले कत्तिको प्रभाव पार्दछ भन्ने समायोजन गर्नुहोस्

source: Adjust output balance between left and right
fr: Ajuste la balance de sortie entre droite et gauche
it: Regola il bilanciamento d'uscita tra il canale destro e sinistro
ja: 左右の出力バランスを調整
ne: बायाँ र दायाँ बीचमा निर्गतको सन्तुलन समायोजन गर्नुहोस्

source: Adjust overall program behaviour
fr: Paramètre le comportement global du programme
it: Imposta comportamento complessivo del programma
ja: プログラム全般の動作を調整
ne: सम्पुर्ण कार्यक्रम व्यवहार समायोजन गर्नुहोस्

source: Adjust overall song behaviour
fr: Ajuste le comportement général de la mélodie
it: Imposta comportamento generale della canzone
ja: 曲全般の動作を調整
ne: सम्पूर्ण गीतको स्वभाव समायोजन गर्नुहोस्

source: Adjust overall synthesizer behaviour
fr: Ajuste le comportement général du synthétiseur
it: Imposta comportamento generale del sintetizzatore
ja: シンセ全般の動作を調整
ne: सबै सिन्थेसाइजर स्वभाव समायोजन गर्नुहोस्

source: Adjust relative alignment of the values or bars to be drawn
fr: Ajuste l'alignement relatif des valeurs ou du tracé des barres
it: Regola l'allineamento relativo dei valori e/o delle misure al fine di essere disegnati
ja: ドラムへの値とバーの相対位置を調整
ne: कोर्नका लागि मान वा बार सम्बन्धित पङ्क्तिबद्धता समायोजन गर्नुहोस्

source: Adjust the number of rows between each shaded row
fr: Définit le nombre de lignes entre chaque ligne ombrée
it: Decidi il numero delle righe tra due righe di colore più scuro
ja: 隠された列毎に間に調整する列の数
ne: प्रत्येक छायाँकरण गरिएको पङ्क्ति बिच पङ्क्तिको सङ्ख्या समायोजन गर्दछ

source: Adjust the output amplification automatically according to threshold and ratio
fr: Ajuste l'amplification de sortie automatiquement selon le seuil et le ratio
it: Regola l'amplificazione d'uscita automaticamente in funzione della soglia (threshold) e del rapporto
ne: थ्रेसहोल्ड र भाग अनुसार एम्प्लिफिकेसनको आगत स्वत: समायोजन गर्नुहोस्

source: Adjust the zoom factor of the router display
fr: Ajuste le facteur de zoom de l'affichage du routage
it: Regola il fattore di ingrandimento della finestra d'instradamento
ja: ルーターディスプレイのズーム比率を調整
ne: राउटर प्रदर्शनको जुम तत्व समायोजन गर्नुहोस्

source: Adjust whether to draw dB values instead of lines
fr: Choisit d'écrire les valeurs en dB plutôt que des lignes
it: Imposta se visualizzare il valore in dB invece che lineare
ja: 線の代りに dB 値を表示するかどうか設定
ne: पङ्क्तिको सट्टा डी बी मान समायोजन गर्नुहोस्

source: Adjustments
fr: Ajustements
it: Regolazioni
ja: 調整
ne: समायोजन
