Repository: tim-janik/beast
Catalog: po/*.po
Languages: fr, it, ja, ne

source: Repeat
fr: Répéter
it: Ripeti
ja: 繰り返し
ne: दोहोर्याउनुस्

source: Repeat playback within loop points
fr: Répète l'interprétation entre les limites de la boucle
it: Ripeti esecuzione all'interno dei punti ciclici
ja: ループ点なしに再生を繰り返し
ne: लूप बिन्दु बीचमा प्लेब्याक दोहोर्याउनुहोस्

source: Report a Beast Bug...
fr: Soumettre un rapport d'anomalie concernant Beast...
it: Riporta un bug di Beast...

source: Requested data values unmatched
fr: Pas de correspondance des valeurs des données requises
it: I dati richiesti presentano valori non coincidenti
ne: अनुरोध गरिएको डेटाको मान अमिल्दो

source: Reset Properties
fr: Réinitialise les propriétés
it: Azzera proprietà
ja: プロパティをリセット
ne: गुण रिसेट गर्नुहोस्

source: Resize Control Event
fr: Redimensionner un événement de contrôle
it: Ridimensiona Controllo Evento
ja: コントロールイベントをリサイズ
ne: नियन्त्रण घटना रिसाइज गर्नुहोस्

source: Resize Note
fr: Redimensionner la note
it: Ridimensiona Nota
ja: ノートをリサイズ
ne: द्रष्टव्य रिसाइज गर्नुहोस्

source: Resonance
fr: Résonance
it: Risonanza

source: Resonance [%]
fr: Résonance [%]
it: Risonanza [%]
ja: レゾナンス [%]
ne: रेसोनान्स [%]

source: Restarting Playback
fr: Redémarrer la lecture
it: Esecuzione Riavviata
ja: 再生を再度開始
ne: प्लेब्याक फेरि सुरु हुँदैछ

source: Retrieve master output bus of a song if it exists.
fr: Retrouve le bus maître de sortie d'une mélodie, s'il existe.
it: Recupera, se esiste, il bus master d'uscita di una canzone.
ne: यदि यो अवस्थित छैन भने गीतको मास्टर आगत बस पुन: प्राप्त गर्नुहोस्

source: Retrieve master output bus of a song, will create one if it doesn't exist.
fr: Retrouve le bus maître de sortie pour une mélodie ; en crée un s'il n'existe pas.
it: Recupera il bus master d'uscita di una canzone. Ne verrï¿½ creato uno se esso non esiste.
ne: गीतको मास्टर आगत बस पुन: प्राप्त गर्नुहोस्, यदि यो अवस्थित छैन भने एउटा सिर्जना गर्दछ

source: Retrieve song timing information at a specific tick.
fr: Retrouve les informations de tempo de la mélodie pour une fréquence de tops d'horloge donnée.
it: Richiama le informazioni di sincronizzazione di una canzone ad un bpm specifico.
ja: 指定したティックでの曲のタイミング情報を取得
ne: गीत समय सूचना उचित टिकमा पुन: प्राप्त गर्नुहोस्

source: Retrigger input (raising edge retriggers envelope)
fr: Entrée retrigger (l'impulsion montante déclenche à nouveau l'enveloppe)
ja: 再トリガー入力 (レイズ端再トリガーエンベロープ)
ne: रेट्रिग्गर आगत (कुना बढाइएको रेट्रिग्गर खाम)

source: Right
fr: Droite
it: Destra
ja: 右
ne: दायाँ

source: Right Audio
fr: Audio droite
it: Audio Destro
ja: 右オーディオ
ne: दायाँ अडियो

source: Right Audio In
fr: Entrée audio droit
it: Ingresso Audio Destro
ja: 右オーディオ入力
ne: दायाँ अडियो आगत

source: Right Audio Input
fr: Entrée audio droite
it: Ingresso Audio Destro
ja: 右オーディオ入力
ne: दायाँ अडियो आगत

source: Right Audio Out
fr: Sortie audio droit
it: Uscita Audio Destra
ja: 右オーディオ出力
ne: दायाँ अडियो निर्गत

source: Right Audio Output
fr: Sortie audio droite
it: Uscita Audio Destra
ja: 右オーディオ出力
ne: दायाँ अडियो निर्गत

source: Right Channel Output
fr: Sortie audio du canal droit
it: Uscita Canale Destro
ja: 右チャネル出力
ne: दायाँ च्यानल आगत

source: Right In
fr: Entrée droite
it: Ingr.Destro
ja: 右入力
ne: भित्री दायाँ

source: Right Input
fr: Entrée droite
it: Ingresso Destro
ja: 右入力
ne: दायाँ आगत

source: Right Out
fr: Sortie droite
it: Uscita Destra
ja: 右出力
ne: दायाँ बाहिर

source: Right Output
fr: Sortie droite
it: Uscita Destra
ja: 右出力
ne: दायाँ निर्गत

source: Right Volume
fr: Volume du canal droit
it: Volume Destro
ja: 右音量
ne: दायाँ भोल्युम

source: Right audio output
fr: Sortie audio droite
it: Uscita audio destra
ja: 右オーディオ出力
ne: दायाँ अडियो निर्गत

source: Right channel Input
fr: Entrée du canal droit
it: Ingresso canale destro
ja: 右チャネル入力
ne: दायाँ च्यानल आगत

source: Right channel input
fr: Entrée du canal de droite
it: Ingresso canale destro
ja: 右チャネル入力
ne: दायाँ च्यानल आगत

source: Right channel output
fr: Sortie du canal droit
it: Uscita canale destro
ja: 右チャネル出力
ne: दायाँ च्यानल निर्गत

source: Right to Left
fr: Droite à gauche
it: Da destra a sinistra

source: Routing
fr: Routage
it: Instradamento
ja: ルーティング
ne: कार्यतालिका

source: Row Shading
fr: Ombrage lignes
it: Ombreggiatura Righe
ja: 隠す列数
ne: पङ्क्ति छायाँकरण

source: Sample Path
fr: Chemin des échantillons
it: Percorso Campioni
ja: サンプルパス
ne: नमूना बाटो

source: Sample or instrument name
fr: Nom de l'instrument ou de l'échantillon
it: Nome del Campione e/o dello Strumento
ne: नमूना वा बाजाको नाम

source: Save As Effect...
fr: Enregistrer en tant qu'effet...
it: Salva Effetto con Nome...
ne: प्रभावको रूपमा बचत गर्नुहोस्...

source: Save As Instrument...
fr: Enregistrer en tant qu'instrument...
it: Salva Strumento con Nome...
ne: बाजाको रूपमा बचत गर्नुहोस्...

source: Save Changes
fr: Enregistrer les modifications
it: Salva le Modifiche
ne: परिवर्तन बचत गर्नुहोस्

source: Save Effect
fr: Enregistrer l'effet
it: Salva Effetto
ja: エフェクトを保存
ne: प्रभाव बचत गर्नुहोस्

source: Save Instrument
fr: Enregistrer l'instrument
it: Salva Strumento
ja: インストゥルメントを保存
ne: बाजा बचत गर्नुहोस्

source: Save _As...
fr: Enregistrer _sous...
it: S_alva con Nome...
ja: 別名で保存(_A)...
ne: यस रूपमा बचत गर्नुहोस्...

source: Save synthesizer mesh to effects folder
fr: Enregistre une trame de synthèse dans le dossier des effets
it: Salva rete sintetizzatrice nella cartella degli effetti
ja: エフェクトフォルダにシンセサイザメッシュを保存
ne: सिन्थेसाइजर मेस प्रभाव फोल्डरमा बचत गर्नुहोस्

source: Save synthesizer mesh to instruments folder
fr: Enregistre une trame de synthèse dans le dossier des instruments
it: Salva rete sintetizzatrice nella cartella degli strumenti
ja: インストゥルメントフォルダにシンセサイザメッシュを保存
ne: सिन्थेसाइजर मेस बाजा फोल्डरमा बचत गर्नुहोस्

source: Save the project before closing its window?
fr: Voulez-vous enregistrer le projet avant de fermer sa fenêtre ?
it: Vuoi salvare il progetto prima di chiuderne la finestra?
ne: यसको सञ्झ्याल बन्द गर्नु पहिले परियोजना बचत गर्नुहुन्छ ?

source: Save: %s
fr: Enregistrer : %s
it: Salva: %s
ja: 保存: %s
ne: बचत गर्नुहोस्: %s

source: Saving effect `%s'
fr: Enregistrement de l'effet « %s »
it: Salvataggio Effetto `%s'
ja: エフェクト '%s' を保存中
ne: प्रभाव `%s' बचत हुँदैछ

source: Saving instrument `%s'
fr: Enregistrement de l'instrument « %s »
it: Salvataggio strumento `%s'
ja: インストゥルメント '%s' を保存中
ne: बाजा `%s' बचत गर्दैछ

source: Saving project `%s'
fr: Enregistrement du projet « %s »
it: Salvataggio progetto `%s'
ja: プロジェクト '%s' を保存中
ne: परियोजना `%s' बचत हुँदैछ

source: Script Path
fr: Chemin des scripts
it: Percorso Scripts
ja: スクリプトパス
ne: स्क्रिप्ट बाटो

source: Script execution error.
fr: Erreur lors de l'exécution du script.
it: Errore nell'esecuzione dello script.
ne: कार्यविधि कार्यान्वयन त्रुटि

source: Scroll Both
fr: Défilement simultané
it: Scorri Entrambi le direzioni
ja: 両方スクロール
ne: दुबै स्क्रोल गर्नुहोस्

source: Scroll Left
fr: Défilement gauche
it: Scorri a Sinistra
ja: 左へスクロール
ne: बायाँ स्क्रोल गर्नुहोस्

source: Scroll None
fr: Aucun défilement
it: Nessun Scorrimento
ja: スクロールしない
ne: कुनै पनि स्क्रोल नगर्नुहोस्

source: Scroll Right
fr: Défilement droit
it: Scorri a Destra
ja: 右へスクロール
ne: दायाँ स्क्रोल गर्नुहोस्

source: Search Paths
fr: Chemins de recherche
it: Cerca Locazioni
ja: 検索パス
ne: खोजी बाटो

source: Searchpath Text Entry
fr: Saisie texte du chemin de recherche
it: Inserisci testo da ricercare
ja: 検索パス テキストエントリ
ne: खोजी बाटो पाठ प्रविष्टि

source: Second audio input
fr: Deuxième entrée audio
it: Secondo Input Audio
ja: 第二オーティオ入力
ne: दोस्रो अडियो आगत

source: Second control input
fr: Entrée du deuxième contrôle
it: Secondo Controllo d'Ingresso
ja: 第二コントロール入力
ne: दोस्रो नियन्त्रण आगत

source: Second filter cutoff frequency
fr: Fréquence de coupure du deuxième filtre

source: Seek failed
fr: Échec lors de la recherche
it: Ricerca fallita
ne: खोज्न असफल

source: Select
fr: Sélectionner
it: Seleziona
ja: 選択
ne: चयन गर्नुहोस्

source: Select Color
fr: Choisir une couleur
it: Seleziona Colore
ja: 色を選択
ne: रङ चयन गर्नुहोस्

source: Select Directory
fr: Sélectionner un répertoire
it: Seleziona Cartella
ja: ディレクトリを選択
ne: डाइरेक्टरी चयन गर्नुहोस्

source: Select File
fr: Sélectionner un fichier
it: Seleziona File
ja: ファイルを選択
ne: फाइल चयन गर्नुहोस्

source: Select Region
fr: Sélectionner une région
it: Seleziona Regione
ja: 範囲を選択
ne: क्षेत्र चयन गर्नुहोस्

source: Select all events
fr: Sélectionner tous les événements
it: Seleziona tutti gli eventi
ne: सबै घटना चयन गर्नुहोस्

source: Select all notes
fr: Sélectionne toutes les notes
it: Seleziona tutte le note
ne: सबै द्रष्टव्यहरू चयन गर्नुहोस्

source: Select input module
fr: Sélectionne le module d'entrée
it: Seleziona modulo d'ingresso
ja: 入力モジュールを選択
ne: आगत मोड्युल चयन गर्नुहोस्

source: Select output module
fr: Sélectionne le module de sortie
it: Seleziona modulo d'uscita
ja: 出力モジュールを選択
ne: निर्गत मोड्युल चयन गर्नुहोस्

source: Select tick range vertically
fr: Sélection verticale d'une plage de tops d'horloge
it: Seleziona la risoluzione verticale
ja: ティック範囲を垂直方向に選択
ne: टिक दायरा ठाडो तरिकाले चयन गर्नुहोस्

source: Self Modulation [%]
fr: Auto-modulation [%]
it: Auto Modulazione [%]
ja: 自己変調 [%]
ne: स्वत: मोड्युलेसन [%]

source: Set the amount of modified data to mix
fr: Définit la quantité de données modifiées à remixer
it: Imposta la quantità di dati modificati da miscelare
ja: ミックスするために変更されるデータの総計を設定
ne: परिमार्जन गरिएको डेटा मिश्रणको रकम सेट गर्नुहोस्

source: Set the amount of resonance in percent
fr: Définit le taux de résonance en pourcentage
it: Imposta l'ammontare della risonanza in %
ja: レゾナンス比率を設定
ne: रेसोनान्सको रकम प्रतिशतमा सेट गर्नुहोस्

source: Set the attack time in milliseconds
fr: Définit la durée d'attaque en millisecondes
it: Imposta il tempo di Attacco in millisecondi
ja: アタック時間 [ms] を設定
ne: मिलिसेकेन्डमा आक्रमणको समय सेट गर्नुहोस्

source: Set the base octave
fr: Définit l'octave de base
it: Imposta l'ottava di base
ja: 基音を設定
ne: आधार ओक्टेभ सेट गर्नुहोस्

source: Set the compression ratio to x:1
fr: Définit le ratio de compression à x:1
it: Imposta il rapporto di compressione a x:1
ne: कम्प्रेसन भाग x:१ सेट गर्नुहोस्

source: Set the cutoff frequency percentage
fr: Définit le pourcentage de fréquence de coupure
it: Imposta la Frequenza di Taglio (Cutoff) in %
ja: カットオフ周波数比率を設定
ne: काटिएको आवृति प्रतिशत सेट गर्नुहोस्

source: Set the decay length in percent
fr: Définit la durée d'extinction en pourcentage
it: Imposta la durata del decadimento in %
ja: 減衰長を設定
ne: डिके लम्बाइ प्रतिशतमा सेट गर्नुहोस्

source: Set the envelope magnitude in percent
fr: Définit l'amplitude de l'enveloppe en pourcentage
it: Imposta l'ampiezza dell'inviluppo in %
ja: エンベロープマグニチュードを設定
ne: खामको म्याग्निट्युड प्रतिशतमा सेट गर्नुहोस्

source: Set the feedback amount; a negative feedback inverts the signal
fr: Définit le taux de rétroaction ; une rétroaction négative inverse le signal

source: Set the focus cell note
fr: Définir la note dans la cellule ayant le focus
it: Imposta la nota nella cella con il focus attivo
ja: フォーカスセルノートを設定
ne: फोकस कक्ष द्रष्टव्य सेट गर्नुहोस्

source: Set the focus cell octave
fr: Définit l'octave de la cellule ayant le focus
it: Imposta l'ottava sulla cella con focus attivo
ja: フォーカスセルオクターブを設定
ne: फकस कक्ष ओक्टेभ सेट गर्नुहोस्

source: Set the focus cell to the bottommost position possible
fr: Place le focus à la plus à basse position possible
it: Imposta il focus sulla cella alla posizione più bassa possibile
ja: 可能な限り最も下のセルにフォーカス
ne: फोकस कक्ष सम्भव भएको तलतिरको स्थानमा सेट गर्नुहोस्

source: Set the focus cell to the leftmost position possible
fr: Place le focus à la position la plus à gauche possible
it: Imposta il focus sulla cella alla posizione più a sinistra possibile
ja: 可能な限り最も左のセルにフォーカス
ne: फोकस कक्ष सम्भव भएको बायाँतिरको स्थानमा सेट गर्नुहोस्

source: Set the focus cell to the rightmost position possible
fr: Place le focus à la position la plus à droite possible
it: Imposta il focus sulla cella alla posizione più a destra possibile
ja: 可能な限り最も右のセルにフォーカス
ne: फोकस कक्ष सम्भव भएको दायाँतिरको स्थानमा सेट गर्नुहोस्

source: Set the focus cell to the topmost position possible
fr: Place le focus à la plus haute position possible
it: Imposta il focus sulla cella alla posizione più alta possibile
ja: 可能な限り最も上のセルにフォーカス
ne: फोकस कक्ष माथिल्लो सम्भव स्थानमा सेट गर्नुहोस्

source: Set the number of steps to make when moving to the next cell
fr: Définit le nombre de pas à effectuer lors du déplacement vers la cellule suivante
it: Imposta il numero di spostamenti da fare quando vuoi muoverti alla cella successiva
ja: 次のセルに移動するときのステップ数を設定
ne: अर्को कक्षमा जाँदा कतिवटा चरणमा पार गर्ने नम्बर सेट गर्नुहोस्

source: Set the output amplification
fr: Définit l'amplification en sortie
it: Imposta l'amplificazione d'uscita
ja: 出力増幅率を設定
ne: आगत एम्प्लिफिकेसन सेट गर्नुहोस्

source: Set the release time in milliseconds
fr: Définit la durée de décroissance en millisecondes
it: Imposta il tempo di Rilascio in millisecondi
ja: リリース時間 [ms] を設定
ne: मिलिसेकेन्डमा छाड्ने समय सेट गर्नुहोस्

source: Sets the value of the focus digit
fr: Définit la valeur du chiffre ayant le focus
it: Imposta il valore della cella con focus attivo
ja: フォーカスしている数字の値を設定
ne: फोकस अङ्कको मान सेट गर्दछ

source: Shape Average
fr: Forme moyenne
it: Regolazione media
ja: シェープ平均
ne: औसत आकार

source: Shape Maximum
fr: Forme maximum
it: Regolazione massima
ja: シェープ最大
ne: उच्चतम आकार

source: Shape Minimum
fr: Forme minimum
it: Regolazione minima
ja: シェープ最小
ne: न्युनतम आकार

source: Shape Range
fr: Forme enveloppe
it: Intervallo di regolazione
ja: シェープ範囲
ne: आकारको दायरा

source: Show Info
fr: Affiche les informations
it: Mostra Info
ja: 情報を表示
ne: सूचना देखाउनुहोस्

source: Shrink Horizontally
fr: Réduire horizontalement
it: Riduci Orizzontalmente
ja: 水平方向に畳む
ne: तेर्सो रूपमा खुम्च्यानुहोस्

source: Shrink Vertically
fr: Réduire verticalement
it: Riduci Verticalmente
ja: 垂直方向に畳む
ne: ठाडो रूपमा खुम्च्याउनुहोस्

source: Shrink the scrollable area
fr: Réduire la zone de défilement
it: Riduce l'area da scorrere
ja: スクロール可能なエリアを畳む
ne: स्क्रोल गर्न योग्य क्षेत्र खुम्च्याउनुहोस्

source: Signal In
fr: Signal d'entrée
it: Ingr.Segnale
ja: 信号入力
ne: सङ्केत भित्री

source: Signal Inputs
fr: Entrées du signal
it: Segnale Ingressi
ja: 信号入力
ne: सङ्केत आगत

source: Signal Outputs
fr: Sorties du signal
it: Segnale Uscite
ja: 信号出力
ne: सङ्केत आगत

source: Silbermann-Sorge Temperament
fr: Tempérament Silbermann-Sorge

source: Single Edit
fr: Édition simple
it: Modifica Singola
ja: シングルエディット
ne: एकल सम्पादन

source: Sixteenth note
fr: Double croche
it: Nota da un Sedicesimo (semicroma)
ja: 16 分ノート
ne: सोर्हौं द्रष्टव्य

source: Sixty-fourth note
fr: Quadruple croche
it: Nota da un Sessantaquattresimo (semibiscroma)
ja: 64 分ノート
ne: चौसठ्ठिऔं द्रष्टव्य

source: Size
fr: Taille
it: Dimensione
ne: साइज

source: Sketch Average
fr: Courbe moyenne
ja: スケッチ平均
ne: औसत रूपरेखा

source: Sketch Maximum
fr: Courbe maxima
ja: スケッチ最大
ne: उच्चतम रूपरेखा

source: Sketch Minimum
fr: Courbe minima
ja: スケッチ最小
ne: न्युनतम रूपरेखा

source: Sketch Range
fr: Courbe enveloppe
ja: スケッチ範囲
ne: रूपरेखा दायरा

source: Skin
fr: Apparence
it: Interfaccia
ja: スキン
ne: स्किन

source: Skin Name
fr: Nom du thème d'apparence
it: Nome Interfaccia
ja: スキン名
ne: स्किन नाम

source: Slow scopes
fr: Ralentir l'affichage
ne: ढिलो क्षेत्र

source: Snap Factor [%]
fr: Facteur de claquement [%]

source: Snappiness of the string
fr: Claquement de la corde

source: Snoop Signal
fr: Signal de surveillance
ja: 信号をスヌープ
ne: स्नुप सङ्केत

source: Sole Output
fr: Sortie unique
it: Uscita Unica
ja: 単一出力
ne: सोल निर्गत

source: Solo: mute all other busses
fr: Solo : coupe tous les autres bus
it: Solo: silenzia tutti gli altri bus
ja: ソロ: 他のすべてのバスをミュート
ne: एकल: अरू बसलाई मौन गराउनुहोस्

source: Song: %s
fr: Mélodie : %s
it: Canzone: %s
ja: 曲: %s
ne: गीत: %s

source: Spectrograph
fr: Spectrographe
it: Spettrografo
ja: スペクトログラフ
ne: स्पेकटोग्राफ

source: Spin Button
fr: Bouton rotatif
it: Pulsante SPin
ja: スピンボタン
ne: स्पिन बटन

source: Spin Button (Logarithmic)
fr: Bouton rotatif (logarithmique)
it: Pulsante Spin (Logaritmico)
ja: スピンボタン(対数)
ne: स्पिन बटन (लोगारिथ्मिक)

source: Splash Image
fr: Image d'accueil
it: Immagine d'Avvio
ja: スプラッシュイメージ
ne: स्प्ल्यास छवि

source: Standard Option Menu
fr: Menu d'options standard
it: Menù opzioni standard
ja: 標準オプションメニュー
ne: मानक विकल्प मेनु

source: Standard amplifier module
fr: Module amplificateur standard
it: Modulo amplificatore standard
ja: 標準アンプモジュール
ne: मानक एम्प्लिफायर मोड्युल

source: Standard oscillator module
fr: Module d'oscillateur standard
it: Modulo oscillatore standard
ja: 標準発振器モジュール
ne: मानक ओसिलेटर मोड्युल

source: StandardOsc is the BSE basis oscillator which supports various types of wave forms and modulation inputs.
fr: « StandardOsc » désigne l'oscillateur BSE de base qui prend en charge divers types de formes d'onde et entrées de modulations.
it: Lo StandardOsc è l'oscillatore basilare di BSE. Supporta diversi tipi di forme d'onda e di modulazione degli ingressi.
ja: StandardOsc は様々な種類の波形と変調入力をサポートする BSE 基本発振器です。
ne: स्ट्यान्डर्डोस्क BSE आधार ओस्सिलेटर हो जसले विभिन्न प्रकारको तरङ्ग फारम र मोड्युलेसन आगत समर्थन गर्दछ ।

source: Start Editor
fr: Démarrer l'éditeur
it: Avvia Editor
ja: エディタ起動
ne: सम्पादनक सुरु गर्नुहोस्

source: Start Procedure
fr: Lancer la procédure
it: Avvia Procedura
ne: कार्यविधि सुरु गर्नुहोस्

source: Start a web browser pointing to online demo songs
fr: Ouvre dans un navigateur Web une connexion sur des mélodies de démonstration
it: Avvia un browser web puntando all'indirizzo delle canzoni demo online
ja: オンラインデモ曲をブラウザで開く
ne: वेब ब्राउजर सूचित अनलाइन डेमो गीत सुरु गर्नुहोस्

source: Start a web browser pointing to the BEAST website
fr: Affiche le site Web de BEAST dans un navigateur
it: Avvia un browser web puntando al sito di BEAST
ja: BEAST ウェブサイトをブラウザで開く
ne: वेब ब्राउजर सूचक BEAST वेबसाइटमा सुरु गर्नुहोस्

source: Start a web browser pointing to the online help desk at the BEAST website
fr: Ouvre dans un navigateur une connexion sur l'aide en ligne du site Web de BEAST
it: Avvia un browser web puntando all'online help desk del sito web di BEAST
ja: BEAST オンラインヘルプデスクサイトをブラウザで開く
ne: वेब ब्राउजर अनलाइन मद्दत डेस्क BEAST वेबसाइटमा सुरु गर्नुहोस्

source: Start a web browser pointing to the online sound archive
fr: Ouvre dans un navigateur Web une connexion sur des archives de sons en ligne
it: Avvia un browser web puntando all'archivio suoni online
ja: オンラインサウンドアーカイブをブラウザで開く
ne: वेब ब्राउजर सूचित अनलाइन ध्वनि सङ्ग्रह सुरु गर्नुहोस्

source: Start a web browser with the bug report form for the BEAST bugzilla product
fr: Ouvre dans un navigateur un formulaire de rapport d'anomalie pour l'application bugzilla de BEAST
it: Avvia un browser web con la form per un report di segnalazione di un bug di BEAST

source: Start:
fr: Début :
it: Inizio:
ja: 開始:
ne: सुरु:

source: Starting Playback
fr: Démarrer la lecture
it: Esecuzione Avviata
ja: 再生を開始
ne: प्लेब्याक सुरु हुँदैछ

source: Startup
fr: Démarrage
it: Avvio
ja: 起動
ne: सुरुवात

source: Steps
fr: Pas
it: Passi (Steps)
ja: ステップ
ne: चरण

source: Stop playback of the project
fr: Arrête l'exécution du projet
it: Ferma l'esecuzione del progetto
ja: プロジェクトの再生を停止
ne: परियोजनाको प्लेब्याक रोक्नुहोस्

source: Stopping Playback
fr: Arrêter la lecture
it: Esecuzione Fermata
ja: 再生を停止
ne: प्लेब्याक रोकिदैछ

source: Store references to wave files
fr: Stocker les références aux fichiers son
it: Memorizza i riferimenti ai file wave
ja: WAVE ファイルへの参照を保存
ne: सन्दर्भ वेभ फाइलमा भण्डारण गर्नुहोस्

source: Strength of gain modulation
fr: Amplitude de modulation du gain
it: Intensità della modulazione di guadagno
ja: ゲイン変調の強さ
ne: गेइन मोडुलेसनको बल

source: Strength of linear frequency modulation
fr: Amplitude de la modulation de fréquence linéaire
it: Intensità della modulazione lineare di frequenza
ja: 線形周波変調の強さ
ne: पङ्क्ति आवृति मोडुलेसनको बल

source: Strength of pulse width modulation input (Pulse has to be selected as wave form for this to take effect)
fr: Intensité de l'entrée de la modulation de largeur d'impulsion (l'impulsion doit doit être sous forme d'onde pour que ceci prenne effet)
ja: パルス幅変調入力の強さ (パルスの効果を得るにはこれについて波形を選ぶべき)
ne: प्लस चौडाइ मोड्युलेसन आगतको बल (प्रभाव पार्नका लागि प्लसलाई तरङ्ग फारमको रूपमा चयन गर्नु पर्दछ)

source: Strength of self modulation
fr: Amplitude d'auto-modulation
it: Intensità dell'auto modulazione
ja: 自己変調の強さ
ne: स्वत: मोड्युलेसनको बल

source: String oscillation frequency as note, converted to Hertz according to the current musical tuning
fr: Fréquence d'oscillation d'une corde exprimée par une note, convertie en Hertz selon la tonalité musicale retenue

source: String oscillation frequency in Hertz
fr: Fréquence d'oscillation d'une corde en Hertz

source: Swap IO
fr: Échange entrées/sorties
ja: IO 切り替え
ne: स्वाप IO

source: Swap input with output channels when displaying synthesis modules?
fr: Échange les canaux d'entrée avec les canaux de sortie lors de l'affichage des modules de synthèse sonore
it: Scambio l'ingresso con l'uscita quando visualizzo i moduli di sintesi?
ja: シンセモジュールを表示しているときに入力を出力チャネルに切り替えるかどうか
ne: सिन्थेसिस मोड्युल प्रदर्शन गर्दा आगतलाई निर्गत च्यानलसँग सटाउनुहुन्छ ?

source: Switch the two control inputs to work like a chain of gain controls, rather than mixing them together, weighted by balance.
fr: Permute les deux entrées de contrôle pour fonctionner comme un enchaînement de contrôles de gain, plutôt que de les mélanger en les pondérant par la balance.
ja: 二つのコントロール入力を切り替えて、それらをミックスしてバランスで重みをつけるのではなく、ゲインコントロールの連鎖として機能させる
ne: नाफा नियन्त्रणको श्रृङ्खलाको रूपमा कार्य गर्न दुई नियन्त्रण आगतलाई स्विच गर्नुहोस्, त्यसलाई मिश्रण गर्नुको सट्टा, सन्तुलनद्वारा तौल गरिएको

source: Switches
fr: Interrupteurs
it: Interruttori
ne: स्विच

source: SynDrum Output
fr: Sortie SynDrum
it: Uscita SynDrum
ja: SynDrum 出力
ne: सिन्ड्रम निर्गत

source: Syncronization Input
fr: Entrée synchronisation
it: Sincronizzazione Ingresso
ja: 同期入力
ne: सिन्क्रोनाइजेसन आगत

source: Syncronization Output
fr: Sortie synchronisation
it: Sincronizzazione Uscita
ja: 同期出力
ne: सिन्क्रोनाइजेसन निर्गत

source: Syncronize left and right volume
fr: Synchronise le volume du canal droit et du canal gauche
it: Sincronizza il volume sinistro e destro
ja: 左右の音量を同期
ne: दायाँ र बायाँ भोल्युम सिन्क्रोनाइज गर्नुहोस्

source: Synth Control Frequency
fr: Fréquence de contrôle de la synthèse
it: Controllo Frequenza Synth
ja: シンセコントロール周波数
ne: सिन्थ नियन्त्रण आवृति

source: Synth Done
fr: Synthèse effectuée
ja: シンセ完了
ne: सिन्थ गरियो

source: Synth Input
fr: Entrée synthétiseur
it: Ingresso Sint.
ja: シンセ入力
ne: सिन्थ आगत

source: Synth Mixing Frequency
fr: Fréquence de mixage de la synthèse
ja: シンセミキサ周波数
ne: सिन्थ मिश्रण आवृति

source: Synthesis Modules
fr: Modules de synthèse
it: Moduli di Sintesi
ja: シンセモジュール
ne: सिन्थेसिस मोड्युल

source: Synthesis Settings
fr: Réglages de la synthèse
it: Impostazioni Sintesi
ja: シンセ設定
ne: सिन्थेसिस सेटिङ

source: Synthesis mixing frequency, common values are: 22050, 44100, 48000
fr: Fréquences de mixage de la synthèse, les valeurs habituelles sont : 22050, 44100, 48000
it: Frequenza di sintesi. I valori più comuni sono: 22050Hz, 44100Hz e 48000Hz
ja: シンセミキサ周波数。通常値: 22050, 44100, 48000
ne: सिन्थेसिस मिश्रण आवृति, साझा मानहरू: २२०५०, ४४१००, ४८०००

source: Synthesis module currently busy
fr: Module de synthèse actuellement occupé
it: Attuale modulo(i) di sintesi occupato(i)
ja: シンセモジュールは現在ビュジーです
ne: सिन्थेसिस मोड्युल हाललाई ब्यस्त

source: Synthesis network or wave to be used as instrument by this track
fr: Réseau de synthèse ou son à utiliser en tant qu'instrument par cette piste
it: Rete di Sintesi o wave usato come strumento da questa traccia
ja: このトラックでインストゥルメントとして使うシンセネットワーク
ne: यो ट्र्याकद्वारा बाजाको रूपमा प्रयोग हुने सिन्थेसिस सञ्जाल वा तरङ्ग
