Repository: tim-janik/beast
Catalog: po/*.po
Languages: fr, it, ja, ne

source: Synthesis network to be used as MIDI instrument
fr: Réseau de synthèse à utiliser en tant qu'instrument MIDI
it: Rete di Sintesi atta ad essere usata come strumento MIDI
ne: मिडि बाजाका रूपमा प्रयोग गर्नका लागि सिन्थेसिस सञ्झ्याल

source: Synthesis network to be used as instrument
fr: Réseau de synthèse à utiliser en tant qu'instrument
it: Reti di sintesi atte ad essere usate come strumento
ja: インストゥルメントとして使うシンセネットワーク
ne: बाजामा प्रयोग गर्न सिन्थेसिस सञ्जाल

source: Synthesis network to be used as postprocessor
fr: Réseau de synthèse utilisé en post-traitement
it: Rete di sintesi usata come postprocessore
ja: ポストプロセッサとして使うシンセネットワーク
ne: पोष्टप्रोसेसरका रूपमा प्रयोग हुने सिन्थेसिस सञ्जाल

source: Synthesis network to use as embedded sub network
fr: Réseau de synthèse à utiliser en tant que sous-réseau intégré
it: Rete di sintesi da usare come rete secondaria inclusa
ja: 組み込み副ネットワークとして使うシンセネットワーク
ne: सम्मिलित सब सञ्जालको रूपमा प्रयोग गर्न सिन्थेसिस सञ्जाल

source: Synthesis signals (from tracks and busses) used as bus input
fr: Signaux synthétisés (provenant des pistes et des bus) utilisés en entrée de bus
it: Segnali di sintesi (dalle tracce e dai bus) usati come ingresso al bus
ja: バス入力として使う(トラックとバスからの)シンセ信号
ne: बस आगतमा सिन्थेसिस सङ्केतहरूको प्रयोग (ट्र्याक र बसहरूबाट)

source: Synthesize a note on a song of an active project.
fr: Synthétise une note dans une mélodie pour un projet actif.
it: Sintetizza una nota su una canzone di un progetto attivo.
ja: アクティブなプロジェクトの曲のノートをシンセサイズ
ne: सक्रिय परियोजनाको द्रष्टव्य गीतमा सिन्थेसाइज गर्नुहोस्

source: Synthesizer
fr: Synthétiseur
it: Sintetizzatore
ja: シンセサイザ
ne: सिन्थेसाइजर

source: Synthesizer Selection: %s
fr: Sélection du synthétiseur : %s
it: Selezione Sintetizzatore: %s
ne: सिन्थेसाइजर चयन: %s

source: Synthesizer: %s
fr: Synthétiseur : %s
it: Sintetizzatore: %s
ja: シンセサイザー: %s
ne: सिन्थेसाइजर: %s

source: Technical description of the multi-threaded synthesis engine innards
fr: Description technique des entrailles du moteur de synthèse à voix multiples
it: Descrizione tecnica della sintesi multiprocesso nativa
ja: マルチスレッドシンセエンジン内部の技術的な説明
ne: बहु-थ्रेड भएको सिन्थेसिस इन्जिन इन्नर्ड्सको प्राविधिक वर्णन

source: Temporary error
fr: Erreur temporaire
it: Errore Momentaneo
ne: अस्थायी त्रुटि

source: Tension Decay
fr: Diminution de la tension

source: Tension of the string
fr: Tension de la corde
it: Tensione della corda

source: Text Color
fr: Couleur du texte
it: Colore Testo
ja: 文字色
ne: पाठको रङ

source: Text Entry
fr: Saisie de texte
it: Inserisci Testo
ja: テキストエントリ
ne: पाठ प्रविष्टि

source: The Pentatonic Gogo scale is an anhemitonic pentatonic scale used to tune the instruments of the Gogo people of Tanzania.
fr: L'échelle pentatonique gogo est une échelle anhémitonique utilisée pour accorder les instruments de musique du peuple Gogo de Tanzanie.

source: The Silbermann-Sorge temperament is a meantone temperament used for Baroque era organs by Gottfried Silbermann.
fr: Le tempérament Silbermann-Sorge est un tempérament mésotonique utilisé pour les orgues de la période baroque par Gottfried Silbermann.

source: The alignment of the lines in the text of the label relative to each other. This does NOT affect the alignment of the label within its allocation.
fr: L'alignement des lignes du texte de l'étiquette les unes par rapport aux autres. Cela NE modifie PAS l'alignement de l'étiquette dans son emplacement.
ja: ラベルのテキスト内の線間を調整。ラベルの配置の調整ではありません
ne: पङ्क्तिबद्व भएको लेबुल पाठको पङ्क्ति एक अर्कोसँग सम्बन्धित छ । यसले बाडफाँड बीचमा लेबुलको पङ्क्तिबद्वलाई प्रभाव पार्दैन ।

source: The audio channel to play, usually 1 is left, 2 is right
fr: Le canal audio à exécuter, habituellement 1 est le canal gauche, 2 le droit
it: I canali audio d'ascolto sono il numero 1 per il sinistro e il numero 2 per il destro
ne: अडियो च्यानल सुरु गर्नका लागि, खासगरी १ बायाँ हो, २ दायाँ हो

source: The blues scale is the minor pentatonic with an additional augmented fourth, which is referred to as the "blues note".
fr: L'échelle du blues est une pentatonique mineure avec une quatrième additionnelle augmentée, que l'on désigne sous le vocable de « blues note ».

source: The direction of cell movement each time an event or note was edited
fr: La direction du déplacement dans les cellules chaque fois qu'un événement ou une note a été édité.
it: Direzione dello spostamento sopra un evento o una nota già editata
ja: イベントまたはノートが編集される度のセルの移動の方向
ne: घटना वा द्रष्टव्य सम्पादन गरिने प्रत्येक समयमा कक्षको ड्राइभरो दिशा

source: The feedback amount; a negative feedback inverts the signal
fr: Le taux de rétroaction ; une rétroaction négative inverse le signal.

source: The filter design type
fr: Le type conceptuel du filtre
it: Tipo di filtro
ja: フィルターデザインタイプ
ne: फिल्टर डिजाइन प्रकार

source: The filter gain normalization type (supported only by highpass and lowpass)
fr: Le type de normalisation du gain du filtre (pris en charge uniquement par les filtres passe-haut et passe-bas)
it: Normalizzazione del guadagno del filtro (supportato solo dal filtro passa alto e passa basso)
ja: フィルタゲイン正規化タイプ (高/低周波パスフィルタだけがサポート)
ne: चयन गेइन सामान्यकरण प्रकार (माथिल्लो पास र तल्लो पासले मात्र समर्थन गर्दछ)

source: The last program version that displayed this message type
fr: La précédente version de programme ayant affiché ce type de message
it: L'ultima versione del programma che ha visualizzato questo tipo di messaggio
ja: このメッセージタイプを表示した最後のプログラムバージョン
ne: अन्तिम कार्यक्रम संस्करण जसले सूचना प्रकारको प्रदर्शन गर्दछ

source: The mnemonic accelerator key for this label
fr: Le mnémonique du raccourci clavier pour cette étiquette
it: Scorciatoia mnemonica per questa etichetta
ja: このラベルのニーモニックショートカットキー
ne: यो लेबुलका लागि एम्नेमोनिक गतिबर्धक कुञ्जी

source: The most common tuning system for modern Western music, is the twelve-tone equal temperament, abbreviated as 12-TET, which divides the octave into 12 equal parts.
fr: Le tempérament à 12 tons égaux, abrégé en 12-TET est le système d'accord le plus courant pour la musique moderne occidentale. Il divise l'octave en 12 parts égales.

source: The number of cells to move across each time an event or note was edited
fr: Le nombre de cellules dont il convient de se déplacer chaque fois qu'un événement ou une note a été édité.
it: Numero di passi da muovere ogni volta sopra un evento o una nota già editata
ja: イベントまたはノートが編集される度にいくつ分セルを移動するか
ne: घटना वा द्रष्टव्य सम्पादन गरिने प्रत्येक समयमा वरिपरि सारिने कक्षहरूको सङ्ख्या

source: The pattern editor column layout is specified by listing column types with possible modifiers in display order.
fr: La disposition des colonnes dans l'éditeur de motifs est précisée par la liste des types de colonnes, avec les modificateurs possibles, dans l'ordre d'affichage.
it: L'aspetto dell'editor di pattern è specificato dalla lista che segue, tramite la quale è possibile modificare l'ordine di visualizzazione delle colonne.
ja: パターンエディタカラム配置は、可能なモディファイアと共にカラムタイプを表示する順番に並べることで指定されます
ne: प्रदर्शन क्रममा सम्भवत परिमार्जकहरूसँग सूचीकृत स्तम्भद्धारा बाँन्की सम्पादक स्तम्भ सजावट निर्दिष्ट गरिन्छ।

source: The port name is a unique name to establish input<->output port relationships
fr: Le nom du port doit être un nom unique pour établir les relations entrée<->sortie du port
it: Il nome della porta è unico e questo permette di stabilire una relazione diretta tra porte di ingresso e porte di uscita
ja: 入出力ポートの関係を確立するためにポート名として固有な名前を与えます
ne: आगत<->निर्गत पोर्ट सम्बन्ध स्थापना गर्न पोर्टको नाम अद्वितिय नाम छ

source: The project has been modified.
fr: Le projet a été modifié.
it: Il progetto è stato modificato.
ne: परियोजना परिमार्जन गरिएको छ।

source: The rack editor is still highly experimental code and guaranteed to be broken by future releases. So don't rely on rack editor contents to look similarly in future versions and be prepared to work around possible instabilities in the code (i.e. save your projects regularly).
fr: L'éditeur de rack est encore codé de manière tout à fait expérimentale ; il est certain qu'il sera modifié dans les futures parutions. Donc ne comptez pas sur une ressemblance dans les éditions futures avec le contenu actuel de l'éditeur de rack et préparez-vous à devoir contourner les inconvénients de possibles instabilités du code (autrement dit : enregistrez vos projets régulièrement).
ja: ラックエディタはまだ非常に実験的なコードであり、将来リリースされるまではきっと壊れているでしょう。従って将来のリリースでは違っているであろうラックエディタの内容に信頼をおかず、コードの不安定性を考えておく(すなわちプロジェクトを定期的に保存する)ようにして下さい。
ne: र्याक सम्पादक अहिले पनि प्रयोगात्मक सङ्केत हो र भविष्यको निश्काशनमा निश्चित रूपमा बिग्रन्छ । त्यसैले र्याक सम्पादकलाई भविष्यको संस्करणमा उहि रूपमा हेर्नेमा विश्वास नगर्नुहोस् र सङ्केतमा आउने सम्भावित अस्थिरता सम्बन्धि काम गर्न तयार हुनुहोस् (जस्तै, तपाईँको परियोजना नियमित रूपमा बचत गर्नुहोस्)

source: The ratio of frequency shift. (i.e. 1.0 means shift equal to the drum's base frequency)
fr: Le décalage de rapport de fréquence (1.0 signifie que le décalage est égal à la fréquence de base de la batterie).

source: The resonance half life in number of milli seconds
fr: La demi-vie de la résonance en nombre de millisecondes

source: The text of the label
fr: Le texte de l'étiquette
it: Il testo dell'etichetta
ja: ラベルのテキスト
ne: लेबलका पाठ

source: The tick/note length per line
fr: La longueur du top d'horloge/note par ligne
it: Risoluzione per durata di nota
ja: 線当りのティック/ノート長
ne: प्रत्येक लाइन चिन्ह/टिप्पणी लम्बाइ

source: The time for the left to right delay
fr: Le délai du retard gauche à droite

source: The time for the right to left delay
fr: Le délai du retard droite à gauche

source: The tuning system which specifies the tones or pitches to be used. Due to the psychoacoustic properties of tones, various pitch combinations can sound "natural" or "pleasing" when used in combination, the musical tuning system defines the number and spacing of frequency values applied.
fr: Le système d'accord qui précise les timbres ou les hauteurs tonales. En raison des propriétés psycho-acoustiques des timbres, diverses combinaisons de hauteur tonale peuvent sonner « naturellement » ou « agréablement » lorsqu'elles sont mariées ; le système d'accord musical définit les valeurs des fréquences retenues ainsi que leurs écarts.

source: The type of filter to use
fr: Le type de filtre à utiliser
it: Tipo di filtro da usare
ja: 使用するフィルターの種類
ne: प्रयोग गर्ने फिल्टरको प्रकार

source: The velocity of the drum hit
fr: La dynamique des coups sur la batterie

source: The widget to be activated when the label's mnemonic key is pressed
fr: Le widget à activer lorsque la touche mnémonique est enfoncée
it: L'oggetto è attivato quando la chiave mnemonica è premuta
ja: ラベルのニーモニックキーが押されたときにアクティブになるウィジェット
ne: लेबुलको एम्नेमोनिक कुञ्जी थिचेको बेलामा सक्रिय पारिने विजेट

source: Thirty-secondth note
fr: Triple croche
it: Nota da un Trentaduesimo (biscroma)
ja: 32 分ノート
ne: बत्तिसौं द्रष्टव्य

source: This procedure has multiple return values.
fr: Cette procédure a plusieurs valeurs de retour.
it: Questa procedura ha valori di ritorno multipli.
ne: यो कार्यविधिसँग बहुविध फिर्ता मानहरू छ ।

source: This setting can be changed in the "Messages" section of the preferences dialog
fr: Ce réglage peut être modifié dans l'onglet « Messages » de la boîte de dialogue Préférences
it: Queste impostazioni possono essere cambiate nella sezione "Messaggi" della sezione Preferenze
ja: この設定は設定ダイアログの"メッセージ"セクションで変更できます
ne: यो सेटिङ प्राथमिक संवादको "सूचना" क्षेत्रमा परिवर्तन गर्न सकिन्छ

source: This signal goes high after the release phase has completed
fr: Ce signal monte après que la phase de décroissance est terminée
it: Questo segnale diventa alto dopo che il rilascio di fase è stato completato
ja: リリース位相完了後にこの信号が高となる
ne: छाडिएको समय सकिएपछि यो सङ्केत उच्च हुन्छ

source: This tuning is also known as Septenarius tuning is based on a division of the monochord length into 196 = 7 * 7 * 4 parts. The resulting scale has rational frequency relationships, but in practice involves pure and impure sounding fifths. Werckmeister described the Septenarius as a "temperament which has nothing at all to do with the divisions of the comma, nevertheless in practice so correct that one can be really satisfied with it".
fr: Cet accord également connu sous le nom d'accord de septième se fonde sur la division du monocorde en 196 = 7 * 7 * 4 parties. L'échelle résultante possède des rapports de fréquences rationnels, mais en pratique induit des quintes pures et des quintes dissonantes. Werckmeister a décrit cet accord comme « un tempérament qui n'est pas concerné par les divisions du comma ; même s'il est très correct en pratique on ne peut pas en être réellement satisfait ».

source: This tuning uses mostly pure (perfect) fifths, as in Pythagorean tuning, but each of the fifths C-G, G-D, D-A and B-F# is made smaller, i.e. tempered by 1/4 comma. Werckmeister designated this tuning as particularly suited for playing chromatic music.
fr: Cet accord utilise le plus possible les quintes pures (parfaites) comme dans l'accord pythagoricien, mais chaque intervalle des quintes do-sol, sol-ré, ré-la et si-fa# est rendu plus petit, c'est-à-dire tempéré par un quart de comma. Werckmeister classa cet accord comme étant particulièrement adapté pour l'interprétation de la musique chromatique.

source: Thomas Young devised a form of musical tuning to make the harmony most perfect in those keys which are the most frequently used (give better major thirds in those keys), but to not have any unplayable keys. This is attempted by tuning upwards from C a sequence of six pure fourths, as well as six equally imperfect fifths.
fr: Thomas Young inventa une forme d'accord musical pour rendre l'harmonie plus parfaite dans les clés qui sont le plus souvent utilisées (donner de meilleures tierces majeures dans ces clés), tout en ayant aucune clé non interprétable. Il tenta cela en accordant au delà du do une suite de six quartes pures, ainsi que six quintes également imparfaites.

source: Thread ID (on some systems the process ID)
fr: ID de la tâche (sur certains systèmes ID du processus)
it: Thread ID (processo ID)
ja: スレッド ID (システムによってはプロセス ID)
ne: थ्रेड आई डी (केही प्रणालीमा प्रकृया आई डी)

source: Thread Name
fr: Nom de tâche
it: Nome Thread
ja: スレッド名
ne: थ्रेड नाम

source: Thread priority from -20 (high) to +19 (low)
fr: Priorité d'exécution de la tâche de -20 (haute) à +19 (basse)
it: Priorita' thread da -20 (alta) a +19 (bassa)
ja: スレッド優先度(-20:最高 〜 +19:最低)
ne: थ्रेड प्राथमिकता -२० (उच्च) बाट +१९ (तल्लो) सम्म

source: Threshold [dB]
fr: Seuil [dB]
it: Soglia [dB]
ne: थ्रेसहोल्ड [dB]

source: Ticks
fr: Tops d'horloge
it: Risoluzioni
ja: ティック
ne: टिक

source: Time
fr: Horodatage
it: Tempo
ne: समय

source: Time Entry
fr: Saisie horodatage
ja: 時間エントリ
ne: समय प्रविष्टि

source: Timing
fr: Tempo
ja: タイミング
ne: समय

source: Toggle Button
fr: Commutateur
ja: 切り替えボタン
ne: टगल बटन

source: Toggle channel name hints
fr: Afficher/masquer les étiquettes des canaux
it: Pulsante Suggerimenti nome dei canali
ja: チャネル名ヒントを切り替え
ne: च्यानल नाम सङ्केत टगल गर्नुहोस्

source: Toggle exponential and linear control response
fr: Bascule entre une réponse de contrôle de type exponentiel ou linéaire
it: Pulsante controllo risposta esponenziale e lineare
ja: 指数/線形コントロール応答を切り替え
ne: एक्पोनेन्सियल र रेखात्मक नियन्त्रणको टगल गर्दछ

source: Toggle visibility of the tool palette
fr: Afficher/masquer la palette d'outils
it: Pulsante visibilità dello strumento Palette
ja: ツールパレットの表示を切り替え
ne: उपकरण रङदानीको दृश्यात्मकता टगल गर्नुहोस्

source: Toggle whether horizontal movement of the focus cell will wrap around edges
fr: Active/désactive le fait qu'un mouvement horizontal de la cellule ayant le focus change de ligne sur les bords.
ja: セルフォーカスの水平移動を端で折り返すかどうか切り替え
ne: फोकस कक्षको तेर्सो चालले छेउको वरिपिर बेर्दछ कि टगल गर्नुहोस्

source: Too many open files
fr: Trop de fichiers ouverts
it: Troppi file aperti
ne: धेरै खुल्ला फाइल

source: Too many open files in system
fr: Trop de fichiers ouverts dans le système
it: Troppi file aperti nel sistema
ne: प्रणालीमा धेरै खुल्ला फाइल

source: Totals
fr: Totaux
it: Totali
ja: 総計
ne: जम्मा

source: Tracks
fr: Pistes
it: Tracce
ja: トラック
ne: ट्रयाक्स

source: Tracks contain instrument definitions and parts with notes
fr: Les pistes contiennent les définitions d'instruments et les mesures avec les notes
it: Questa sezione contiene le definizioni degli strumenti e le parti con le note
ja: インストゥルメント定義とノートパートを含むトラック
ne: ट्र्याकहरू जुनले बाजाको परिभाषा र अंशको टिप्पणीसँगै संलग्न हुन्छ

source: Transpose
fr: Transposer
it: Trasposizione
ne: ठाउँ सार्नुहोस्

source: Transposition of the frequency in semitones
fr: Transposition de la fréquence par demi-tons
it: Trasposizione in semitoni della frequenza

source: Transposition of the oscillator frequency in semitones
fr: Transposition des fréquences de l'oscillateur par demi-tons
it: Trasposizione in semitoni della frequenza dell'oscillatore
ne: सेमिटोनमा ओस्सिलेटर तरङ्गको ट्रान्सपोजिसन

source: Trigger
fr: Déclencheur

source: Trigger Hit
fr: Coup déclencheur

source: Trigger In
fr: Entrée déclencheur
it: Ingresso Trigger
ja: トリガー入力
ne: ट्रिग्गर आगत

source: Trigger Velocity [%]
fr: Dynamique du déclencheur [%]

source: Trigger filter
fr: Filtre déclencheur
it: Filtro Trigger
ja: トリガーフィルター
ne: ट्रिग्गर फिल्टर

source: Trigger input
fr: Entrée du déclencheur
it: Ingresso Trigger
ne: ट्रिग्गर आगत

source: Triplet eighths note
fr: Triolet sur une croche
it: Terzine di Ottavi (crome)
ja: 三連 8分ノート
ne: ट्रिप्लेट आठौं द्रष्टव्य

source: Triplet half note
fr: Triolet sur une blanche
it: Terzine Metï¿½ (minime)
ja: 三連半ノート
ne: ट्रिप्लेट आधा द्रष्टव्य

source: Triplet hundred twenty-eighth note
fr: Triolet sur une quintuple croche
it: Terzine di Centoventottesimi
ja: 三連 128分ノート
ne: ट्रिप्लेट एक सय अठ्ठाइसौं द्रष्टव्य

source: Triplet quarter note
fr: Triolet sur une noire
it: Terzine di Quarti (semiminime)
ja: 三連 4分ノート
ne: ट्रिप्लेट चौथाइ द्रष्टव्य

source: Triplet sixteenth note
fr: Triolet sur une double croche
it: Terzine di Sedicesimi (semicrome)
ja: 三連 16分ノート
ne: ट्रिप्लेट सोर्हौ द्रष्टव्य

source: Triplet sixty-fourth note
fr: Triolet sur une quadruple croche
it: Terzine di Sessantaquattresimi (semibiscrome)
ja: 三連 64分ノート
ne: ट्रिप्लेट चौसाठ्ठिऔं द्रष्टव्य

source: Triplet thirty-secondth note
fr: Triolet sur une triple croche
it: Terzine di Trentaduesimi (biscrome)
ja: 三連 32分ノート
ne: ट्रिप्लेट बत्तिसौं द्रष्टव्य

source: Triplet whole note
fr: Triolet sur une ronde
it: Terzine intere (semibrevi)
ja: 三連全ノート
ne: ट्रिप्लेट पूरा द्रष्टव्य

source: Tuning
fr: Accord

source: Unconnected Output Channel
fr: Canal de sortie non connecté
it: Canali d'Uscita non Connessi
ja: 未接続の出力チャネル
ne: जडान नगरिएको आगत च्यानल

source: Undo
fr: Annuler
it: Annulla
ja: アンドゥ
ne: पूर्वस्थितिमा फर्काउनुहोस्

source: Undo last editing step
fr: Annule la dernière modification de texte
it: Annulla l'ultimo passo editato
ja: 最後に編集したステップをアンドゥ
ne: अन्तिम सम्पादन चरण पूर्वस्थितिमा फर्काउनुहोस्

source: Undo the effect of the last action
fr: Annule l'effet de la dernière action
it: Annulla l'effetto dell'ultima azione
ja: 最後のアクションのエフェクトをアンドゥ
ne: पछिल्लो कार्यको प्रभाव पूर्वस्थितिमा फर्काउनुहोस्

source: Unfiltered Audio Signal
fr: Signal audio non filtré
it: Segnale Audio Non Filtrato
ja: 未フィルターのオーディオ信号
ne: फिल्टर नगरिएको अडियो सङ्केत

source: Unfiltered Input
fr: Entrée non filtrée
it: Ingresso Non Filtrato
ja: 未フィルターの入力
ne: फिल्टर नगरिएको आगत

source: Unique name of this object
fr: Dénomination unique de cet objet
it: Nome unico di questo oggetto

source: Unknown error
fr: Erreur inconnue
it: Errore sconosciuto
ne: अज्ञात त्रुटि

source: Unknown format
fr: Format inconnu
it: Formato sconosciuto
ne: अज्ञात ढाँचा

source: Unselect all events
fr: Désélectionner tous les événements
it: Deseleziona tutti gli eventi
ne: सबै घटना चयन नगर्नुहोस्

source: Unselect all notes
fr: Désélectionne toutes les notes
it: Deseleziona tutte le note
ne: सबै द्रष्टव्यहरू चयन नगर्नुहोस्

source: Unspecified length
fr: Taille non précisée
it: Durata non specificata
ja: 未指定の長さ
ne: समावेश नगरिएको लम्बाइ

source: Unused
fr: Inutilisé
it: Non usato
ja: 未使用
ne: प्रयोग नगरिएको

source: Up
fr: Haut
it: Su
ja: 上へ
ne: माथि

source: Updating View
fr: Mise à jour de la vue
it: Aggiornamento Vista
ja: ビューを更新中
ne: दृश्य अद्यावधिक गर्दैछ

source: Use the horizontal ruler to adjust the left loop pointer
fr: Utiliser la règle horizontale pour ajuster le pointeur de boucle de gauche
it: Imposta il punto ciclico di sinistra sul righello orizzontale
ja: 左ループポインタを調整するための水平ルーラーを使用
ne: बायाँ लुप सूचक मिलाउन तेर्सो रूलर प्रयोग गर्नुहोस्

source: Use the horizontal ruler to adjust the play position pointer
fr: Utiliser la règle horizontale pour ajuster la position du pointeur d'exécution
it: Imposta il punto d'avvio di riproduzione sul righello orizzontale
ja: 演奏位置ポインタを調整するための水平ルーラーを使用
ne: प्ले स्थान सूचक समायोजन गर्न तेर्सो रूलर प्रयोग गर्नुहोस्

source: Use the horizontal ruler to adjust the right loop pointer
fr: Utiliser la règle horizontale pour ajuster le pointeur de boucle de droite
it: Imposta il punto ciclico di destra sul righello orizzontale
ja: 右ループポインタを調整するための水平ルーラーを使用
ne: दायाँ लुप सूचक समायोजन गर्न तेर्सो रूलर प्रयोग गर्नुहोस्

source: Use underline
fr: Utiliser le soulignement
it: Usa sottolineatura
ja: 下線を利用
ne: कच प्रयोग गर्नुहोस्

source: VScale:
fr: ÉchelleVert :
it: Scala Verticale:
ja: 垂直方向スケール:
ne: भि स्केल:

source: Value [float]
fr: Valeur [réel en virgule flottante]
it: Valore [float]
ja: 値 [浮動小数]
ne: मान [फ्लोट]

source: Velocity
fr: Dynamique
ja: ヴェロシティ
ne: वेग

source: Velocity Out
fr: Sortie dynamique
ja: ヴェロシティ出力
ne: वेग बाहिर

source: Velocity of the note press
fr: Dynamique du toucher de la note
ja: ノートプレスのヴェロシティ
ne: द्रस्टव्य प्रेसको वेग

source: Velocity of the string pluck
fr: Dynamique du pincement de corde

source: Velocity while the note is pressed
fr: Dynamique selon le toucher de la note
ja: ノートプレス間のヴェロシティ
ne: द्रष्टव्य दबिए पछिको वेग

source: Vertical Bar Color
fr: Couleur des barres verticales
it: Colore Linea Verticale
ja: 垂直バーの色
ne: ठाडो पट्टी रङ

source: Vertical Grid Color
fr: Couleur de la grille verticale
it: Colore Griglia Verticale
ja: 垂直グリッドの色
ne: ठाडो ग्रिड रङ

source: Vertical Region
fr: Région verticale
it: Regione Verticale
ja: 垂直領域
ne: ठाडो क्षेत्र

source: Vertical Scale
fr: Échelle verticale
it: Scala Verticale
ja: 垂直方向スケール
ne: ठाडो मापन

source: Vertical Scale (Logarithmic)
fr: Échelle verticale (logarithmique)
it: Scala Verticale (Logaritmica)
ja: 垂直方向スケール(対数)
ne: ठाडो मापन (लोगारिथ्मिक)

source: Vertical Select
fr: Sélection verticale
it: Selezione Verticale
ja: 垂直方向に選択
ne: ठाडो चयन

source: Vertical piano zoom
fr: Zoom vertical sur le clavier
it: Ingrandimento piano verticale
ja: 垂直方向ピアノズーム
ne: ठाडो पियानो जुम

source: Virtual Rack
fr: Rack virtuel
it: Rack Virtuale
ja: 仮想ラック
ne: अवास्तविक र्याक

source: Virtual input %u
fr: Entrée virtuelle %u
it: Ingresso virtuale %u
ja: 仮想入力 %u
ne: अवास्तविक आगत %u

source: Virtual output %u
fr: Sortie virtuelle %u
it: Uscita virtuale %u
ja: 仮想出力 %u
ne: अवास्तविक निर्गत %u

source: Volume adjustment in decibel of left bus channel
fr: Ajustement du volume en décibels pour le bus du canal gauche
it: Regolazione volume in decibel del canale sinistro del bus
ja: 左バスチャネルの音量調整(dB)
ne: बायाँ बस च्यानलको डेसिबलमा भोल्युम समायोजन

source: Volume adjustment in decibel of right bus channel
fr: Ajustement du volume en décibels pour le bus du canal droit
it: Regolazione volume in decibel del canale destro del bus
ja: 右バスチャネルの音量調整(dB)
ne: दायाँ बस च्यानलको डेसिबलमा भोल्युम समायोजन

source: WAVE File
fr: Fichier WAVE
it: File WAVE
ja: WAVE ファイル
ne: वेभ फाइल

source: Wave
fr: Son
it: Onda
ja: 波
ne: तरङ्ग
